[
    {
        "name": "Bouddha",
        "location": "Kathmandu",
        "history": "Boudha Stupa, a UNESCO World Heritage Site, stands as a blend of Newar, Tamang, Sherpa, and Tibetan cultures, making it a unique symbol of the rich cultural and spiritual diversity of the Kathmandu Valley. Located in the northeastern part of Kathmandu, this massive stupa is one of the largest in the world and serves as a major pilgrimage site for Buddhists from different traditions. The stupa's grand dome, adorned with the Buddha's all-seeing eyes, reflects the region's deep Buddhist heritage. Surrounding the stupa are numerous monasteries, shrines, and shops, creating a lively atmosphere where local traditions and rituals thrive. The area is especially significant during major Buddhist festivals like Buddha Jayanti and the Boudha Stupa Jatra, when devotees from diverse communities come together to celebrate and perform rituals. The cultural richness of Boudha makes it not only a religious hub but also a cultural crossroads, offering visitors a glimpse into the harmonious blending of various Buddhist traditions.\nHistory\nBoudha Stupa is one of the largest and most significant Buddhist sites in Nepal. Its origin remains unclear, with various historical sources offering different accounts. According to Nepalese records, the stupa was constructed during the Licchavi period. Gopal Raj Vansavali, a historical chronicle, credits King Shiva Dev with the construction of the stupa, while Mary Slusser suggests that King Mandeva may have been involved in its initial erection, with Shiva Dev later renovating it. Tibetan sources associate Boudha with King Songtsen Gampo, who is believed to have initiated the establishment of Buddhist temples, including the one at Boudha. After the Chinese occupation of Tibet in 1959, Boudha became a key center for Tibetan exiles, significantly contributing to its religious and cultural development.\n\nLegends of Boudha Stupa\n1. Kathmandu Legend: A prominent legend associated with the Boudha Stupa originates from Kathmandu during the Licchavi period. According to the story, King Dharmadev constructed a stone spout near his palace, but it mysteriously dried up, causing a severe drought in the kingdom. Distressed, the king consulted astrologers, who advised him to perform a human sacrifice to bring an end to the drought. They instructed the king to sacrifice someone who possessed all thirty-two virtues, a rare attribute. After an extensive search, it was discovered that only the king and his son, Manadeva, possessed these virtues.\nReluctant to sacrifice his son, the king decided to offer his own life and instructed Manadeva to decapitate a hooded stranger at the stone spout the next morning. However, when Manadeva returned to the palace, he realized, to his horror, that he had unwittingly killed his father. Filled with grief and guilt, Manadeva renounced the throne and chose to live a life of seclusion.\nAs time passed, the kingdom continued to suffer from the drought. In his despair, Manadeva had a vision in which Vajra Yogini appeared to him, instructing him to release a bird and build a stupa at the spot where the bird landed. Following this vision, Manadeva released a bird, and it landed at the site of what would become the Boudha Stupa. The construction of the stupa was difficult due to a lack of water to mix the clay. However, the laborers ingeniously collected dew using large sheets of cloth, which allowed them to complete the stupa. The use of dew, known as \"khasu ti\" in Nepal Bhasa, led to the stupa being named Khasu Ti Chaitya, a name that later evolved into Khasti Chaitya.\n2. Tibetan Legend: A different, yet equally significant, legend comes from Tibetan Buddhism. According to this account, Avalokitesvara, the Bodhisattva of Compassion, had vowed to release all sentient beings from suffering. After years of efforts, Avalokitesvara looked down from his palace, only to find that many beings continued to suffer, despite his best efforts. Overcome by despair, Avalokitesvara wept, and his tears fell to the ground. These teardrops were believed to have transformed into the daughters of Indra, the king of the gods.\nOne of these daughters, Apurna, was born as a human named Jadzima, into a humble family. As she grew up, Jadzima worked hard to support her children and eventually saved enough money to fulfill a noble aspiration—to build a grand stupa that would help alleviate suffering. Despite opposition from the local nobility, who were jealous of her plans, the king granted her permission to build the stupa. The stupa came to be known as \"Jharung Khasor,\" meaning \"permission to build,\" symbolizing the king’s approval despite the resistance from the powerful elites. This stupa, built with the intention to end suffering, continues to serve as a significant religious and cultural landmark.",
        "images": [
            "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/BoudhaStupa.png",
            "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/BoudhaStupa1.png"
        ],
        "latlng": [
            27.721433,
            85.362018
        ],
        "monuments": [
            {
                "name": "Ajima Temple",
                "location": "Bouddha",
                "history": "The Ajima Temple, located near Boudha Stupa, is a small, single-room structure with a copper roof and ceramic walls, featuring a steel lattice screen at its entrance. Inside, it holds a silver deity, often covered with cloth, depicted sitting with a human corpse on her lap. Above her, she is shown in a fierce pose, holding the same corpse. This deity, known by different names across communities, is seen as a protective goddess. In Tibetan Buddhism, she is referred to as Jadzima, while Newars call her Ajima, meaning \"Grandmother.\" Hindus may associate her with deities like Sitala or Chamunda, fierce figures often depicted consuming corpses. Though considered wrathful, Ajima is seen as a protector, granting power to her devotees. The temple's origins and interpretations vary, with some connecting her to Hariti, a demoness who later became a protector of Buddha's shrines.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/AjimaTemple1.png",
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/AjimaTemple.png"
                ],
                "latlng": [
                    27.721829,
                    85.361817
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/watch?v=NLzhmuTe2K4&list=PLmTt9hYZOATBi87Ysj1Ak2-pcW9b0FV3I"
                ],
                "id": "f682d8b2-33de-4714-837b-5c13f62bddeb"
            },
            {
                "name": "Ghyoilisang Pond (Peace Park)",
                "location": "Bouddha",
                "history": "Ghyoilisang Pond, now known as Peace Park, is located northwest of Boudha Stupa and covers an area of 15,289.80 sq. ft. Historically, it is believed that soil from the Boudha Stupa construction site was removed, gradually forming the pond. In recent years, the site has been transformed into Peace Park, a place of spiritual and cultural significance. In 2073 B.S., a statue of Guru Rinpochhe was placed at the center of the pond, and additional monuments, including chaityas and deity statues, have been added. The Peace Park now offers a tranquil space blending natural beauty with spiritual heritage.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/GhyoiLisangPond.png"
                ],
                "latlng": [
                    27.722366,
                    85.361403
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "699c2d6d-88d5-435d-80b9-b1a3f7939a67"
            },
            {
                "name": "Jamchen Monastery",
                "location": "Bouddha",
                "history": "Jamchen Monastery, located in the Boudha Stupa area, is the first monastery encountered when circling the stupa from the main gate. It belongs to the Sakyapa school of Himalayan Buddhism and is also known as Mustang Monastery, as it was funded by the Raja (King) of Mustang. The monastery was constructed starting in 1982 on land donated by the niece of the late Chini Lama. A three-story statue of Jampa (Maitreya or Future Buddha) is housed inside. The monastery's grand inauguration in 1986 was attended by former King Birendra of Nepal and unexpectedly honored by former U.S. President Jimmy Carter. According to some sources, it was founded by Venerable Chyopge Thichen Rinpoche and enshrines a statue of Trik Ma Buddha  (Gyalwa Jampa).",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/JhamchenLakhangMonastery1.JPG",
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/JhamchenLakhangMonastery.JPG"
                ],
                "latlng": [
                    27.721484,
                    85.361385
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "e62762ac-e5a9-4cba-9d25-526fc6dd5360"
            },
            {
                "name": "Guru Lhakhang Monastery",
                "location": "Bouddha",
                "history": "The Guru Lhakhang Monastery is a significant spiritual site of the Nyingma tradition. Located to the north of the stupa, this monastery, also referred to by locals as the \"Tamang Gumba\", is the oldest in the area adhering to the Nyingma and Jhyang Ter traditions. Within its sacred space are enshrined revered statues of Amitabha Buddha, Arya Avalokiteshvara, Guru Padmasambhava, and other prominent figures of Himalayan Buddhism. Visitors to the monastery can enjoy a breathtaking view of the majestic Boudha Stupa from its rooftop, adding to the monastery's spiritual and visual appeal.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/GuruLakhangMonastery.png"
                ],
                "latlng": [
                    27.722041,
                    85.362062
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "51e360ff-97ca-48f5-ad16-4b104d1cc9af"
            },
            {
                "name": "Kyidong Tashi Samteling Monastery",
                "location": "Bouddha",
                "history": "Kyidong Tashi Samtenling Monastery, located near Boudha Stupa in Kathmandu, is the first Tibetan monastery established in the area after the Tibetan upheaval of 1960. It serves as a spiritual center, dedicated to preserving Tibetan traditions, rituals, and teachings. The monastery focuses on the tantric practices of the Geluk tradition, emphasizing rituals related to the three main tantric deities. It is known for its preservation of monastic arts, including ritual decoration, chanting, religious music, and tantric ceremonies. The monastery also provides modern education for its younger monks, offering courses in moral education and languages. It currently houses hundreds of monks, many from Tibet and Nepal’s remote regions like Rasuwa, Manang, and areas with Sherpa and Tamang communities.",
                "images": null,
                "latlng": [
                    27.721733,
                    85.362415
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "09828c28-8ec6-4bb7-a1fc-f3e07548bb6d"
            },
            {
                "name": "Dilyak Yevam (1000 Buddha's Monastery) (Palri Tashi Migyur Dorje Gyaltsen Ling)",
                "location": "Bouddha",
                "history": "Located to the north-east of the Boudha Stupa, on the way to Phulbari, Dilyak Yevam Monastery, also known as Dhapsang Monastery, was founded by Venerable Rinpoche Dazang Ngeden Chhoeki Ngima Palsangpo in 1966 A.D. It follows the Kagyu tradition of Himalayan Buddhism and is renowned for housing statues of a thousand Buddhas. Regular Dharma rituals are performed daily, ensuring the continuation of spiritual practices for the community.",
                "images": null,
                "latlng": [
                    27.72144,
                    85.362551
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "ecec5e5c-1cf9-4141-9f20-5c11e3b51dda"
            }
        ],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": [
            "https://www.youtube.com/watch?v=VTLDCM6bMio&list=PLmTt9hYZOATBi87Ysj1Ak2-pcW9b0FV3I"
        ],
        "id": "b1c401bb-1579-490c-9794-a53d86f8ab03"
    },
    {
        "name": "Swoyambhu Mahachaitya",
        "location": "Kathmandu",
        "history": "The Swoyambhu Stupa is situated to the northwest of Kathmandu, atop a green hill known by various names: 'Gau Puche Parbat', 'Padmagiri' and 'Vajrakutta Parbat'. Nearby is Manjushree Hill, also referred to as 'Gau Singhe Parbat'. These hills are named 'Gau Singhe' and 'Gau Puche' because, from Nagarjun Hill, their shapes resemble a cow. Manjushree Hill appears as a cow's horn, while Swoyambhu Hill resembles the cow's tail.\nThe Swoyambhu Stupa, estimated to be over 1,500 years old, is a highly revered landmark in the Kathmandu Valley. The term 'Swoyambhu' in Nepal Bhasa translates to 'self-sprung' or 'self-manifested'. The most common route to the summit involves climbing 365 steps from the front entrance. Alternatively, the rear entrance, accessible by car or scooter, requires only a few steps to reach the top. The site’s integration of Hindu and Buddhist elements creates a distinctive and harmonious fusion of traditions that is seldom encountered elsewhere. (Buddhacharya, A. M. (2024, June 13). Insights on Swoyambhu Stupa [Interview with a local cultural expert].)\n● Mythology of Swoyambhu\nAccording to the Swoyambhu Purana, the Kathmandu Valley was once a vast and beautiful lake. When Vipaswi Buddha arrived, he planted a lotus seed at the site where the Swoyambhu Stupa now stands. The seed grew into a magnificent lotus with a thousand petals, its radiant light was visible from afar and drawing many pilgrims. Due to its luminous quality, the site came to be known as Jyoti Chaitya or Ratna Chaitya.\nImpressed by the divine light of the lotus, Manjushri believed that draining the lake would make the site more accessible to human pilgrims. Using his great sword, he carved a gorge in the surrounding mountains, allowing the water to drain and revealing the valley that is now Kathmandu. As the lake dried up, the lotus emerged on the hill, which eventually became the location of the Swoyambhu Stupa.\nMany years later, Shantikaracharya, who came to Nepal on pilgrimage, recognized the need to preserve this sacred light. To honor and protect the spot where the lotus had once bloomed, he is believed to have constructed the stupa. (Buddhacharya, A. M. (2024, June 13). Insights on Swoyambhu Stupa [Interview with a local cultural expert].)\n● History of Swoyambhu\nAccording to the Gopal Raj Vamsavali, a 14th-century manuscript from Nepal, the Swoyambhu Stupa was established by King Vrsadeva, the great-grandfather of King Manadeva (464–505 CE), during the Licchavi period in the early 5th century CE. This is supported by a damaged stone inscription at the site, which records that King Manadeva commissioned further work in 640 CE. Additionally, Emperor Ashoka is believed to have visited the site in the 3rd century BCE and constructed an early temple, which subsequently fell into disrepair for reasons that remain unknown. In 1349, during the first Muslim invasion of Kathmandu, the Swoyambhu Stupa was completely destroyed. It was subsequently repaired. Following the construction of the main stupa, additional monuments were added over time by various dynasties. The eastern stairway was built in the 17th century by King Pratap Malla, a prominent ruler of Kathmandu. (Vredeveld, n.d.)\nIn 1918 CE, with authorization from the Nepalese government, the 14th major renovation of Sri Swoyambhu Mahachaitya was undertaken. This restoration involved replacing the harmika and repairing the 13 bronze disks. The work was completed over a period of three years, finishing in 1921 CE. (Tuladhar, 2021)\nThe 15th renovation of Sri Swoyambhu MahaChaitya occurred between 2008 and 2010, resembling a massive jigsaw puzzle. Over 30,000 pieces were carefully removed, repaired, cleaned, and reassembled using more than 100,000 nails. Additionally, all the metal plates received a fresh layer of gold, utilizing 20 kg of the precious metal is one of the largest gold restoration projects ever undertaken. (Parashar, 2010)\n\n● Buddhacharya Family\nThe Buddhacharya family descends from four legendary brothers tasked with preserving the traditions, norms, and values of Swoyambhu, as designated by Shantikar Acharya. The community is divided into four lineages—referred to as \"KA: WA:\"—which trace their roots back to these brothers, who established the clan centuries ago. Together, these lineages encompass 30 families, each representing the legacy of one of the four brothers. Each group has its own leader, guiding their members in honoring their shared heritage. (Buddhacharya et al., 2019)",
        "images": [
            "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/swoyambhunath3.png",
            "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/swoyambhunath1.jpg",
            "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/swayambhunath2.png"
        ],
        "latlng": [
            27.714918,
            85.29055599999998
        ],
        "monuments": [
            {
                "name": "Amitabha Buddha",
                "location": "Swoyambhu Mahachaitya",
                "history": "Amitabha Buddha, one of the Five Dhyani Buddhas, represents the cosmic element of fire and is situated facing west within the stupa. Depicted in red, Amitabha embodies the purified form of desire and is commonly symbolized by a peacock. The peacock, which consumes poisonous plants yet reveals a vibrant and radiant tail, represents Amitabha Buddha’s power to alleviate suffering and transform negativity into enlightenment.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AmitabhaBuddha.png"
                ],
                "latlng": [
                    27.714945,
                    85.29026199999998
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AmitabhaBuddha.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/igvQtV3on80"
                ],
                "id": "1f0c4830-02df-41ae-ab3d-1a10c505c3ae"
            },
            {
                "name": "Ratnasambhava Buddha",
                "location": "Swoyambhu Mahachaitya",
                "history": "Ratna Sambhava Buddha, one of the Five Dhyani Buddhas, represents the cosmic element of earth and is situated on the southern side of the stupa. Depicted in yellow, he performs the Varada Mudra with his right hand, symbolizing the granting of wishes, while holding a Cintamani jewel in his left hand, which rests on his lap. Seated on a horse throne, Ratna Sambhava Buddha embodies dynamic energy and the capacity to assist beings with great vigor, representing the purified form of pride.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/RatnasambhavaBuddha.png"
                ],
                "latlng": [
                    27.714817,
                    85.290369
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/RatnasambhavaBuddha.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/5041bVnzqdg"
                ],
                "id": "d914392a-9270-43c4-8b08-36be44be2f37"
            },
            {
                "name": "Amoghasiddhi Buddha",
                "location": "Swoyambhu Mahachaitya",
                "history": "Amoghasiddhi Buddha, one of the Five Dhyani Buddhas, represents the cosmic element of air and is depicted in green, facing north within the stupa. He is symbolized by the Garuda, which signifies his ability to perceive and transcend delusions from a distance. Performing the Abhaya Mudra, Amoghasiddhi Buddha embodies fearlessness. He is also depicted with a canopy of snakes above his head.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AmoghashidhiBuddha.png"
                ],
                "latlng": [
                    27.715036,
                    85.290393
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AmoghashidhiBuddha.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/0HOKoOPh8Ew"
                ],
                "id": "f133b575-0038-4ab0-b9d4-01ce95331b38"
            },
            {
                "name": "Aksobhya Buddha",
                "location": "Swoyambhu Mahachaitya",
                "history": "Akshobhya Buddha, one of the Five Buddhas, represents the cosmic element of water and is positioned on the eastern side of the stupa. Depicted in blue, he performs the Earth-touching gesture known as Bhu Sparsha Mudra. Seated on an elephant throne, Akshobhya Buddha symbolizes his unwavering commitment to his Bodhisattva vows. ",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AkshyobhaBuddha.png"
                ],
                "latlng": [
                    27.714905,
                    85.29051800000002
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AkshobhyaBuddha.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/AKbus-h8Gf4"
                ],
                "id": "914dceea-d7a7-43d7-ab8e-e92bf6845d32"
            },
            {
                "name": "Vairochana Buddha",
                "location": "Swoyambhu Mahachaitya",
                "history": "Vairochana Buddha, one of the Five Buddhas, represents the cosmic element of ether. While he is usually enshrined in the sanctum of a stupa, at Swoyambhu, Vairochana Buddha is situated between Akshobhya and Ratnasambhava. Depicted in white, he holds his hands in front of his chest, with the tips of his thumb and forefinger touching, in a gesture known as the Bodhyanga mudra or Dharma Chakra Parvartana Mudra. His symbol is a lion, embodying the powerful roar of wisdom that dispels ignorance. ",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VairochanaBuddha.png"
                ],
                "latlng": [
                    27.714949,
                    85.29051800000002
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/VairochanaBuddha.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/oR4Gp4PRFEI"
                ],
                "id": "2cc2cdfd-64b8-4abf-8dd2-87d099f86206"
            },
            {
                "name": "Vajradhatesvari Tara",
                "location": "Swoyambhu Mahachaitya",
                "history": "The four Taras originate from Vajradhatesvari, who resides in the central east section of the chaitya in an unadorned stone shrine, symbolizing emptiness (Sunyata). She is also the female consort of Vairochana Buddha.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VajradhatiTara.png"
                ],
                "latlng": [
                    27.714875,
                    85.29050799999999
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/VajradhatiTara.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/9c9xxTg4AvU"
                ],
                "id": "9e844601-21cf-4345-90fb-ccfca13ff409"
            },
            {
                "name": "Saptalochani Tara",
                "location": "Swoyambhu Mahachaitya",
                "history": "Saptalochani Tara is a vital guardian of Vajrayana teachings, especially the termas and inner tantras. She is located in the southeast corner of the stupa and is depicted in blue. Additionally, she is the female consort of Aksobhya Buddha.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/SaptalochaniTara.jpg"
                ],
                "latlng": [
                    27.714995,
                    85.29049299999997
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/SaptalochaniTara.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/nnqFuDu9HdI"
                ],
                "id": "d84ff759-a552-45ad-96e0-38abedd9f698"
            },
            {
                "name": "Mamaki Tara",
                "location": "Swoyambhu Mahachaitya",
                "history": "Mamaki is the guardian of secret mantras and is esteemed as \"the mother of all living beings in the universe,\" with her own powerful mantra remaining concealed. Positioned in the stupa's northeast corner and depicted in yellow, she is the female consort of Ratna Sambhava.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/MaamakiTara.JPG"
                ],
                "latlng": [
                    27.714833,
                    85.29047000000003
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/MaamakiTara.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/wA3EGj1YwsM"
                ],
                "id": "fc9c56bd-60de-4d66-9ebb-e726cea448ef"
            },
            {
                "name": "Padmini Tara",
                "location": "Swoyambhu Mahachaitya",
                "history": "Padmini is revered for her ability to resolve love-related difficulties and  is believed to captivate both men and women. Reciting her mantra 10,000 times is said to fulfill desires. Positioned in the stupa's southwest corner and depicted in red, she is the female consort of Amitabha Buddha.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PadhmaniTara.jpg"
                ],
                "latlng": [
                    27.714848,
                    85.290303
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/PadhmaniTara.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/RCMpOezttTE"
                ],
                "id": "40e95889-6061-45af-ad96-494c9bd5de58"
            },
            {
                "name": "Arya Tara",
                "location": "Swoyambhu Mahachaitya",
                "history": "Arya Tara, depicted in green, is a compassionate figure often shown seated on a lotus throne, ready to offer comfort and protection. Positioned on the northwest side of the stupa, she holds closed blue lotuses, symbolizing purity and power. Arya Tara is also the female consort of Amoghsiddhi.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AaryaTara.png"
                ],
                "latlng": [
                    27.715004,
                    85.2903
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AaryaTara.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/JR7a5HqyUwg"
                ],
                "id": "3ff32d57-0361-486b-be3c-5e23049ee579"
            },
            {
                "name": "Harmika",
                "location": "Swoyambhu Mahachaitya",
                "history": "It is the cubical structure above the dome. Where there are eyes on each side with a Buddhism symbol for infinite continuity in search of Nirvana. These eyes are symbolic of God’s all-seeing perspective. Between the eyes, there is no nose but a symbol of the Nepali number one, representing the singular path to enlightenment through Buddhism.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
                ],
                "latlng": [
                    27.714921,
                    85.29039
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "627f942d-0920-43a7-9770-a4227105ab2a"
            },
            {
                "name": "Halla Paau / Hallapati",
                "location": "Swoyambhu Mahachaitya",
                "history": "The Halla Paau is a pentagonal structure featuring figures of the Five Buddha Family, each in unique postures, arranged at the four cardinal directions.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/halla_paau.png"
                ],
                "latlng": [
                    27.714921,
                    85.29039
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "dd34eeb1-d324-4f44-af98-d0ba543455bb"
            },
            {
                "name": "Pataka (Wooden Pillar)",
                "location": "Swoyambhu Mahachaitya",
                "history": "The hidden wooden pillars are made from a unique type of wood found near the Swoyambhu hills. This pillar is encased within the 13 Bhumi.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
                ],
                "latlng": [
                    27.714921,
                    85.29039
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "92262cce-2075-49c4-9421-1cececbd41c2"
            },
            {
                "name": "Triyodasha Bhuvana / Thirteen rings",
                "location": "Swoyambhu Mahachaitya",
                "history": "Above the Harmika, thirteen tiers of tapering circular rings represent the thirteen heavens or the Bodhisattvas' achievements. Made of wood and supported by wooden pillars, these rings are suspended without touching the central pillar, which is now gilded in gold.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
                ],
                "latlng": [
                    27.714921,
                    85.29039
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "a5fe00cc-7533-4fbe-800d-c3690458bf4d"
            },
            {
                "name": "Mani (Crystal jewel)",
                "location": "Swoyambhu Mahachaitya",
                "history": "Above the Triyodasha Bhuvana is a hidden crystal jewel, or mani, discovered by two Newar sisters from Patan on the eastern stairway to Swoyambhu, where it was initially covered in cow dung. After one sister suggested taking it home, the jewel fell, prompting them to return it to Swoyambhu.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
                ],
                "latlng": [
                    27.714921,
                    85.29039
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "9a8edd48-88c3-49a5-a378-eed938af6a48"
            },
            {
                "name": "Utnish Pinnacle",
                "location": "Swoyambhu Mahachaitya",
                "history": "The uppermost part of the stupa is the Utnish, a pinnacle crowned with an umbrella adorned with tassels, which gives the stupa its unique and distinctive feature.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
                ],
                "latlng": [
                    27.714921,
                    85.29039
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "f8397d2f-abec-44d6-9e28-506617352360"
            },
            {
                "name": "Dharmadhatu Vajradhatu Mandala",
                "location": "Swoyambhu Mahachaitya",
                "history": "At the top of the eastern staircase stands an impressive golden vajra, positioned on the eastern side of the main stupa. Locally known as the VajraDhatu Mandala and also referred to as the DharmaDhatu Mandala, this mandala features twelve animals that symbolize the astrological cycle.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DharmadhatuMandala.JPG"
                ],
                "latlng": [
                    27.7149,
                    85.29053699999997
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "1c0b9f8b-f49a-4d40-bc45-cc1eaaa64561"
            },
            {
                "name": "Pratappur",
                "location": "Swoyambhu Mahachaitya",
                "history": "Pratappur is situated on the north eastern side of the main Swoyambhu stupa, built in the name of King Pratap Malla himself in N.S 775. It was destroyed by fire in August 2003, struck by lightning in February 2011, and damaged in the 2015 earthquake. Rebuilt with government support, it was completed in 2019.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Pratappur.JPG"
                ],
                "latlng": [
                    27.714978,
                    85.29057899999998
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/Ul5TRhOLbC4"
                ],
                "id": "4756c46e-bce7-4a9d-b413-c0bc68ab569d"
            },
            {
                "name": "Anantapur",
                "location": "Swoyambhu Mahachaitya",
                "history": "Anantapur, located southeast of the main Swoyambhu stupa, was built in honor of Ananta Priya, the second queen of King Pratap Malla. Damaged in the 2015 earthquake, it was rebuilt and completed in 2019.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Anantapur.JPG"
                ],
                "latlng": [
                    27.714743,
                    85.290482
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/lmqEjQByYoM"
                ],
                "id": "547e33b6-888d-41b3-8605-fafbb068bf2b"
            },
            {
                "name": "10th Shamarpa Bell",
                "location": "Swoyambhu Mahachaitya",
                "history": "The bell was donated by the 10th Shamarpa, Mipam Chodrup Gyamtso, at Swayambhu in 1791. Located beside the main entrance to the Swayambhu Stupa, it expresses gratitude to the dharmakaya and is presented as a beautiful offering.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/10thShamarpaBell.JPG"
                ],
                "latlng": [
                    27.714807,
                    85.29049099999997
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "2074c9b0-08c2-46d6-a8b2-7a796d7b323c"
            },
            {
                "name": "Pavan Bhairav",
                "location": "Swoyambhu Mahachaitya",
                "history": "A modest east-facing temple in front of the Karmaraja monastery to the east of Nagapura. The shrine contains a stone image of Pavan Bhairav in sukhasana with his consort. It was founded by King Pratapa Malla in N.S.773.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PavanBhairav.JPG"
                ],
                "latlng": [
                    27.715008,
                    85.29053399999998
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/3vGfSLV5zQs"
                ],
                "id": "b24b08f7-ebfe-464b-99f3-073c8807cc29"
            },
            {
                "name": "Harati Maa Temple",
                "location": "Swoyambhu Mahachaitya",
                "history": "A traditional Nepali tiered temple dedicated to the goddess Hariti, also known as Ajima. Hariti is associated with smallpox and is worshipped for protection.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/HaratiMaa.png"
                ],
                "latlng": [
                    27.715032,
                    85.29021699999998
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/jQYWqEAObOk"
                ],
                "id": "44277c17-50cd-4137-be1b-6701d2446f50"
            },
            {
                "name": "Vayupur-Wind",
                "location": "Swoyambhu Mahachaitya",
                "history": "Located in the southwest corner of Swoyambhu Mahachaitya, this shrine is dedicated to the element of air. It prays for the removal of obstacles and disasters caused by wind.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/vayupur.png"
                ],
                "latlng": [
                    27.714737,
                    85.290164
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/JDdexuCWl0M"
                ],
                "id": "4f7785e1-ccb1-4b7f-85a8-7064db58b984"
            },
            {
                "name": "Agnipur",
                "location": "Swoyambhu Mahachaitya",
                "history": "Located in the northwest corner of Swoyambhu Mahachaitya, Agnipur features a dome with the red face of Agni Bhairava. It protects against fire-related disasters, with the shrine repainted annually on Kartik Purnima.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Agnipur.JPG"
                ],
                "latlng": [
                    27.715266,
                    85.29000400000001
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Agnipur.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/LxIsKiW8dk0"
                ],
                "id": "02fe1d40-6fdc-4176-a021-3e730e14aed4"
            },
            {
                "name": "Nagpur",
                "location": "Swoyambhu Mahachaitya",
                "history": "Nagpur, also known as Basingaah, is a rectangular pit in front of the Amoghasidi Buddha niche. It symbolizes the water spirit and ensures good rainfall for harvests.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Nagpur.JPG"
                ],
                "latlng": [
                    27.715055,
                    85.290506
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Nagpur.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/eecTBRLwHEU"
                ],
                "id": "2100e433-0784-4d64-b21a-f913afe6f947"
            },
            {
                "name": "Basundhara Goddess (Vasupur)",
                "location": "Swoyambhu Mahachaitya",
                "history": "Located behind the Anantapur temple, Basundhara Mandir is consecrated by Guru Shantikaracharya. Worshiping here is believed to bring abundant crops.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Basundhara.JPG"
                ],
                "latlng": [
                    27.714696,
                    85.290435
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Basundhara.glb",
                "virtualTour": null,
                "id": "fc5028f5-f592-443d-9113-2ac87d9401d1"
            },
            {
                "name": "Shantipur",
                "location": "Swoyambhu Mahachaitya",
                "history": "Shantipur, located northwest of the main stupa, is also known as 'Akashpur' and 'Patalpur.' Originally a meditation cave, it holds significance in Swoyambhu's lore, symbolized by the 'Lotus flower' marking the stupa's origin. Hem Raj Shakya notes a tradition where people wrote letters to deceased loved ones, entrusted to Shantipur priests, who alone could enter the sacred space. This practice, held during 'Akadshi' and 'Dashami' in Krishna Paksha, was believed to bring peace to the departed. The exact date of Shantipur's establishment is uncertain, but it is believed to have been built by Shantikar Acharya, a revered Tantric master. According to legend, he has been meditating in an underground chamber since the 5th century.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Shantipur.JPG"
                ],
                "latlng": [
                    27.715666,
                    85.29041899999999
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "fbe60d4c-1ab4-41ce-88ae-2e11f7c5d783"
            },
            {
                "name": "Bahu Mangal Dwar Chaitya",
                "location": "Swoyambhu Mahachaitya",
                "history": "Located in the southwest corner of the Swoyambhu stupa, between the main stupa and Vayupura shrine, the Bahu Mangal Dwara Chaitya features a dome base with four Tathagata Buddhas, totaling 124 Buddhas in all directions. Below the base are five tiers with six rows of thirty gods and symbolic doorways. Known as the 'Auspicious Chaitya with Many Doors' (Tashi Gormang Chorten) in Tibetan, it is named for its multiple doors and fortunate symbols.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/BahuMangaldwarChaitya.JPG"
                ],
                "latlng": [
                    27.714775,
                    85.29023999999998
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "e757bfd2-f744-49b0-8789-f4ef78845698"
            },
            {
                "name": "Dev Avatar",
                "location": "Swoyambhu Mahachaitya",
                "history": "On the western side of Swoyambhu Mahachaitya stands a 10½-foot (3.2-meter) tall stone Buddha, the tallest in Swoyambhu. His right hand, in Varada mudra, is lowered in a gesture of charity, while his raised left hand holds the tip of a transparent monastic robe. This gesture, known in Nepal as the mudra of prediction, has earned him the nickname 'Buddha with the Gesture of Prediction.'",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DevAvatar.JPG"
                ],
                "latlng": [
                    27.715151,
                    85.28995399999997
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "9ee37fb9-d799-45f0-858d-fcb655b00d47"
            },
            {
                "name": "Sundial",
                "location": "Swoyambhu Mahachaitya",
                "history": "An ancient sundial, located on the northwest side of Maha Chaitya with a group of chaityas, was used by locals to tell time. Its intricate carvings and inscriptions highlight the integration of traditional timekeeping methods into sacred spaces, reflecting its historical and cultural importance.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Sundial.JPG"
                ],
                "latlng": [
                    27.715147,
                    85.29013800000001
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "94106a55-312d-43f5-8ace-c7926e018641"
            },
            {
                "name": "Chaturmukhi Chaitya",
                "location": "Swoyambhu Mahachaitya",
                "history": "The Chaturmukhi chaitya features four sides, each with distinct hand mudras. The Buddha depicted here is approaching full nirvana, marked by a three-tiered hairstyle, symbolizing full enlightenment.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/ChaturmukhiChaitya.JPG"
                ],
                "latlng": [
                    27.715137,
                    85.29021899999998
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "612e4cb5-0ffa-4b5b-89f4-13a80e5d2f30"
            },
            {
                "name": "Ramyan Kutta Chaitya",
                "location": "Swoyambhu Mahachaitya",
                "history": "This rare chaitya, located on the north and northeast sides of the Swoyambhu Mahachaitya, features a cubical base with four Kubairs and an idol of Sukhavati Lokeshwor on the eastern side. Above, two additional cubical tiers hold 20 Lokeshwors and 20 more idols, including four in Charya dance postures. At the center, the four great Buddhas—Maha Amitabha, Maha Amoghasiddhi, Maha Akshobhya, and Maha Ratnasambhava—are depicted in unique forms. The top of the chaitya mirrors Swoyambhu, with four Buddhas, four Taras, and other significant elements like the Harmika and Triyodashbhuvan.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/RamyankuttaChaitya.JPG"
                ],
                "latlng": [
                    27.715045,
                    85.29053899999997
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "51c239a2-b8a2-4508-a033-fb5521ffa786"
            },
            {
                "name": "Sakhwaga",
                "location": "Swoyambhu Mahachaitya",
                "history": "Sakhwa, a lime powder, is mixed with water and spread over the dome of Maha Chaitya as part of a ritual. Traditionally, the Sakhwa Pyau Guthi applied the lime on the last day of Swasthani Barta during Magh. In the past 50-60 years, this practice has become more frequent, with individuals now able to pay to have the dome colored on their chosen day.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Sakhwaga.JPG"
                ],
                "latlng": [
                    27.715212,
                    85.290208
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "9967d22e-f828-492a-8348-6f797375b9be"
            },
            {
                "name": "Aagam Chhen (Secret Ritual House)",
                "location": "Swoyambhu Mahachaitya",
                "history": "Aagam Chhen is a sacred space for the Buddhacharya priest family of Swoyambhu, dedicated to their tradition. 'Aagam' refers to secret rituals, and in this space, special pujas are held on certain days, with 2 to 3 distinct ceremonies performed.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AgamChhen.JPG"
                ],
                "latlng": [
                    27.714718,
                    85.29030399999999
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AaganChhen.glb",
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/DiRu_gQUpe8"
                ],
                "id": "a7b3b9a0-9d12-4c06-a82f-e3260d53df3a"
            },
            {
                "name": "Yogamvar",
                "location": "Swoyambhu Mahachaitya",
                "history": "The Yogamvar temple, located on the left side of the path from Agnipur to Santipura, symbolizes the union of sky and land. Its name comes from 'yog' (mixture) and 'amvar' (sky and land). The temple has no roof or enclosing wall, reflecting this union. Inside, a hole beneath a torana represents the deity Yogambara, with no images present.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Yogamvar.png"
                ],
                "latlng": [
                    27.715549,
                    85.290188
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "videos": [
                    "https://www.youtube.com/shorts/2IG7AhQBDqY"
                ],
                "id": "a8fa96d2-e0b9-43b4-84fc-e116977d79ef"
            },
            {
                "name": "Dharma Granthi Bhairav",
                "location": "Swoyambhu Mahachaitya",
                "history": "One of the unique and rare structures at Swoyambhu is the Dharma Granthi Bhairav, who holds a granthi (book) in his hands. This impressive statue is situated in the northwest, behind the Harati Temple and the Maha Chaitya, facing Biruparsha.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DharmaGranthiBhairab.JPG"
                ],
                "latlng": [
                    27.715084,
                    85.290278
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/DharmaGanthiBhairav.glb",
                "virtualTour": null,
                "id": "4531f7a3-fc58-4c82-95ef-44eb16e1842f"
            },
            {
                "name": "Birupakshya",
                "location": "Swoyambhu Mahachaitya",
                "history": "This site is situated in the northwest, behind the Harati Temple. The Birupakshya is a partially buried human figure. According to legend, if this figure ever erects in its full form, it will signal the end of the world or the beginning of a new 'Yuga.'",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Birupakshya.JPG"
                ],
                "latlng": [
                    27.715084,
                    85.290278
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Bhirupakshya.glb",
                "virtualTour": null,
                "id": "ebe5ef0e-0a98-44fa-bd30-9270579f43cc"
            },
            {
                "name": "Buddha Akshobhya",
                "location": "Swoyambhu Mahachaitya",
                "history": "The large Buddha statue in front of Shantipur, dating back to the 16th century, shows Buddha seated in vajrasana on a lotus throne with a lion seat, making the earth-touching gesture. While called Aksobhya, it actually represents Buddha Shakyamuni, as seen from the lion throne, which is associated with Shakyamuni, not Aksobhya.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/akshobhyaBuddha.png",
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AkshyobhaBuddha.png"
                ],
                "latlng": [
                    27.715495,
                    85.29034899999999
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AkshobhyaBuddha.glb",
                "virtualTour": null,
                "id": "4c9500f9-d9da-4587-813b-0ba15ccaee50"
            },
            {
                "name": "Hari Hari Hari Vahana Lokeshvara",
                "location": "Swoyambhu Mahachaitya",
                "history": "Across from Agnipur is the sacred Hari Hari Hari Vahana Lokeshvara, a replica of a monument from the Changu Narayan temple in Bhaktapur. This form of Avalokiteshvara, the bodhisattva of compassion, is shown sitting above Vishnu, Garuda (Vishnu's mount), a white lion (Lokeshvara's mount), and the serpent-king Takshaka. This symbolizes Avalokiteshvara as a supreme protector, respected even by Vishnu. The name 'Hari Hari Hari Vahana' refers to 'Lokeshvara's vehicle,' with 'Hari' symbolizing Vishnu and the animals, representing Avalokiteshvara's protection of all realms—sky, earth, and underworld.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/HariHariHariVahanaLokeshvara.JPG"
                ],
                "latlng": [
                    27.715302,
                    85.290209
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "b55fc392-5fb1-47ea-a2f4-f26aaf9748f7"
            },
            {
                "name": "Vasubhandu Memorial Chaitya",
                "location": "Swoyambhu Mahachaitya",
                "history": "The chaitya houses five Buddha statues, with a stone Vajra on the eastern side. It is believed to enshrine the relics of Guru Vasubandhu, a famous Buddhist scholar who visited Nepal. The four stone sculptures of the Buddha (Tathagatas) likely came from Swoyambhu Mahachaitya, where the original stone Buddhas were replaced by metal ones. The statue of Vairochana Buddha was added later by a donor.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VasubhanduMemorialChaitya.JPG"
                ],
                "latlng": [
                    27.715586,
                    85.289602
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "f80a3cca-7964-4f25-8824-4a0795287fc2"
            },
            {
                "name": "Pulaun Syangu",
                "location": "Swoyambhu Mahachaitya",
                "history": "The chaitya, known locally as 'Pulan Syangu,' is often mistakenly believed to be older than the Swoyambhu Mahacaitya. However, it is historically significant as the site where Guru Manjusri taught and initiated his disciple, Bhiksu Gunakara. The name 'Pulan Syangu,' which translates to 'Old' or 'Worn Out Swoyambhu,' stems from a misunderstanding, as the chaitya is neither older nor in worse condition than Swoyambhu.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PulaunSyangu.JPG"
                ],
                "latlng": [
                    27.716425,
                    85.28850299999999
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/PuranaSyanguChaitya.glb",
                "virtualTour": null,
                "id": "4366b1ac-2ece-4cdd-a3ca-b42fdd499d23"
            },
            {
                "name": "Bhagwan Pau",
                "location": "Swoyambhu Mahachaitya",
                "history": "This site marks the base of the stairs leading up to Swoyambhu Hill and the Swoyambhu Stupa. It holds special significance as a place of prayer and worship.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/BhagwanPau.png"
                ],
                "latlng": [
                    27.714397,
                    85.29317100000003
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/BhagwanPau.glb",
                "virtualTour": null,
                "id": "490fb175-4b1a-4827-bc3e-bab0453a832f"
            },
            {
                "name": "Janma Dwar",
                "location": "Swoyambhu Mahachaitya",
                "history": "Located at the base of the hill, this sacred site holds deep cultural and spiritual significance for the Newar community of the Kathmandu Valley. Here, they light butter lamps to honor departed family members, a tradition passed down through generations. The glowing light is believed to guide their loved ones toward peace in the afterlife.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/JanmaDwar.JPG"
                ],
                "latlng": [
                    27.714742,
                    85.29159300000003
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Janmadwar.glb",
                "virtualTour": null,
                "id": "7fa94145-7e2f-4b89-a2c8-1406b37156d2"
            },
            {
                "name": "World Peace Pond",
                "location": "Swoyambhu Mahachaitya",
                "history": "It’s a new installation (year 1998) on the western side of Swoyambhu, there is a small pond called the World Peace Pond. In the center of the pond stands a brass statue of Buddha on a lotus flower. It is believed that if visitors successfully toss a coin into the ‘cauldron’ present in the pond's center, their wish will come true.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/WorldPeacePond.JPG"
                ],
                "latlng": [
                    27.715842,
                    85.289467
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "1d4d514f-dbfb-4fcd-90fc-9607ad931341"
            },
            {
                "name": "Gyanmala Bhajan Satal",
                "location": "Swoyambhu Mahachaitya",
                "history": "Gyanmala Bhajan Satal is a venue located within a rest house in Swoyambhu, where devotees primarily perform Buddhist devotional songs. Initially established as a satal, it later evolved into a space dedicated to these recitals. King Tribhuvan inaugurated this satal, which hosts performances each morning, on holidays, and daily throughout the Buddhist holy month of Gunla.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/GyanmalaBhajanSattal.JPG"
                ],
                "latlng": [
                    27.714962,
                    85.29073399999999
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "c32a9cff-f9ed-4841-90b3-9c951a692344"
            },
            {
                "name": "Five Symbolic Statues",
                "location": "Swoyambhu Mahachaitya",
                "history": "Near the top of the Swoyambhu staircase, five animal symbols representing the five Buddhas are displayed: a Peacock (alleviating suffering), Garuda (overcoming delusions), an Elephant Throne (commitment to Bodhisattva vows), a Lion (dispelling false views with wisdom), and a Horse Throne (assisting beings with great energy).",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/5SymbolicStatue.JPG"
                ],
                "latlng": [
                    27.714867,
                    85.29087600000003
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "6ec207b8-d910-4d3a-aea4-b7737b9bd692"
            },
            {
                "name": "Manjushree Paduka",
                "location": "Swoyambhu Mahachaitya",
                "history": "Manjushree's paduka is situated on Gau Singhe Hill. 'Paduka' refers to footwear or footprints. This particular paduka resembles Manjushree's footwear where his disciple Vishow Mitra's eyes fell on, as a consequence of a curse.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/ManjushreePaduka.png"
                ],
                "latlng": [
                    27.715908,
                    85.287733
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "02123e78-253c-46a6-9063-8d4be97adb25"
            },
            {
                "name": "Jyoti Kriti Mahavihar",
                "location": "Swoyambhu Mahachaitya",
                "history": "To the west of the Hariti temple is a square court surrounded by a unique two-story building facing east. This Baha, known as 'Jyoti Kirti Mahavihara,' was founded in 1393 A.D. by the donors of Kathmandu's Maru Tole. Later, Sakyabhiksu Sri Madhanju of Paravarta Vihara (Itum Baha) took responsibility for its care.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/JyotiKritiMahabihar.jpg"
                ],
                "latlng": [
                    27.715109,
                    85.290055
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "64c0fded-a769-4410-baeb-19a57fb43dec"
            },
            {
                "name": "Samhyangu Mahavihar",
                "location": "Swoyambhu Mahachaitya",
                "history": "The building is located on the western front of the Swoyambhu Mahachaitya. Known by a different designation, Kvapa Chen, it is the primary monastery of Swoyambhu and the home of the principal deity of the Buddhacharya sangha. This monastery is thought to have been founded during the reign of the Licchavi king in the fifth century.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/SamhyanguMahabihar.JPG"
                ],
                "latlng": [
                    27.715266,
                    85.28997800000002
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "d0e458dd-618c-462f-aa13-5bdc67f097e7"
            },
            {
                "name": "Karma Raja Mahavihar",
                "location": "Swoyambhu Mahachaitya",
                "history": "This monastery, founded in 1959 by Ven. Dagmar Tsamba Lobsang Yangphe and Ven. Nono Dechen Dorje, was built on property provided by Mr. Nati and Sanukaji Buddhacharyas. It was first offered to His Holiness the 16th Karmapa and then overseen by the 14th Shamarpa and the 17th Karmapa, Thaye Dorje. This location has historical and theological significance in Tibetan Buddhism.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/KarmaRajaMahabihar.jpg"
                ],
                "latlng": [
                    27.715147,
                    85.290729
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "3868467b-a7f9-4fa0-8068-4498425a982c"
            },
            {
                "name": "Deva Dharma Mahavihar",
                "location": "Swoyambhu Mahachaitya",
                "history": "Deva Dharma Maha Vihar, known in Tibetan as Marmelhakang, is the oldest monastery established by a Bhutanese Lama. This is a branch of the ‘Kagyupa’ lineage known as ‘Drupa Kayyupa’. The ground floor level serves as a pati (shelter) for the pilgrims who come to perform rituals at Hariti temple and Swoyambhu stupa.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DevaDharmaMahabihar.jpg"
                ],
                "latlng": [
                    27.715051,
                    85.29008299999998
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "dcb595d3-1eb2-4015-9b23-b6cfe2f725ba"
            },
            {
                "name": "Group of Chaityas",
                "location": "Swoyambhu Mahachaitya",
                "history": "On the north-west side of the main stupa, behind the Harati Maa temple, lies an area adorned with a collection of chaityas, created in various styles by different devotees over time. Chaityas in this place are as follows: 1. Asoka Chaitya (Licchavi Chaitya) 2. Sikharakutta Chaitya 3. Vajradhatu Chaitya 4. Bodhisattva Chaturvyuha Chaitya 5. Jalaharyopari Jinalankrta Chaitya 6. Dharmadhatu Jinalankrta Chaitya 7. Jvalavaliyukta Chaitya 8. Astakonakrti Padmachaitya 9. Chaturvyuha Buddha chaitya 10. Sumeru chaitya.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/GroupofChaitya.JPG"
                ],
                "latlng": [
                    27.715196,
                    85.29015099999998
                ],
                "monuments": [],
                "droneView": null,
                "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/GroupofChaityas.glb",
                "virtualTour": null,
                "id": "5711602e-133c-4457-891c-29b52121e756"
            },
            {
                "name": "Amideva Buddha Park",
                "location": "Swoyambhu Mahachaitya",
                "history": "Amideva Buddha Park, located near Swoyambhu Hill and established in 2003, features a trio of towering statues. At the center is a 67-foot statue of Shakyamuni Buddha in his Amitābha form, symbolizing longevity and holding a bowl of immortality nectar. To his left stands a 64-foot statue of Chenrezig (Avalokitesvara), embodying supreme compassion, and to his right is a 64-foot statue of Guru Rinpoche (Padmasambhava), revered for spreading Vajrayana teachings and embodying primordial wisdom.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/amideva_buddha_park.png"
                ],
                "latlng": [
                    27.716093,
                    85.28409199999999
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "d38c1c80-9f67-45ee-a4cc-5032024cb4db"
            },
            {
                "name": "Anandakuti Mahabihar",
                "location": "Swoyambhu Mahachaitya",
                "history": "Ananda Kuti Mahabihar, located along Swoyambhu's circumambulation path, began construction in 1996 B.S. and was completed in 1999. By 2001 B.S., the structure was finalized under Bhikshu Dharma Lok Mahasthavir's guidance. Three Buddha relics from Sri Lanka, symbolizing his birthplace in Nepal, were presented to King Tribhuvan. A stupa resembling Sri Lanka's Thuparama Chaitya was built to house these relics. Known for its Theravada Buddhism practice, the monastery offers free meditation to both locals and visitors, with a full day of meditation held on the fourth Saturday of every month.",
                "images": [
                    "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AnandakutiMahabihar.jpg"
                ],
                "latlng": [
                    27.717621,
                    85.28917000000001
                ],
                "monuments": [],
                "droneView": null,
                "model": null,
                "virtualTour": null,
                "id": "ae72fcab-fac9-4f8f-aeb8-f6ee40f96328"
            }
        ],
        "droneView": "https://github.com/saugatshakya/assets/blob/main/drone_view/swyambhu.png?raw=true",
        "model": null,
        "virtualTour": "https://gallimap.com/virtualtour/swoyambu-mobile-test/",
        "videos": [
            "https://www.youtube.com/shorts/ty-bLn4lyb0"
        ],
        "id": "fe258fdc-122f-48a9-95f4-522bb4ec8429"
    }
]