[
  {
    "name": "Handigaun",
    "location": "Kathmandu",
    "history": "Hadigaun, one of the oldest and most historically significant settlements in the Kathmandu Valley, was once the heart of Nepal's Licchavi civilization, serving as the ancient capital and a thriving center of culture, religion, and politics. Its temples, stone spouts, and inscriptions bear testimony to its royal legacy and spiritual prominence. However, with the rise of modern urbanization and neglect of its heritage, Hadigaun has gradually lost its central role and much of its historical grandeur. Despite this, studying Handigaun is crucial, as it holds untapped insights into Nepal’s ancient urbanization, religious syncretism, and architectural innovations, serving as a key to understanding the nation’s rich cultural and historical identity.",
    "images": [
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BhatbhateniTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/DhanaGaneshaTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/HadigaunShivaTempleandJogiKuti.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/MarpaHiti.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/KrishnaTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BhuteshworBhairavTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BhuteshworBhairavPremises.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/Yoshin.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/Jarun.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/HadigaunDabali.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BharaviHiti.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/TheMotherGoddesses.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/SatyanarayantempleandthePremises.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/NasaDyo.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BhimaNani.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/NyaLho.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/GahanaPokhari.JPG"
    ],
    "latlng": [27.71897, 85.33323],
    "monuments": [
      {
        "name": "Bhat Bhateni Temple",
        "location": "Handigaun",
        "history": "The BhatBhateni Temple, located northwest of Hadigaun, is dedicated to the deities Bhat, Bhateni, and their child, Nanda/Bal Gopal. The temple is unique in that the deities are suspended on the wall instead of being placed on the ground, a distinctive feature (Acharya, 2021). The deities are also known by local names such as Brahmayani, \"ह्मोपता द्यो/Mhopata Dhyo,\" \"मे मैचाद्यो/Me MaichaDhyo,\" and \"मोपतादेवी/Mopata Devi,\" and are believed to have the power to heal children's ailments. The temple's origins may date back to the Lichhavi period, with some believing it is linked to the Toran Ajima/Tudal Devi Temple, which contains an inscription from 475 A.D during King Manadeva's reign (Dikshita, 2059).\nA prominent legend tells the story of a devout Brahmin couple, Sudev and Sudevi, from Bishalnagar (the ancient name for Hadigaun). The couple, known for their unwavering devotion to Lord Vishnu, were blessed with spiritual knowledge and earned the names \"Bhat\" and \"Bhateni.\" They prayed for a child with all the good qualities of Vishnu. As they were too old to bear children at the time, Lord Vishnu promised them a child in the next life. Reborn into poverty, the couple continued their devotion to Vishnu and were blessed with a son who embodied all the attributes of Vishnu.\nOne day, an old Brahmin named Suddadev visited their home, and knowing of their exemplary character, he left behind a walking stick containing gold and set off on a 12-year pilgrimage. The couple, unaware of the gold inside, noticed the stick beginning to rot and discovered the gold. Struggling financially, they sold it, believing that Suddadev would not survive his pilgrimage. However, upon his return, Suddadev discovered the deceit. After initially being lied to by the couple, he saw a Garuda circling above, and it became clear to him that his stick had been sold. He cursed the couple, declaring, “Liars like you should not find land on this earth to set foot on. If my stick could be eaten away by moths, then surely that eagle above can swoop down and carry away your child.” At that moment, the Garuda swooped down and carried away the baby. The couple, having accumulated religious merit, found the strength to rise into the air to retrieve their son. To their surprise, their child revealed his true form—he was Vishnu-Narayan riding the Garuda. Vishnu, pleased by their devotion, blessed them, saying, “You shall remain in the sky as gods as you have remained loyal to me.” This legend explains why the images of Bhat and Bhateni are suspended in the temple (Acharya, 2021).\nAnother legend involves a farmer couple devoted to Vishnu, who prayed for the deity to be born as their child. Vishnu granted their wish, and in the next life, they were blessed with a child. One day, while the child was basking in the sun after being oiled, Garuda swooped down and took the child. The parents, chasing after the eagle, witnessed their son transform into Vishnu on Garuda's back. Vishnu, moved by their unwavering devotion, blessed them, allowing them to remain in the sky as gods.\nThe BhatBhateni Temple is a two-tiered structure with a copper roof and a golden pinnacle. The outer walls of the temple are adorned with carvings of the Astamatrikas, Ganesha, and other figures from the Malla period. The deities inside the temple face west and are suspended in the air to avoid startling visitors with their large images upon entry .(Karmacharya, P. (2024, November 8). Insights on Bhatbhateni Temple [Interview with Priest of the temple].) The temple is maintained by the Karmacharya clan, who perform daily rituals and uphold the temple's vibrant religious significance (Acharya, 2021).\nThe temple plays a central role in Hadigaun's cultural practices, particularly for parents praying for the health of their children. The annual jatra begins on Chaitra Sukla Chaturdasi (mid-April), with the deities temporarily housed at the Toran Ajima Temple. They are returned after a Hom Puja on Chaitra Sukla Purnima (late April). The temple sees increased visits on Saturdays, Tuesdays, and Thursdays, when locals come to offer prayers and seek blessings.’",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BhatbhateniTemple.JPG"
        ],
        "latlng": [27.71953, 85.331],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Bhindyo Temple",
        "location": "Handigaun",
        "history": "The Bhindyo Temple, also known as the Bhimsen Temple, is located in the northwestern corner of Hadigaun. This two-tiered structure is dedicated to Lord Bhimsen, with an image of the deity dating back to medieval times. The temple marks a significant entrance point to Hadigaun from the northwest, possibly serving as a historical access point to the city.\nThe temple is renowned for hosting the annual Bhimsen Jatra, which occurs alongside the Toran Ajima/Tudal Devi Jatra. These events are major cultural highlights for the community. The temple is currently cared for by the Dangol family, particularly SubhaNarayan Dangol, a local resident. A replica of the enshrined image is kept at the Dangol household and displayed during the Toran Ajima Jatra and Holi Purnima. The temple also hosts several important religious activities, including the Hom Puja during Si Punhi/Purnima (Magh full moon), Bhin Dwadasi (when food offerings are made to the deity), and Holi Purnima. (Dangol, S. N. (2024, November 14). Insights on Bhindyo Temple [Interview with Ritual Custodian of the temple].)\nHistorically, a Falcha (resting platform) once stood on the eastern side of the temple, but it was replaced by a club building (Tiwari, 2002). To the south of the temple is a Shakti Pith, housing images of deities such as Sankata, Mahankal, and Surya Narayan, as well as an upright stone symbolizing Lord Bhairav. Among these, a headless torso of Lord Shiva holding a Kamandalu is believed to date back to the early Licchavi period. To the southeast of the temple lies a Shivalinga, associated with a legendary fire that once devastated much of Hadigaun.\nTo the west of the temple, there was once a water well, and according to local lore, the Dhanamati river once flowed through this area. (Dangol, S. N. (2024, November 14). Insights on Bhindyo Temple [Interview with Ritual Custodian of the temple].) In recent years, additional structures have been added to the area, including a small Lord Ganesha temple to the south and a temple dedicated to Dakshinkali Bhagwati to the north, further enriching the region’s religious and cultural landscape.",
        "images": [],
        "latlng": [27.71826, 85.33479],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Dhana Gamesh Temple",
        "location": "Handigaun",
        "history": "The Dhana Ganesha Temple, located in the northern part of Hadigaun, is a historic two-story structure dedicated to the worship of significant deities. The eastern shrine enshrines the primary deity, Dhana Ganesha, while the identity of the deity in the western shrine remains a subject of debate.\nThe temple is believed to date back to the Licchavi period. The statue of Dhana Ganesha in the eastern shrine is notably fragmented; its left hand was once holding sweetmeats (laddu), while the object in its right hand remains uncertain. The statue in the western shrine is also contested, with some suggesting that it represents Bhairava, and others believing it depicts another form of Ganesha. Given the presence of a Bhairava image on the Toran (archway) above, it is likely that the statue in the western shrine represents Bhairava.\nDhana Ganesha, also known as Rog Vinayak, is revered for its healing powers, particularly in treating ailments. The second shrine is often referred to as Rog Vinayak, though this connection is still under research. The temple houses several ancient relics, including a 5th-century Hayagriva statue, a 2nd-century Mahisasurmardini, and an unidentified deity. The Hayagriva statue, revered by farmers as Balarāma, is the oldest of its kind in Nepal (Bangdel, 1982). Many of these statues were damaged during an Islamic invasion.\nA local legend connects the Dhana Ganesha Temple to Chandra Vinayak in Chabahil. According to the myth, the original Chandra Vinayak statue, once enshrined in the Dhana Ganesha Temple, was stolen and dragged to Chabahil, earning it the name \"Lhwasaala Ganedyo\" (the dragged stone Ganesha). In response, the people of Hadigaun created a replacement statue, which is now worshipped as Dhana Ganesha. This myth links the two deities, and both statues are part of an annual procession that occurs on the day following the full moon of Kartik.(Prajapati, S. L. (2024, November 8). Insights on Dhana Ganesha Temple [Interview with President of the Conservation and Reformation Committee].)\nThe temple underwent renovations in 2003 A.D (BS 2060), which included the installation of a copper roof, a new finial, a bell, and marble flooring (Tiwari, 2002). Historically, the temple was managed by a Karmacharya priest, but currently, a Maharjan caretaker (dyahpahlah) from the local community performs the rituals. The temple holds significant cultural importance for the people of Hadigaun, who worship there during community festivals, personal rituals such as Pashni (the first rice feeding ceremony for a child), and on every Tuesday, when a replica of the Ganesha statue is brought out for worship.\nThe temple premises originally occupied 5 Ropani and 4 Aana of land. However, by 2045 B.S., the area was reduced to 3 Ropani and 7 Aana (Prajapati, K. L. (2024, November 8). Insights on Dhana Ganesha Temple [Interview with V- President of the Conservation and Reformation Committee].)). Despite these changes, the temple remains a central cultural and religious landmark in Hadigaun.\n",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/DhanaGaneshTemple.JPG"
        ],
        "latlng": [27.71988, 85.33708],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nyara Hiti, Hadigaun Shiva Temple and Jogi Kuti",
        "location": "Handigaun",
        "history": "Located on the eastern side of the Dhana Ganesha Temple is a stone water complex, housing five stone water spouts (hiti) of varying sizes. This hiti, known as Nyara Hiti or Pancha Dhara, is believed to have been constructed by Dhir Shamsher and Bir Shamsher and later renovated in 1970 B.S. (Acharya, 2021). Nyara Hiti holds religious and cultural significance in Hadigaun, particularly during the Gaijatra festival. It is believed that the hiti was created to provide water for Dhana Ganesha Temple, enabling devotees to take a holy bath before worship.\nAdjacent to Nyara Hiti is the Gumbaj-style Shiva Temple, adding to the sacred atmosphere of the area. Within the same complex is the Jogi Kuti, a residential space built for the Naatha community yogis during the reign of Rana Bahadur Shah (Acharya, 2021).\n",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/HadigaunShivaTempleandJogiKuti.JPG"
        ],
        "latlng": [27.72044, 85.3376],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Marpa Hiti",
        "location": "Handigaun",
        "history": "Among the various hiti (stone water spouts) in Hadigaun, the Marpa Hiti is located on the northern slope of the Bhuteshwor Bhairav premises. Dating back to the 16th century, it was constructed by Shingh Prajapati (Acharya, 2021). While the physical structure of the hiti remains in good condition, the flow of water has unfortunately ceased following a haphazard reconstruction. The area surrounding the hiti, which was once a pond, has now been transformed into a park.( Magar, G. T. (2024, November 5). Insights on Marpa Hiti [Interview with Local Resident].)\nFurther investigation is needed to uncover more information about the hiti and its significance within the historical and cultural context of the area.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/MarpaHiti.JPG"
        ],
        "latlng": [27.71866, 85.33691],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Krishna Mandir",
        "location": "Handigaun",
        "history": "The Krishna Temple, located in Thatu Tole to the north of Hadigaun, is dedicated to Lord Krishna and is surrounded by a Pipal tree. The temple enshrines images of Krishna, Rukmini, and Satyabhama, believed to date back to the 17th-18th centuries (Acharya, 2021).\nA noteworthy feature within the temple complex is the stone base of an older structure located in the northwest corner. This base is believed to belong to a Licchavi-era temple that originally housed a 2nd-century image of Goddess Lakshmi. The ancient Lakshmi statue is now displayed at the National Art Museum in Chhauni (Tiwari, 2002).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/KrishnaTemple.JPG"
        ],
        "latlng": [27.71771, 85.33638],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Bhuteshwor Bhairav",
        "location": "Handigaun",
        "history": "Bhuteshwor Bhairava, located in Thatu Tole, is a central deity in Hadigaun, revered as the protector of the settlement. Locals regard him as the tutelary god of Hadigaun, and he plays an essential role in many significant community rituals. His gaze is perpetually directed southward, symbolizing his guardianship over the settlement.\nThe name \"Bhuteshwor Bhairava\" is derived from the nearby Shivalinga, known as Bhuteshwor Mahadeva. This Shivalinga is one of the prominent Piths among the 16,000 Piths of Sati Devi, the first wife of Mahadev. The area surrounding Bhuteshwor Bhairava includes several historical monuments from different periods. These include the Swasthani Yantra, over which Bhuteshwor Bhairava is considered the protector, a Dabali, Krishna Mandir, a newly added Chaitya, and temples dedicated to Narayana. The Narayana temples were relocated from the west during a road expansion. Before their relocation, one temple was built in a shikhar style, and the other in a tiered style. According to the ward member, the original Bhuteshwor Bhairava shrine was situated a few feet below ground and lacked the structural features seen today.(Karmacharya, B. P. (2024, November 14). Insights on Tudal Devi Dyochhen [Interview with Ward Member, Ward No 5])\nSituated at the highest point in Hadigaun, Bhuteshwor Bhairava holds not only spiritual significance but also represents protection for the community. His location enhances his prominence, reinforcing his role as a guardian deity. His involvement in local rituals underscores his importance in safeguarding both the physical and spiritual well-being of the settlement (Tiwari, 2002).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BhuteshworBhairavTemple.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BhuteshworBhairavPremises.JPG"
        ],
        "latlng": [27.71764, 85.33624],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Yoshin",
        "location": "Handigaun",
        "history": "Yoshin refers to tall timber poles, about six stories high, cut from a single tree, and are integral to the Toran Ajima/Tudal Devi Jatra in Hadigaun. Two Yoshins are raised annually—one at Dabali and the other at Bhuteshwor. The festival begins on Chaitra Sukla Astami and ends on Baisakh Krishna Navami with the lowering of the poles (Tiwari, 2023).\nThe Yoshin raised at Bhuteshwor includes a halipata, a Kirat totem representing nagas, symbolizing Bhuteshwor Bhairav. The Yoshin at Dabali, though similar, lacks the halipata. The pole raising marks the Kirat New Year and honors both the king and the tutelary goddess at different locations (Tiwari, 2023).\nThe Yoshins are also seen as an invitation to celestial beings for the Tudal Devi Jatra, and the community observes several restrictions, including not sleeping outside the town, refraining from wearing imported shoes, and prohibiting loan repayments after the raising of Yoshins. These rules are communicated by the Shahi community through the Nyakhing, a special musical instrument (Prajapati, T. (2024, November 15). Insights on Yoshin [Interview with Member, Yoshin Guthi].).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/Yoshin.JPG"
        ],
        "latlng": [27.71714, 85.3361],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Jarun Hiti (Jaladroni)",
        "location": "Handigaun",
        "history": "Newar settlements, including Hadigaun, are renowned for their rich architecture, culture, and traditions, and one prominent feature is the Jarun Hiti, or Jaladroni—a stone water tank that reflects the daily life and practices of the community. While Newar settlements typically feature a Jaladroni, each one varies in size, shape, and design.\nIn Hadigaun, the Jarun Hiti is located on the road south of the Bhuteshwor Bhairava Temple, leading towards Dabali. This is the only remaining Jarun in the settlement, although there may have been others in the past that were destroyed over time. Although this Jarun is no longer used for its original purpose of providing water, it still serves a significant cultural function. It undergoes a ritual known as Kwo Puja during Paha Chahare, which symbolically marks the beginning of the upcoming Jatra. During this ritual, the Jarun is cleaned, worshiped, and a small amount of water is filled, serving as a reminder of the past when water was provided for those attending the Jatra. This ritual is believed to symbolize the historical role of the Jarun in serving the community. The responsibility for performing this act lies with a special Guthi, the Munche Guthi (Dangol, G. (2024, November 12). Insights on Jarun Hiti [Interview with Member, Munche Guthi].).\nFurther investigation is needed to uncover more details about this monument's historical and cultural significance",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/Jarun.JPG"
        ],
        "latlng": [27.71708, 85.33606],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Toran Ajima Dyochhen",
        "location": "Handigaun",
        "history": "Toran Ajima/Tudal Devi, also known as Vaishnavi Devi, is a revered Mother Goddess in Hadigaun, considered the protector of Vishalnagar. The Toran Ajima/Tudal Devi Temple, believed to date to the 5th century AD, is located in Bishalnagar-Chandol, northeast of Hadigaun, while her Dyochhen is situated in Dathu Tole within Hadigaun.\nThe Dyochhen, originally a one-story structure, was expanded into a three-story Newar-style building by five brothers from the Prajapati community. It becomes a central hub during the Toran Ajima/Tudal Devi Jatra, also called the Tisa Maligu Jatra (Acharya, 2021).\nThe Dyochhen’s location reflects its central role in Hadigaun, though it is mostly inactive except during the festival. Tiwari (2002) suggests the temple’s relocation to Bishalnagar may have been part of Lichchhavi-era efforts to shift deities and strengthen Vishnu dominance. Despite the relocation, Toran Ajima is brought back for the Jatra, maintaining her connection to Hadigaun.",
        "images": [],
        "latlng": [27.717, 85.33518],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Hadigaun Dabali Premises",
        "location": "Handigaun",
        "history": "Hadigaun hosts five Dabalis, key open stages for cultural and religious events. The most significant is the Central Dabali, believed to be the site of Amshuvarma's Lichhavi-era coronation, making it one of the oldest Dabalis in the Kathmandu Valley (Acharya, 2021).\nThe Central Dabali contains two 7th-century stone inscriptions by Amshuvarma, detailing grants to key temples like Pashupatinath and Changunarayan, reflecting religious tolerance (Bajracharya, 1995; Tiwari, 2023). The northeastern corner is used for raising Yoshin, adding to its cultural importance.\nOriginally surrounded by Falchas with religious significance, only the northeastern (JalaFala) and northwestern (Ja Pha) Falchas remain. The southern Falcha was removed during road expansions, and the northern one, that serves as rest house for holy dancers/Gathus of Pachali Bhairab Dance, Navadurga Dance, no longer exists. (Karmacharya, B. P. (2024, November 14). Insights on Tudal Devi Dyochhen [Interview with Ward Member, Ward No 5].)\nThe Central Dabali hosts local festivals, including the Chokhate Narayan Jatra. Notably, the Pachali Bhairav Dance, performed every twelve years, continues to be a vital cultural tradition.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/HadigaunDabali.JPG"
        ],
        "latlng": [27.71625, 85.33567],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Bharavi Hiti",
        "location": "Handigaun",
        "history": "The stone water spout, located down the wide-stepped path to the east of the Hadigaun Dabali, is one of the few intact Dhunge dharas from the Licchavi period and is considered one of the most important Dhunge dharas in the ancient city. According to the inscription, it was built by Bharavi, the grandson of Mandeva (who was the son of his daughter Vijayavati), in 550 AD. This complex contains three hiti, with two facing east and one facing south (Acharya, 2021).\nThe stone water spout, originating from the Licchavi period, channels water from Gahana Pokhari, which is situated at a higher elevation on the western side of Hadigaun, and drains into the Dhobi Khola river (Tiwari, 2002). This hiti may be religiously and culturally linked to the nearby Satyanarayan Temple, indicating that further research is needed to explore these.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BharaviHiti.JPG"
        ],
        "latlng": [27.71615, 85.33626],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Satya Narayan Temple Premises",
        "location": "Handigaun",
        "history": "The Satyanarayan Temple, located east of Hadigaun Dabali near the Rudramati River, is a gumbaj-style temple housing a four-armed image of Lord Narayan, believed to date back to the 2nd or 3rd century A.D. The temple features sculptures and a nearby Shiva temple, with a 7th-century Garuda Stamba (column) inscribed to Dvaipayana Vyasa, erected by Anuparama Gupta.\nThe temple’s architecture suggests it originated during the Licchavi period, with scholars dating it to the 2nd-4th centuries A.D. It houses significant sculptures, including a Kubera statue (4th century A.D) and a Cāmuṇḍā statue (6th-7th centuries A.D ). A 1545 A.D inscription mentions the installation of an Umamaheswara statue by local figures during King Narendra Malla's reign.\nExcavations between 1948 and 1988 revealed brick structures from the 2nd century A.D, highlighting Hadigaun’s ancient urban significance. A 2021 GPR survey uncovered older stone and brick structures beneath the temple. Additionally, a 750 A.D inscription on a jaḥdhuṃ water tank links the area to its ancient name, Andigrāma.\nThe temple remains a key religious center, with daily rituals performed by a member of the local Shrestha caste. It also plays a central role in preserving local cultural heritage and welcoming pilgrims who come to honor Lord Narayan.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/SatyanarayantempleandthePremises.JPG"
        ],
        "latlng": [27.71587, 85.33655],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "The Mother goddesses and Char Narayan Temple",
        "location": "Handigaun",
        "history": "The larger boundary of Hadigaun is ritually defined by the positions of nine power places, or pith, where the Rudra-Shaktis are believed to reside. These sites, known as pingam-dyo, form the outermost ring of protection for the area. One such site, located along the roadway to Hadigaun and Maligaun, hosts the ancient images of the Sapta Matrika Goddess and a small temple dedicated to Chaturmurti Char Narayan (Tiwari, 2002).\nWithin this periphery is an inscription by Bishnugupta of Mandeva Sambat 57, which outlines social provisions such as widow marriage and remarriage. This inscription is currently housed in the National Museum (Acharya, 2021). The site appears to have been an important pilgrimage destination in ancient times; however, it has lost much of its significance in the present day. Further investigation may be necessary to uncover its full historical and cultural significance.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/TheMotherGoddesses.JPG"
        ],
        "latlng": [27.71456, 85.33561],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nasahdya",
        "location": "Handigaun",
        "history": "Hadigaun is home to two image-less temples dedicated to Nasa Dyo (or Nateshwor), revered by the Newar community, especially in relation to performing arts like music and dance. The temples are located in Thathu Tole (north) and Kotaltole (south).\n\nThathu Tole Temple:\nThis temple is exclusively honored by the Pyeta Khala community, descendants of the original Maharjan people. They play Pyeta Baja that includes key musical instruments (Dhimay, Bhuchya, Kyepi, Ponga) during major festivals and rituals in Hadigaun. The temple was renovated following the 1990 B.S. and 2072 B.S. earthquakes (Maharjan, N. (2024, November 10). Insights on Nasa Dyo [Interview with Guru, Pyeta Khala].). Exclusive rituals are performed by the Pyeta Khala as part of their cultural tradition.\nKotaltole Temple:\nRespected by the broader community, this temple is near a Dabali, indicating Hadigaun's historical role as a hub for dance and music. It was the birthplace of cultural practices like the Naugada Devi Dance and the 12 Barsey Dance, which remain integral to the religious traditions of the Kathmandu Valley (Acharya, 2021).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/NasaDyo.JPG"
        ],
        "latlng": [27.71555, 85.33514],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Bhima Nani",
        "location": "Handigaun",
        "history": "Bhima Nani, also known as Shiva Nani, once housed a grand temple dedicated to Mahadev, located to the east of the Kartikya Temple. Today, only the sanctum floor remains, and the Shivalinga, named Bhimeshwor Mahadev, lies fragmented. A Lichhavi inscription reveals that Bhaumagupta, a powerful regent, usurped land grants that had been donated for the temple’s upkeep (Tiwari, 2002).\nInscriptions suggest that the site remained active until at least 818 AD, when Bhagyachandra installed a deity image there (Bajracharya, 2025 BS). However, the inscribed stone from the late Lichhavi period is now lost (Tiwari, 2002). Historically, Bhima Nani was part of a renowned Kirat-era temple complex called Bhuvaneswor Devkul. This temple and its surrounding area were culturally significant, with a rare stepped well located to the west, now within a private garden. The well, believed to carry holy water and guarded by the naga (serpent deity), plays an important role in the Chokhate Narayan Jatra. It may have also been part of Hadigaun’s Lichchhavi-era water supply system.\nEfforts by King Narendradev to restore Bhuvaneswor Devkul after the disturbances and the fire of the late 7th century were unsuccessful, and the site eventually faded into obscurity. Interestingly, the Shivalinga’s Jalhari (water basin) faces the Ishan Kon (northeast), unlike most Shivalingas, which face north. The presence of another water well to the south, near the residence of the Mahantas, further suggests the site’s religious, cultural, and political significance in its prime (Acharya, S. (2024, November 12). Insights on Bhimanani [Interview with Local Resident].).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/BhimaNani.JPG"
        ],
        "latlng": [27.71585, 85.33407],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Kumar Temple",
        "location": "Handigaun",
        "history": "Located in Kotal Tole, Hadigaun, Kathmandu, the temple features a two-tiered copper roof, roof struts adorned with erotic carvings, and a main entrance highlighted by a new wooden archway depicting Kumar Kartikya. The sanctum houses a late 8th-century statue of Kumar Kartikya on a peacock, and while the temple is locally revered as \"Garudbahini Bhagwati,\" its iconography identifies it as Kumar. The complex also includes a 16th-century Umamaheswara statue. Although the exact date of the temple's construction remains unclear, the style of the Kumar statue suggests an 8th-century origin, with some sources proposing the 13th century. Nearby inscriptions from 1700 AD and 1701 AD document offerings to Kumar and past renovations.\nThe temple, managed by the Shrestha family, hosts several rituals, including worship during Sakimana Purnima, Holi, and a palanquin procession for Kumar during Dashain. (Shrestha, A. N. (2024, November 15). Insights on Kumar Temple [Interview with Ritual Custodian of the temple].) Despite its significance, there is no formal social trust overseeing the temple’s operations. After sustaining damage during the 2015 earthquakes, restoration efforts began in 2023 AD to preserve its architectural and cultural heritage.",
        "images": [],
        "latlng": [27.71617, 85.33377],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nhya Lho",
        "location": "Handigaun",
        "history": "Located on the eastern side of Gahana Pokhari in Hadigaun, Nya Lho, meaning \"fish stone,\" is a flat stone resembling a fish, believed to date back to the Lichhavi era. Beneath the stone lies an eye-shaped marking, enhancing its mystique. The monument holds profound cultural, social, and religious significance for the residents of Hadigaun.\nLocal legends enrich its lore. One speaks of a great flood in Adimakal (ancient times), after which the stone is said to be the remains of a massive fish that miraculously fed the villagers. Another legend recounts how a sage, facing potential harm during a famine, transformed into the fish-shaped stone to escape being consumed.\nReligiously, Nya Lho is integral to the Tudaldevi Jatra. During the festival, the palanquin of Tudaldevi is placed on the stone before proceeding to Gahana Pokhari. The stone is believed to carry a curse, which is symbolically lifted when Toran Ajima’s Khat touches it during the Jatra.(Karmacharya, B. P. (2024, November 14). Insights on Tudal Devi Dyochhen [Interview with Ward Member, Ward No 5].) Additionally, the stone is venerated as Bhairav in the form of a fish, with an eye of Bhairav carved into it, further underscoring its sacred status.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/NyaLho.JPG"
        ],
        "latlng": [27.71697, 85.33416],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Tisa Pukhu (Gahana Pokhari)",
        "location": "Handigaun",
        "history": "Tisa Pukhu, also known as Gahana Pokhari or Ta Pukhu, is located in the southwestern part of Hadigaun, Kathmandu. Its name, translating to \"Pond for the Search of Ornaments,\" reflects its association with the annual Tisa Maligu Jatra or Gahana Khojne Jatra, a festival dedicated to Toran Ajima (Tudal Devi). During this celebration, a ceremonial Khat is immersed in the pond, symbolizing the search for lost jewelry (Gahana), emphasizing its cultural and religious significance within the community (Tiwari, 2002).\nHistorically, Gahana Pokhari is believed to be one of the four ponds constructed by King Mandeva to support Hadigaun's settlement. These ponds, strategically placed near the Manmaneshwari Temple, formed part of a sophisticated water management system. Gahana Pokhari served as a reservoir, supplying water to local wells and a stone spout near the Satyanarayan Temple, highlighting its dual role in daily utility and sacred rituals (Tiwari, 2023). Its oval shape and strategic positioning suggest its importance as a sacred space and water resource, with historical ties to the Kailashkut Bhawan complex, an ancient royal palace. Even today, Tisa Pukhu continues to be an essential water source and plays a vital role in the social and spiritual life of Hadigaun, embodying a harmonious blend of practicality, spirituality, and cultural heritage.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Hadigaun/GahanaPokhari.JPG"
        ],
        "latlng": [27.7169, 85.33298],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Manmaneshwari Temple Premises",
        "location": "Handigaun",
        "history": "The Manmaneshwari Temple, located in the southwestern corner of Hadigaun, is dedicated to Goddess Manmaneshwari. This two-storied temple, believed to originate during the reign of King Mandeva, enshrines the goddess in a copper pot (kalash), replacing a stolen golden pot. Serving as the tutelary deity of both the Licchavi and Malla kings, the temple holds great historical and cultural significance.\nArchitecturally, the temple is a Dyochhen (god-house) with a tiled roof. Its upper floor is vacant, while the ground floor houses the sanctum with carvings of Bhairava and Mahalakshmi on surviving struts. The sanctum contains a Bhagavati statue installed by King Bhaskar Malla in 1702 A.D and a unique Shivalinga, Maneshwar Mahadeva, notable for lacking a jalhari and receiving animal sacrifices. Other deities, including Ganesha, Kumar, and Annapurna, also form part of the shrine.\nHistorically, the temple played a prominent role during the Licchavi period, with King Mandeva adopting the goddess as his tutelary deity. An inscription from Aṃśuvarmā’s reign (608 CE) references Maneshwara, the male counterpart of the goddess, further underscoring its ancient roots. The tradition continued under the Malla kings, with significant contributions from King Bhaskar Malla and later recognition through tax exemptions by King Prithvi Narayan Shah in 1771 A.D and land grants by King Girvanayuddha in 1799 A.D.\nExcavations in 1965 AD unearthed numerous artifacts, including Pashupati coins and stone seals from the reign of Aṃśuvarmā, affirming the temple's Licchavi origins. A 750 A.D water tank (Jarun Hiti), installed by Priyavarmana, was also discovered within the northern grounds, linking the site to the ancient settlement’s water management system.\nThe temple has enjoyed royal patronage and remains integral to local Newar clans such as the Pradhans, Mallas, Pradhanagas, Shresthas, Manandhars, and Rajbhansis, who venerate the goddess as their lineage deity. (Shrestha, R. (2024, November 14). Insights on Manmaneshwari Temple [Interview with Priest of the temple]). Annual rituals are performed between Akshaya Tritiya and Sithi Nakha, although its significance has diminished among worshippers outside these clans. Historically, rituals conducted by the Taleju Temple in Bhaktapur added to its prominence, but such traditions are no longer observed today. (Karmacharya, B. P. (2024, November 14). Insights on Manmaneshwari temple [Interview with Ward Member, Ward No 5].)",
        "images": [],
        "latlng": [27.71571, 85.33369],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      }
    ],
    "droneView": null,
    "model": null,
    "virtualTour": null,
    "videos": []
  },
  {
    "name": "Basantapur Durbar Square",
    "location": "Kathmandu",
    "history": "",
    "images": [
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/AshokaBinayakTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/BasantapurDurbar.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/BasantapurDurbar02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/BhagwatiTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Bimaleshwar.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/ChyasinDega.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/DeguTaleju.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/DurgaTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GaddiBaithak.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GaddiBaithak02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GakutiMahadev.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GarudaLaxmiNarayan.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GarudaNarayan.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Gopinath.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Gorakhnath.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Hanuman.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Hanuman02.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Hanumandhoka.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Hanumandhoka02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Hanumandhoka03.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Hanumandhoka04.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Indreswor.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Jagannath.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/JoshiAgan.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/JoshiAgan02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/JoshiAgan03.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KaalBhairav01.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KaalBhairav02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KaalBhairav03.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KaalBhairav04.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Kageswor.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KalikaTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KasthaMandap.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KasthaMandapTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Kavindrapur1.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KotilingeshwarMahadevTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KotilingeshworMahadevTemple01.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KumariGhar.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KumariGhar02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KumariGhar03.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KumariGhar04.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/LaxmiNarayan.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/LaxmiNarayanTemple02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/LayakuBahi.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahadevaBehindKasthamandap.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahavishnuTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahavishnuTemple02.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahavishnuTemple03.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Mahendreswor.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahendresworTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MajuDega.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MajuDegaTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MakhanGanesh.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MaruHitti02.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MaruHitti.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/NarayanMahan.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/NarayanTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/PanchmukhiHanumanTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/PratapMallaStambha.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/PratapMallaStambha01.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/PratapMallaStambha02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SaraswatiFalcha.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SaraswatiFalcha02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/ShivaParvatiTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SikhamuBaha.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SilyanSattah.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Siva1.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Siva2.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Siva3.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SwetBhairabTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/TagaGanBell.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Taleju.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Taleju02.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Tarinidevi.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/TrailokyaMohanNarayanTemple.jpg"
    ],
    "latlng": [
      27.703783,
      85.30679
    ],
    "monuments": [
      {
        "name": "Tarini Devi Temple / Tarani Baha",
        "location": "Basantapur Durbar Square",
        "history": "The Tarinidevi Temple, locally called Tana Bahah, is a Hindu Sakhta temple, despite the term “baha” in its name suggesting a Buddhist monastery. Established by Thakuri King Shankardev in 826 AD, it is maintained by 14 families descended from the Thaku Juju, who historically served as royal functionaries. The temple, predating the Taleju Temple (tutelary deity of the Malla Kings and the tallest temple in Hanumandhoka Durbar Square), is dedicated to Tarinidevi, associated with the forms of Goddess Tara: Ekajati, Nīlasaraswati, and Ugratara. (Hanumandhoka Durbar Museum Development Committee, 2019)\nThe temple’s origins are debated, with inscriptions attributing its establishment to Shankardev in 826 AD, though reliable records date to 1632 AD. Newar tradition regards Tarinidevi as Taleju’s elder sister, and historical accounts link her to royal protection. During King Mahendra Malla’s reign (16th c.), attempts to expand the Taleju Temple were reportedly obstructed by Tarinidevi’s displeasure.\nRenovated in 2018 AD without government aid, the temple hosts significant rituals, including buffalo and duck sacrifices, while forbidding specific vegetables. It is central to the Dashain festival (around October), opens for public worship on Kartik's 1st bright fortnight, and celebrates its anniversary on Jyestha’s 10th bright fortnight. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Tarinidevi.JPG"
        ],
        "latlng": [27.70511, 85.30845],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=034L4kSwrlI&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=12"]
      },
      {
        "name": "Kalika Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Kalika Temple, adjacent to the Makhana Ganesh Temple, has undergone major changes, now enclosed within the private property of the Khanāla family as of April 2023 AD. Historical photos from 1956 AD depict the temple in an open space with a domed roof and long finial. In 2005 AD, the Khanāla family replaced the original structure with a concrete chamber, relocating the statues inside and incorporating the temple grounds into their residence.\nThe temple's original construction date is undocumented. Pruscha (1975, p.87) suggests it was built in the 20th century, describing it as a square sanctum with a domed roof and a torana depicting Mahishamardini. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KalikaTemple.jpg"
        ],
        "latlng": [],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Makhan Ganesh Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Ganesh Temple, located between Makhana Tol and Hanumandhoka, showcases a mix of architectural styles. The temple was remodeled during the 1987 SAARC summit in Kathmandu (BS 2044), funded by Divya Pradhan of Kulu Cuka, Makhana Tol. Previously, it followed the sikhara style with a prominent pinnacle, as seen in 1980s photographs and recalled by locals. A stone torana with Chepu, from the earlier design, is integrated into the current structure.\nA Maharjan woman performs daily rituals at this primary Ganesh temple (SthanaGanesh) of Makhan Tol. It holds cultural significance, with locals seeking blessings before major events or ceremonies. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MakhanGanesh.JPG"
        ],
        "latlng": [],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Mahendreswor Mahadev Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Mahendreswor Temple, also known as Makhan Pashupati Temple or Sano Pashupati, is a revered Shiva temple located in Makhan Tole, Kathmandu. This temple was commissioned in 1561 AD (Nepal Samvat 682) by King Mahendra Malla, who sought to establish a Paśupatinātha temple near his palace, similar to the Yaksheshwar Temple in Bhaktapur. Historical accounts suggest that Mahendra Malla followed the tradition set by King Yaksha Malla of Bhaktapur, who had built a Paśupati temple near his palace for daily worship. This act of devotion likely inspired Mahendra Malla to construct the Mahendreśvara Temple in Kathmandu (G. Vajracharya, BS 2033, p.79).\nThe temple’s two-tiered pagoda structure houses a four-faced śivaliṅga (Chaturmukhi Shiva Linga), symbolically representing Lord Pashupatinath. Historically, it also served as an alternative site for worship during floods that made access to the main Pashupatinath Temple near the Bagmati River difficult. This practical yet spiritual role elevated the temple's importance among devotees and earned it the affectionate name Makhana Pashupati .\nOver the centuries, the Mahendreswor Temple has undergone significant renovations. A major restoration took place in 1963 AD (BS 2020), and a Shiva-Nandi statue was added in 2009 AD (BS 2066). Despite these changes, the temple has retained its architectural integrity, resembling Bhaktapur's Yaksheshwar Temple in its design and structure (Shrestha, 2013).\nToday, the temple remains a prominent pilgrimage site, especially during Shivaratri and the auspicious month of Śrāvaṇa, drawing devotees from across the valley. The Mahendreśvara Temple stands as a testament to royal devotion, cultural continuity, and the architectural heritage of Kathmandu.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Mahendreswor.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahendresworTemple.jpg"
        ],
        "latlng": [27.70531, 85.30768],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=81mm3qZ-sTQ&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=11"]
      },
      {
        "name": "Mahavishnu Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Mahavishnu Temple in Hanumandhoka is a historic temple dedicated to Mahavishnu, and enshrines a gilded statue of the deity in its sanctum, depicting various incarnations such as Trailokyamohana, Pañcamukhī-Lakshminarayan, and Vaikuṇṭha-Vishnu.\nThe temple’s origins remain uncertain but are believed to be connected to King Jagajjaya Malla’s son, Rājendra Malla. The original three-tiered structure was reduced to two tiers after the catastrophic earthquakes of 1934 AD. During this time, the original Mahavishnu statue was relocated to Nāsaḥ Cuka for safekeeping.\nA significant restoration effort was undertaken around 2003 AD, led by the Department of Archaeology and the Kathmandu Valley Preservation Trust. This restoration sought to return the Mahavishnu Temple to its pre-1934 configuration using historical photographs as references. Key architectural elements such as the three tiers, traditional tiles, and gilded finial were reconstructed, while plain struts and a new Mahavishnu statue were added to the sanctum.\nThe temple suffered damage again during the 2015 Gorkha Earthquake. It was subsequently repaired, ensuring its preservation as a cultural and religious landmark in Hanumandhoka. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahavishnuTemple.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahavishnuTemple02.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahavishnuTemple03.jpg"
        ],
        "latlng": [27.70513, 85.30736],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Kotilingeshwar Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Kotilingeswor Mahadev Temple, located in front of the KaalBhairav shrine at Hanumandhoka Durbar Square, is a south-facing stone structure built on three plinth levels. It features entrances on all four sides, with arched stone toranas depicting Chepu. Surrounding carvings include paired oxen with composite heads, reflecting Licchavi art influences. Adjacent elements include a dharmaśilā and a statue of Kāmadeva.\nCommissioned by King Mahendra Malla in 1566 AD (NS 687), the temple was adorned with gold and inaugurated with a koṭīhoma ritual and Rāmāyaṇa dance. It was later granted lands by Queen Bhuvanalakṣmī, earning the title Bhuvaneśvara Temple, with 39 ropanīs of land under its Guthi. Originally built in a sikhara style in 1562 AD, its spires were destroyed by the 1746 earthquake and replaced with domes, and further damage in 1934 led to subsequent renovations.\nDespite modifications, the temple remains a vital cultural and architectural landmark within Hanumandhoka Durbar Square. (Asian Historical Architecture, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KotilingeshwarMahadevTemple.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KotilingeshworMahadevTemple01.jpg"
        ],
        "latlng": [27.70504, 85.30721],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Kageswor Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Kageshwor Mahadev temple, originally named \"Bhuvaneśvara\" after its founder Bhuvanalakṣmī, is a distinctive temple combining elements from both the tiered and sikhara architectural styles.\nBuilt in 1711 AD (NS 831) by Bhuvanalakṣmī, the temple was originally a stone structure with a four-faced śivaliṅga, indicating a primarily sikhara style. Over time, the structure underwent significant changes, especially following the 1833 earthquake, which resulted in the mixed architectural style seen today. Henry Oldfield’s 1858 painting depicts the temple in its current form, likely reflecting these alterations. (Asian Historical Architecture, n.d.)\n\nFurther damage occurred during the 1934 and 2015 earthquakes, both of which caused the temple to collapse completely. Between these events, the Kathmandu Valley Preservation Trust (KVPT) restored the temple in 2006. After damages in 2015, the KVPT, in partnership with the Department of Archaeology, reconstructed the temple in 2018 with support from the US Ambassadors Fund for Cultural Preservation.\nDespite the transformations, the temple remains a key monument in Hanumandhoka Durbar Square, representing an architectural blend that emerged from successive restorations. Mary Slusser, an art historian, remarked on this fusion as \"a very unfortunate architectural marriage,\" referring to the shift from a traditional multi-tiered Newar-style monument to a mixture of tiered and sikhara structure after the 1934 earthquake. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Kageswor.jpg"
        ],
        "latlng": [27.70496, 85.30745],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Mahadev Temple",
        "location": "Basantapur Durbar Square",
        "history": "The southern Śiva temple, located near Siṃha Dhvākhā, the western entrance to the Taleju Temple in Kathmandu Durbar Square, is a west-facing, two-tiered structure with a traditional tiled roof topped by a metal finial. The sanctum houses a stone śivaliṅga, revered as Ānandeśvara Mahadev, according to the temple's priest, Pāṇḍe, a 67-year-old.\nThe original construction date of the temple is unclear. Pruscha (1975, p.55) suggests a likely 17th-century origin. A nearby northern Śiva temple has an inscription documenting its reconstruction in 2018 AD (BS 2074) after the 2015 earthquakes. The temple remains a significant yet understated monument within the religious and cultural landscape of Hanumandhoka Durbar Square. (NHDP, n.d.)\nSituated to the north of the western entrance of the Taleju Temple (Siṃha Dhvākhā) in Kathmandu Durbar Square, Śiva Temple is a west-facing, two-tiered temple that houses a stone śivaliṅga, revered as Raṇamukteśvara Mahadev, as identified by the temple's priest, Pāṇḍe, a 67-year-old male.\nAlthough the exact origins of the temple remain uncertain, Pruscha (1975, p.55) attributes its construction to the 17th century. Following the damage caused by the 2015 AD earthquakes, the temple was reconstructed in 2018 AD (BS 2074), as indicated by an inscription on its southwestern corner.\nDaily rituals are no longer performed at this temple. Historically, priests from the Rājopādhyāya caste conducted worship, but since 2007 AD, this duty has transitioned to Pāṇḍe priests. Simple worship is now carried out only during specific occasions such as Shivaratri (February/March) and Dasaĩ (September/October). (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Siva1.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Siva2.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Siva3.JPG"
        ],
        "latlng": [27.7049, 85.30781],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Taleju Bhawani Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Taleju Temple, also called the Taleju Bhawani Temple, is one of the oldest and most significant monuments in Hanuman Dhoka Durbar Square, constructed during the reign of King Mahendra Malla in 1563 AD. It holds a central position as the shrine dedicated to Taleju Bhawani, the patron goddess of the Malla dynasty. The temple's construction was part of a broader building initiative in Hanuman Dhoka Durbar Square by King Mahendra Malla, which also included other notable temples such as the Jagannath, Kotilingeswar Mahadev, and Mahendreswara temples.\nOriginally a goddess from South India, Taleju was brought to the Kathmandu Valley by the Malla kings. She replaced the earlier goddess Māneśvarī in the 14th century and became the guardian deity of the Malla rulers. The mantra associated with Taleju was believed to be essential for ensuring the continuity of royal rule and was passed down under specific conditions. The Malla kings established shrines dedicated to Taleju in each of their earlier independent states, including Bhaktapur and Patan, as well as in many other Newar settlements such as Dolakha and others.\nThe Taleju Temple has undergone several renovations over time. Initially constructed as a large, three-tiered structure, it underwent significant modifications during the 17th century under the patronage of King Pratap Malla, who added gilt copper paneling and further renovated the temple. The current architectural layout of the temple follows a cosmic mandala design, with a twelve-stepped base and sixteen satellite shrines surrounding the central sanctum.\nEncircled by a high wall, the temple’s access is typically restricted to priests. Public entry is allowed only during special occasions such as Indra Jatra and Dashain, marking significant cultural and religious events in the Kathmandu Valley. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Taleju.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Taleju02.jpg"
        ],
        "latlng": [27.70479, 85.30797],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Panchamukhi Hanuman Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Panchamukhi Hanuman Temple is a unique example of a traditional Nepali circular tower, located in the northeast corner of the Hanumandhoka palace's Nasal Chowk, the largest and central courtyard of its eight courtyards.\nThe construction date of the temple is disputed, with some sources suggesting it was built in the early 19th century (Gutschow, p. 344), while others date it to 1655 (Pande), placing its origins during the late Malla or early Shah dynasty period. The temple is dedicated to Panchamukhi Hanuman, a five-faced form of the Hindu deity Hanuman. The tower itself features five circular tiered roofs, which are architecturally significant as circular tiered roofs are rare in the Kathmandu Valley. Only a handful of temples with this distinctive design can be found across the valley.\nThe symbolic significance of the number five is reflected throughout the temple. The name \"Panchamukhi Hanuman\" aligns with this theme, as Shrestha notes that in Newari, Panchamukhi Hanuman is often referred to by the word \"nya,\" which carries the double meaning of \"five\" and \"fish.\" (Asian Historical Architecture, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/PanchmukhiHanumanTemple.jpg"
        ],
        "latlng": [27.7044, 85.30771],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nautalle Durbar(Basantapur Tower)",
        "location": "Basantapur Durbar Square",
        "history": "The Basantapur Tower, also known as the Nau Talle (Nine-Storied) Tower, is the tallest structure in Kathmandu's Hanumandhoka palace. It is believed to have been built during the reign of King Prithvi Narayan Shah (1723–1775) and his successor, King Pratap Singh Shah (1751–1777), over the foundation of an earlier Malla-era structure. This tower symbolizes the unification of the Kathmandu Valley, with each of the four corner towers representing one of the sub-kingdoms: Lalitpur, Bhaktapur, Kirtipur, and Kathmandu.\nThough Gorkhali-born, the Shah kings embraced Newar arts and architecture, integrating local traditions into the design of the palace. The palace's quadrangular layout follows a Newar design precedent, dating back to the 12th century, which had been continuously developed and refined during the Malla period (12th–18th centuries).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/BasantapurDurbar.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/BasantapurDurbar02.jpg"
        ],
        "latlng": [27.70389, 85.30749],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Hanuman Stambha",
        "location": "Basantapur Durbar Square",
        "history": "The Hanumān statue at the entrance of Hanuman Dhoka is a significant landmark, giving the palace complex its name, which means \"entrance adorned with Hanuman.\" Covered in oil and vermilion powder, the statue features Hanumān in a blessing gesture (varada-mudrā) with his right hand and a protective gesture (abhaya-mudrā) with his left. Installed by King Pratap Malla in 1672 AD, the statue was believed to protect against diseases, natural calamities, and other dangers. Rituals are performed daily by the Karmācārya family, with special ceremonies held annually in Bhadra (August-September) and Chaitra (March-April). Devotees, especially those with children, offer butter lamps and garlands seeking protection from fear.\nIn recent years, the intricate details of the statue have been obscured due to layers of oil and vermilion applied during rituals. However, historical accounts and photographs reveal that the statue’s details were clearly visible a few decades ago. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Hanuman.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Hanuman02.JPG"
        ],
        "latlng": [27.70447, 85.30742],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=j_uAyVgrRtA&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=10"]
      },
      {
        "name": "Jagannath Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Jagannāth temple, also known as the Char Narayan or Carnarayan Temple, is one of the oldest and most significant Vaishnava temples in Hanumandhoka Durbar Square. It is built in Panchayana planning with the central temple surrounded by four temples in each of the corners. Positioned near the entrance of the Hanuman Dhoka palace, this temple was commissioned by King Mahendra Malla in 1563 AD. Originally, it was mistakenly attributed to King Pratap Malla (r. 1641-1674 AD) due to the installation of a Krishna (Jagannath) image during his reign. However, architectural historian Michael Hutt discovered that an inscription dated 1563 AD at the base of the temple’s central statue reveals that the temple predates Pratap Malla's reign, linking it to Mahendra Malla. (Asian Historical Architecture, n.d.)\nArchitecturally, the Jagannātha Temple is a two-tiered structure with traditional tile roofing, a walled sanctum featuring three portals on each side, and intricately carved toranas. Within the main sanctum, the central deity is a Caturvyūha Vishnu statue, depicting four distinct forms of Vishnu: Vāsudeva, Saṅkarṣaṇa, Pradyumna, and Aniruddha. The temple also houses statues of Krishna, SuBhadra, and Balarāma, aligning it with the Jagannātha tradition found at the cāradhāma site in Puri, India because of which the temple got its name as Jagannath temple.\nThis temple is one of four major structures commissioned by Mahendra Malla in the Durbar Square, the others being Kotilingeswar Mahadev, Mahendreswara, and the Taleju Temple. (Bajracharya, 1976)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Jagannath.JPG"
        ],
        "latlng": [27.70461, 85.30726],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=Wq4TVO8RGoQ&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=14"]
      },
      {
        "name": "Pratap Malla Stambha",
        "location": "Basantapur Durbar Square",
        "history": "The Pratāp Malla Stambha, located in front of the Śvetabhairava temple at Hanumandhoka Durbar Square, is a prominent stone pillar erected by King Pratap Malla in 1670 AD. The pillar, known as 'Pratapdhvaja' or the Banner of Pratap, features a statue of the king surrounded by smaller statues of his consorts, Anantapriyā and Pravāvatī, and his sons. Pratap Malla was known for his innovative and unconventional endeavors, such as his interest in diverse scripts and his unique architectural contributions. The pillar marks a departure from traditional pillars, which typically featured divine vehicles rather than human figures, setting a trend followed by subsequent rulers. The inscription on the pillar lists the names of the princes and details Pratap Malla's offerings to the deity Taleju Māju, including golden pinnacles, an umbrella, and statues, alongside a land endowment for the pillar's maintenance. The statues' attire reflects Mogul influences, with Pratap Malla depicted in meditation, wearing a serpent-shaped crown.\nThe pillar was affected by the 2015 earthquake and the idols on top of it were reinstalled. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/PratapMallaStambha.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/PratapMallaStambha01.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/PratapMallaStambha02.jpg"
        ],
        "latlng": [27.70466, 85.30712],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Gopinath Temple (Sri Krishna Maha Vishnu Temple)",
        "location": "Basantapur Durbar Square",
        "history": "The main deity of the temple is a composite statue of Vishnu and his incarnation Krishna, known as Shreekrishna Mahavishnu. The gilded statue, located in a three-tiered temple west of the Taleju temple at Hanumāna Ḍhokā, stands on three plinths with an entrance on all four sides, facing east. The ground floor has a three-bayed ambulatory on all sides, and the four-armed statue of Shreekrishna Mahavishnu carries a discus (cakra) and a conch (śaṅkha) shell with his secondary arms; with his principal arms placed in front of his chest as if he holds a flute. The cakra and śaṅkha represent Vishnu, while the flute, which is no longer intact on the statue, represents Krishna. (G. Bajracharya BS 2033, p.84).\nAlthough Pruscha (1975, p. 62) identifies the temple as a 17th-century structure, there is no historical source that dates its initial construction. However, a manuscript records King Pratap Malla offering a cakra to a Vishnu temple in 1666 AD, which appears to be this one (G. Bajracharya BS 2033, p.84).\nMiśra brahmins conduct daily rituals at the temple, and on Kṛṣṇāṣṭamī, the 8th day of the dark fortnight of Bhadra, metal statue of Krishna is taken around the Hanumāna Ḍhokā area on a palanquin. Additionally, a ceremonial pole (yaḥsĩ) is erected next to the temple on the 12th day of the bright fortnight, marking the beginning of the Yẽnyāḥ festival in Kathmandu. In the past, the Śāha kings used to sit on the ambulatory of the temple to witness the erection of yaḥsĩ. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Gopinath.JPG"
        ],
        "latlng": [27.70476, 85.30734],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Kaal Bhairab Shrine",
        "location": "Basantapur Durbar Square",
        "history": "The shrine of Kal Bhairav, prominently located in the heart of Hanumandhoka Durbar Square, is one of Nepal's most iconic cultural and spiritual landmarks. Depicting the fierce form of Lord Shiva, this stone monument serves as a powerful symbol of divine justice, protection, and truth. Experts examining its intricate craftsmanship date the creation of the statue to the 7th century, during the Licchavi period, although it was installed in its current location in the 17th century by the legendary King Pratap Malla (HMG Department of Archaeology, Kathmandu Metropolitan City, & Kathmandu Valley Preservation Trust, 2005; Bajracharya, n.d.).\nKnown as the “Court Bhairav,” this shrine historically played a central role in Nepal’s judicial system. Until the Rana period, individuals in legal disputes or serious conflicts were brought before Kal Bhairav to take oaths of truth. It was believed that any false statement made in the deity’s presence would result in divine retribution. This practice, deeply rooted in cultural beliefs, reinforced Kal Bhairav’s authority as the ultimate seer of truth and a protector of justice in the Kathmandu Valley (Setopati, 2024).\nThe colossal stone image of Kal Bhairav is a remarkable piece of art that exudes divine power and authority. The deity is portrayed with six arms, each holding symbolic objects that signify his destructive and protective powers. These include weapons and ritual implements that evoke his fierce aspect as the destroyer of evil forces. His open mouth displays his sharp teeth and protruding tongue, a characteristic feature symbolizing his ferocity. Kal Bhairav stands adorned with a garland of skulls, representing his transcendence over life and death, and his expression is both fearsome and captivating, evoking awe and reverence (Setopati, 2024).\nThe intricate details of the statue’s craftsmanship—particularly its bold carving, intricate ornamentation, and harmonious proportions—are hallmarks of Licchavi-period artistry. The vibrant colors applied to the stone figure by devotees during religious rituals add a dynamic element to its appearance, making it a living symbol of devotion.\nLegend holds that the image was discovered during the excavation of a water conduit at Buddha Nilkantha and brought to Kathmandu by King Pratap Malla. While this story remains unverified, the statue’s stylistic and technical details confirm its origins in the 7th century, a time of flourishing stone craftsmanship in the Kathmandu Valley. Gautama Vajra Bajracharya, in his detailed accounts of Hanumandhoka, highlights the ancient origins of this masterpiece, underscoring its deep historical and artistic value (Bajracharya, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KaalBhairav01.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KaalBhairav02.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KaalBhairav03.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KaalBhairav04.jpg"
        ],
        "latlng": [27.70477, 85.30712],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=31G-wuNnxW0&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=17"]
      },
      {
        "name": "Indrapur Temple",
        "location": "Basantapur Durbar Square",
        "history": "Indrapur is a sattal-like temple with an open plan upper level, directly adjacent to the Vishnu temple from 1667. Unusually, it defies the typical convention that forbids worshippers from occupying a floor above the enshrined deity, though in recent years, access to the balcony has been restricted. As noted by Bernier, as late as the 1970s, the upper level was occasionally used to display a statue of Indra during the annual Indra Jatra festival. The windowless square sanctum on the ground floor includes an entrance on the south side and a shiva lingam along the north wall. Access to the interior is generally prohibited.\nAccording to Michael Hutt, the Indrapur may be a stand-in for the much grander Indreshwar Mahadev at Panuati, allowing worshippers to accrue the benefits of \"visiting\" that site by worshiping at this smaller substitute temple. (Nepal Heritage Documentation Project, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Indreswor.JPG"
        ],
        "latlng": [27.70479, 85.30723],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Lakshmi Narayan Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Lakshminarayan Temple, located directly west of the Jagannath Temple in Hanumandhoka, is a two-tiered Newar-style tiered built during the reign of Pratap Malla (r. 1641-74). Dedicated to Vishnu as Narayana alongside Lakṣmī, the temple is square in plan with entrances on all four sides, though only the west and south are visible due to its proximity to the Kaal Bhairav image.\nThe temple suffered damage in the 1934 AD earthquake and was reconstructed in the early 1940s under Prime Minister Juddha Śamśera with further renovations occurring in the 1950s and again in 2007. It was restored once more after the 2015 AD earthquake. The temple remains mostly closed to visitors, with no reported socio-cultural activities or priestly services taking place within. (Ranjitkar & Joshi, 2007)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/LaxmiNarayan.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/LaxmiNarayanTemple02.jpg"
        ],
        "latlng": [27.70513, 85.30736],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Degu Talle Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Degu Tale Temple, standing 62 haat tall, was historically reserved for Malla kings to perform the Dewali (Digu Puja), as it was the Istadevata (main deity) of the royal family of Malla Kings. Due to its royal significance, public entry was restricted.\nAccording to the Bhasa Bansawali, the temple was originally constructed by King Shiva Singh. In B.S. 1727 Bhadra, King Pratap Malla renovated the temple, adding a golden roof and gajur (pinnacle). This temple uniquely stands on the terrace of a three storey structure and has four highly decorated, three-faced doors, with the main entrance facing south. The north-facing door was later silver-coated by Shri 5 Girvan Yuddha Bikram in B.S. 1872. While most temples typically feature an odd number of gajurs (1, 3, or 5), this temple originally had six, as mentioned in Pratap Malla’s inscription on the pillar in front of the temple. Today, five gajurs remain—four at the corners and one at the center. The temple is traditionally believed to have been established on Akshaya Tritiya, and a special puja is held annually on this day (Bajracharya, 1976).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/DeguTaleju.JPG"
        ],
        "latlng": [27.70441, 85.30703],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Swet Bhairab Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Swet Bhairav statue, situated adjacent to the Degu Taleju temple, is fully revealed to the public only during the Yenyaa or Indra Jatra festival. Historical inscriptions indicate that the statue was established by King Rana Bahadur Shah in 1852 B.S. However, its origins are believed to date back earlier. According to local accounts, the statue was initially made of stone, but after the death of his son, a grief-stricken Ran Bahadur Shah funded the gold plating for the statue.\nBefore being unveiled for Indra Jatra, the statue undergoes special rituals and sacrifices, along with a repainting process. Sundaranand Wada, in his text Triratna Saundarya Gaatha, described Swet Bhairav as \"Sharavmukh Bhairav\" and explained its purpose—to enhance the grandeur of Indra Jatra and protect against dakini, ghosts, and evil spirits.\nHistorical financial records reveal that the gold used for the statue cost 4,000 rupees when the price of one tola of gold was 18 rupees.\nDuring Indra Jatra, crowds gather around the mask of Swet Bhairav to drink sacred liquor that flows from its mouth through a small pipe. This liquor, believed to prevent illness, is served over all eight days of the festival. Alcohol is offered on the day of the full moon (Purnima), while rice beer is served on the other nights. Approximately 80 liters of liquor are distributed daily during the festival (Bajracharya, 1976)(Tamrakar, 2024).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SwetBhairabTemple.jpg"
        ],
        "latlng": [27.70452, 85.30693],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=xPT4xJTdBvs&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=18"]
      },
      {
        "name": "Chyasin Dega [Vamsha Gopal (Krishna) Temple]",
        "location": "Basantapur Durbar Square",
        "history": "The Cyāsiṃdegaḥ, also known as the Krishna Temple or Vaṃśagopāla Temple, is an octagonal monument located northwest of the Hanuman Dhoka palace in Kathmandu. Commissioned by King Pratap Malla in 1649 AD (NS 769), this temple was built to commemorate the king and his deceased queens, Rūpamatī and Rājamatī. The name \"Cyāsiṃ\" is derived from the local term \"cyāsiliṃ,\" meaning \"eight edges,\" which corresponds to its distinctive octagonal structure.\nThe main entrance faces east, leading to the sanctum where statues of Krishna, flanked by his consorts Rukmiṇī and Satyabhāmā, are enshrined. These statues symbolically represent King Pratap Malla and his two late queens, an unusual act in history where a ruler deifies himself and his spouses. (Bajracharya, 1976)\nIn front of the temple, two stone pillars stand, one of which bears a damaged statue of Hanumān. The second pillar’s statue has been lost over time.\nA special worship and celebration takes place during Krishna Janmasthami as well.(Asian Historical Architecture, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/ChyasinDega.jpg"
        ],
        "latlng": [27.70472, 85.30687],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=ehy3UU_l5UQ&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=6"]
      },
      {
        "name": "Saraswati Temple",
        "location": "Basantapur Durbar Square",
        "history": "At first glance, the Saraswati Falcha resembles a square-shaped structure, known locally as a mandaḥ, a type of structure common in the Kathmandu Valley and surrounding areas. However, unlike the typical mandaḥ phalcā, which is always free-standing and open on all sides, the Saraswati Falcha is attached to a brick wall on its western side.\nThe rear wall of the Phalcā contains a small, enclosed chamber that serves as a sanctum housing a medieval statue of Sarasvatī. This sanctum can be accessed through an artistically carved wooden door. The statue of Sarasvatī depicts the goddess with four arms, seated in the lalitāsana posture. In her two upper arms, she holds an akṣamāla (prayer beads) and a scripture, while her primary right and left hands display the varada-mudrā (gesture of granting boons) and abhaya-mudrā (gesture of fearlessness), respectively.\nThere are no historical records that precisely date the original construction of the Phalcā, but the wood carvings suggest that it was built in the mid-to-late 17th century. Uniquely, the outer sides of the Phalcā's nināḥs are adorned with carvings of various Hindu deities and figures, while the inner sides are also decorated, a rare feature for such structures. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SaraswatiFalcha.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SaraswatiFalcha02.jpg"
        ],
        "latlng": [27.70462, 85.3068],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Taga Gan Bell",
        "location": "Basantapur Durbar Square",
        "history": "The Taḥgaḥ Gaṃ, a large bell located in Hanumandhoka Durbar Square, was installed in 1797 AD (BS 1854) by King Raṇabahādura and dedicated to Goddess Taleju. Similar bells had been established earlier in Bhaktapur and Patan by King Bhupatīndra Malla and King Vishnu Malla, respectively. These bells, dedicated to Taleju, were placed on elevated platforms to project their sound over long distances. They served various purposes, such as making announcements, marking time, and intimidating adversaries. In Kathmandu, the bell is rung during the morning rituals at Degu Taleju temple.\nTraditionally, the bell is rung 108 times every morning at 9 AM and 365 times during the evening of Mha Puja. Other rituals associated with this bell include the annual puja during Saraswati Puja, rituals during Dashain and Tihar, and special offerings during Indra Jatra, particularly for the three chariots.\nThe practice of ringing the Taḥgaḥ Gaṃ was disrupted in 1933 AD (BS 1990) when one of the bell’s chains broke. Though briefly repaired, it eventually fell silent for decades. In 2009 AD (BS 2066), the tradition was revived with Bābu Krishna Maharjan entrusted to ring the bell 108 times every morning at 9 AM and continues till date. (Maharjan, 2024).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/TagaGanBell.jpg"
        ],
        "latlng": [27.70446, 85.30665],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=CBUbLCq-f7U&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=16"]
      },
      {
        "name": "Layaku Bahil",
        "location": "Basantapur Durbar Square",
        "history": "Layaku Bahi, located in the Hanumandhoka Durbar area, was built by a merchant from ItumBahah and named for its proximity to the palace. It operates as a branch of Sikhomu Bahah, with the Bajracharyas of Sikhomu Bahah managing it. The architecture deviates from typical Bahīs, featuring a three-story main shrine with a corrugated metal roof, a Bajracharya family on the second floor, and a gāndhakuti on the ground floor.\nThe courtyard houses an Ashoka Stupa, Shikharkut Stupa, and a donor's statue. The oldest inscription dates to Nepal Samvat 855 (1734 AD). The most recent renovation occurred in 1898 AD when Lakshmi Thakum added a torana.\nLayaku Bahi is not part of the 15 Bahīs in Kathmandu but is associated with the Bajracharyas, who participate in key rituals like the Kalewar Hillegu Puja and the restoration of Swoyambhu Mahachaitya. Rituals are managed by Udayaman, a single Bajracharya, with annual visits from the donor's descendants for worship (NHDP, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/LayakuBahi.jpg"
        ],
        "latlng": [27.70455, 85.30653],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=-XaR6GkmAnc&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=4"]
      },
      {
        "name": "Shiva Parvati/ Nava Yogini Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Shiva-Parvati temple is a rectangular, two-story building, facing south, standing directly northeast of the much larger Maju Dega temple of 1690, which was destroyed in the 2015 earthquake. Unlike most temples in Nepal, it is built with only one roof. According to Ronald Bernier, this is typical of shrines intended as votive offerings.\nThe temple was constructed at the tail end of the 18th-century during Rana Bahadur Shah's rule (r. 1777-99). Michael Hutt notes that it \"blends harmoniously with the Malla-period architecture that surrounds it.\" (Hutt, p. 88). Hutt opines that it was likely built by Bahadur Shah, the youngest son of Prithvi Narayan, the founder of the Kingdom of Nepal (Bahadur is not to be confused with Ran Bahadur, who was Prithvi's grandson by a different brother). (Asian Historical Architecture, n.d.)\nThe monument is widely characterized as the Shiva-Parvati temple as the upper level features a pair of mannequins of Shiva and Parvati, seemingly gazing south across the square. However, the temple's formal name is the Navadurga, referring to nine manifestations of the goddess Durga whose likenesses are housed on the ground-level floor. These goddesses are not visible to the public. Although the front facade contains five doors, only the central door is operational and is usually kept locked. As with most Nepali temples, the interior is only open to priests and temple custodians.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/ShivaParvatiTemple.jpg"
        ],
        "latlng": [27.70439, 85.30652],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=lRYDQZpKkAY&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=13"]
      },
      {
        "name": "Bhagwati Temple",
        "location": "Basantapur Durbar Square",
        "history": "Bhagawati Temple is located near the southwest corner of the Hanuman Dhoka Palace compound, facing west towards the street, opposite the Shiva-Parvati or Navagdurga Temple. The temple is one of the few structures attributed to Jagajjaya Malla, who ruled Kathmandu from 1722 to 1736 AD. The construction of the Bhagawati Temple is believed to have been an attempt by Jagajjaya Malla to legitimize his rule by associating himself with the earlier Malla kings, particularly Pratap Malla (1641-1674 AD).\nAccording to Michael Hutt in Nepal: A Guide to the Art and Architecture of the Kathmandu Valley, the temple originally housed a statue of the god Narayan, which Jagajjaya Malla called Mahipatindreshvar (Lord of Mahipatindra). The name was chosen to honor Mahipatendra Malla, a murdered king who was the heir of the great King Pratap Malla.\nThe original Narayan image was stolen in 1767 and never returned. In its place, Prithvi Narayan Shah, the first monarch of the Kingdom of Nepal, installed an image of Bhagawati (Durga) that he had taken from Nuwakot. Despite the replacement, the statue of Bhagawati is returned to Nuwakot for a brief period each April, a tradition that continues to this day.\nThis temple thus holds historical and religious significance as both a symbol of Jagajjaya Malla's political maneuvering and the evolving traditions of Nepal's early rulers (Asian Historical Architecture, n.d.; NHDP, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/BhagwatiTemple.JPG"
        ],
        "latlng": [27.7043, 85.30673],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Joshi Aagan Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Jośī Āgaṃchẽ, a three-story building in Kathmandu's Maru Tol, serves as the residence of the Dvaja Jośī clan’s secret deity (āgaṃdyaḥ). This structure is central to the clan’s rituals, with access to the deity’s chamber restricted to those initiated through tantric rites. The building, which faces east, features intricate carvings on the upper levels and latticed windows on the second floor. The ground floor has an ornate entrance framed by a torana. Currently, the ground floor and parts of the upper floors have shops and restaurants.\nThough the Āgaṃchẽ’s origins are unclear, its medieval architecture and wooden carvings suggest a long history. The roof was replaced with copper sheets in 2006 AD. Damaged in the 2015 earthquake, the building was restored by 2019\nThe Sanātana Īṣṭadevatā Guthī, a trust of 100 members, manages the Āgaṃchẽ, performing daily rituals and hosting an annual feast for clan members during Mārgaśīrṣa. This building remains a vital center for the Dvaja Jośī clan's spiritual practices (NHDP, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/JoshiAgan.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/JoshiAgan02.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/JoshiAgan03.jpg"
        ],
        "latlng": [27.70442, 85.30608],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Maju Dega Temple",
        "location": "Basantapur Durbar Square",
        "history": "Maju Dega is a three-tiered Newari-style temple dedicated to Shiva, built in B.S. 1747 by Queen Riddhi Lakshmi during her grandson Bhupalendra Malla's reign. Tragically, Bhupalendra Malla died at the age of 21 after ascending the throne at eight. The temple stands on a nine-level pyramidal plinth and is distinguished by a unique finial or pinnacle, a white Buddha stupa, atop its three-tiered roof. (Bajracharya, 1976)\nAccording to the Kathmandu Post, the temple was a popular gathering place in the 1970s for foreign visitors, chiefly because its lofty vantage point provided an ideal spot to view the surrounding Hanuman Dhoka square",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MajuDega.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MajuDegaTemple.jpg"
        ],
        "latlng": [27.70418, 85.3062],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=ehy3UU_l5UQ&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=6"]
      },
      {
        "name": "Garuda Narayan Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Garudnarayan Satah, located east of Maru Ganesh, was originally built as a Satah, not a temple. A two-story temple addition with a statue of Lakshminarayan was later added, making it also known as the Lakshminarayan temple. The Satah features a statue of Garudnarayan on its top floor, likely inspiring its name. Its structure resembles a satah, with columns surrounding the ground level, and houses statues of Siṃhanāda Lokeśvara and another Lokeśvara in its sacred chambers. The intricate torana above the entrance depicts a meditating Buddha with two sages.\nThe Satah's southern first-floor windows and struts, decorated with Naṛasiṃha and Varāha, suggest it dates back to the 16th or early 17th century. Oral histories mention that a Bahah once stood here, housing the same Lokeśvara deity now in the Satah. Cautāriyā Lakshminarayan Jośī is believed to have built it during King Bhupālendra Malla's reign.\nThe Satah is currently in a dilapidated state, with disputes halting reconstruction. The top floor is inaccessible due to fragility, preventing viewing of the Garudnarayan statue as of May 2023 (NHDP, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GarudaLaxmiNarayan.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GarudaNarayan.jpg"
        ],
        "latlng": [27.70395, 85.30614],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Ashoka Binayak Temple",
        "location": "Basantapur Durbar Square",
        "history": "Aśoka Vināyaka, is one of the four principal Ganesh shrines in the Kathmandu Valley, located in Maru Ṭole, the shrine is referred to as Maru Ganesh, with the additional name \"Gajūmaru Ganesh,\" meaning \"Ganesh without a finial,\" owing to the absence of a finial atop its structure. This modest single-story shrine, facing south, houses an idol of Ganesh under a sanctum with a gilded roof and a silver-covered stone arch (torana). The idol keeps getting replaced as per occasions or special days. The shrine's outer walls are covered in brass sheets, and it is guarded by stone and metal lions. A brass statue of Ganesh's companion, a mouse, stands in front. The shrine is enclosed by metal bars for circulation .\nBelieved to have been built beneath an Aśoka tree, the shrine is also known as Aśoka Vināyaka. It was left incomplete, and the gilded roof was added by Vishnusiṃ Mānandhara's family in 1847 AD. The shrine suffered minor damage in the 1934 earthquake but was repaired. In 2012 AD, the Aśoka Vināyaka Guthi trust undertook reconstruction .\nDaily rituals are conducted by a Bajracharya priest, and the shrine is maintained by the Jyapu community. Notable events include a palanquin procession during Dashain and Ganesh's birthday on the 4th day of Bhadra, celebrated with a traditional feast. Maru Ganesh is believed to have been constructed by Gundakama Deva in the 10th century, with its origins possibly dating back to the 5th-8th centuries AD. (Banjara, 2023).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/AshokaBinayakTemple.jpg"
        ],
        "latlng": [27.70405, 85.30596],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=JsJocnvzJzI&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=15"]
      },
      {
        "name": "Durga Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Durga Temple, located west of the Maru Ganesh Temple, features a two-tiered structure with traditional tiled roofs and intricate wooden carvings. The sanctum houses a statue of Bhagavatī, revered as Durga in her ten-armed Mahiṣāsuramardinī form. The temple's origin is unclear, though the carvings suggest a later-medieval period. The 2015 earthquakes caused damage, but the temple was restored in 2018 by the Department of Archaeology and the Sanātana Iṣṭadevatā Guthi.\nAnnual rituals include an animal sacrifice by the Jośīs from Maru Tol in Mārgaśīrṣa and special worship in Māgha. Maintenance is handled by a Jyapu clan, and a money exchanger operates a temporary shop on the temple's plinth. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/DurgaTemple.JPG"
        ],
        "latlng": [27.70413, 85.30584],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Maru Satah(Kasthamandap)",
        "location": "Basantapur Durbar Square",
        "history": "Kasthamandap, a wooden pavilion in Kathmandu, is an architectural masterpiece that gave the city its name. Known locally as \"Maru Satah,\" it stands out as the largest Satah in the valley and features an open ground floor, unlike other rest houses. The term \"maru\" likely originates from \"mandap,\" meaning pavilion. The structure’s various names reflect its rich history, including “Yaṅgramando” during the Licchavi period.\nBelieved to have been built primarily from a single sāla tree, the structure is supported by four massive pillars and has three tiers. The ground floor houses a statue of Gorakhnath, likely installed in the 14th century, alongside four Ganesh statues at its corners. Nearby landmarks are also named after Kasthamandap, emphasizing its central role in the area’s cultural identity.\nThe exact date of its construction is debated. While some sources suggest it was built during King Lakshminarasimha Malla's reign (1619-1641 AD), references in earlier manuscripts date the structure back to at least the 11th century. Legends connect its creation to the wish-fulfilling tree, Kalpavṛkṣa, which provided the timber for its construction in 1595 AD.\nKasthamandap’s relationship with ascetics dates back to the 15th century, when land donations began supporting their residence there. In the 20th century, the structure housed ascetic communities, who collected rent from shops within it. The site was a hub for public announcements and rituals, highlighting its societal importance.\nIn 2015, the structure collapsed during a devastating earthquake, killing ten people and burying many inscriptions. Excavations revealed that its foundation dates back to the 7th century. Reconstruction began in 2018 and was completed in 2022, though the site remains closed due to ongoing legal disputes over the replacement of damaged statues. (Bajracharya, 1976)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KasthaMandap.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KasthaMandapTemple.jpg"
        ],
        "latlng": [27.7039, 85.30579],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=uS9YjABt-hc&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=8"]
      },
      {
        "name": "Mahadev Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Mahadev Temple, located in Gaḥkuti near Kabindrapur, is a sikhara-style brick temple believed to have originated in the 15th century, though no definitive source confirms this. The temple has undergone several renovations, including after the 1934 earthquake and most recently in 2013-14 through a collaboration between the local community and Kathmandu Metropolis, which altered the upper structure. Despite these changes, some original elements like stone pillars, a wooden arch (torana), and terra cotta kinnara statues remain, indicating its later-medieval origins. The sanctum houses a stone śivaliṅga as the principal deity.\nOnce significant in the local socio-religious context, the temple's daily rituals were maintained by a family from the Udaya community until the early 1990s. However, the temple is now neglected, with no regular rituals except for a bonfire lit by locals during Shivaratri. Despite its historic importance, the temple currently lacks care and attention. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/MahadevaBehindKasthamandap.JPG"
        ],
        "latlng": [27.70377, 85.30557],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Silyan Satah",
        "location": "Basantapur Durbar Square",
        "history": "Silyan Satah, originally constructed from leftover timber from the Kasthamandap building, is a multi-storied rest house. The name \"Silyan Satah\" translates to \"rest house built from surplus timber.\" In 1929 AD (BS 1986), large winged lion statues were added, and the building was renamed Siṃha Satah (\"lion rest house\"). Located south of Kasthamandap, it features a three-story structure with a tiled roof and gilded finial. The second floor has a veranda and houses a Vaṃśīdhara Krishna statue, accompanied by statues of Ganesh and another Krishna. Uniquely, a Garuḍa statue is placed inside rather than outside the building, a common feature in Vaiṣṇava temples.\nLegend suggests the timber used for construction came from a sāla tree (Shorea robusta), with any excess buried between Silyan Satah and Kasthamandap. After a fire destroyed Subbā Dharmanārāyaṇa Mānandhar's house, a Krishna statue was discovered, later enshrined in the rest house by his son, Harṣanārāyaṇa, who established a social trust (guthi) to maintain rituals.\nThe original design of the building is unknown, but the current structure was a renovation by Harṣanārāyaṇa Mānandhar, who added seventeen ground-floor rooms to generate income for rituals. Winged lion statues were added in 1929 AD (BS 1986) by Jogamāyā Mānandhar in memory of her son, leading to the name change. Following the takeover by Guthi Saṃsthāna, the building's condition and cultural activities declined due to insufficient funding. A restoration project, interrupted by the 2015 AD earthquakes, was completed in 2017 AD (BS 2074). As of March 2023 AD, the ground floor operates as a Tourist Information Center managed by Kathmandu Metropolis (NHDP, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SilyanSattah.JPG"
        ],
        "latlng": [27.7036, 85.30577],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=zNKJow35hOI&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B"]
      },
      {
        "name": "Kavindrapur Dhansa",
        "location": "Basantapur Durbar Square",
        "history": "Kabindrapur, also known as Nasahdyah Temple or Dhansa, is located on the east side of Maru Tol Square, southwest of Hanuman Dhoka Palace in Kathmandu. Built in 1657 AD (NS 777) by King Pratap Malla, it was originally one of the tallest structures in Kathmandu Durbar Square. The name Kabindrapur, meaning \"Mansion of Kavindra,\" refers to Pratap Malla's self-given title, \"Lord of Poets.\"\nThis three-tiered building blends a temple and a Satah (rest house) design. The structure is topped with traditional tile roofs and three finials. Its ground floor features 13 arcaded bays, with the middle seven extending outward to form a prominent upper balcony (pula). The original building had an additional tier, which was lost during the 1934 earthquake.\nThe main deity on the ground floor is Nasahdyah, the god of music and drama, represented by a small triangular hole in the wall. Other deities, including Narasiṃha, Bhringi, and Chamunda, are also enshrined. The top level holds a shrine to Bhavanishankar, representing the Vaishnav triad of Jagannath, SuBhadra, and BalaBhadra. The temple holds historical significance, as King Pratap Malla built it to appease Narasiṃha, who was angered by the king impersonating him in a dance. The king installed a statue of Narasimha alongside Nasahdyah.\nA Shakya woman currently performs daily rituals at the Nasahdyah shrine. The temple plays a key role in Kathmandu's cultural life, particularly for traditional music and dance training. Every 12 years, mask dances of Bhadrakālī from Naradevī and Khokanā are performed in front of Kabindrapur, with dance troupes residing in the temple’s upper hall. Kabindrapur remains a testament to King Pratap Malla’s devotion, creativity, and the cultural vibrancy of his reign. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Kavindrapur1.JPG"
        ],
        "latlng": [27.70372, 85.30597],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=rXZ8jiqUZN4&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=5"]
      },
      {
        "name": "Bimaleshwar Mahadev Shrine",
        "location": "Basantapur Durbar Square",
        "history": "The Bimaleshwar Mahadev Temple, situated in Kathmandu's Maru Tole, was built in NS 814 (1693 AD) by Vimaleshwardas, a resident of the same area. The temple lies to the east of Kasthamandap and west of the Pum Dega (Trailokya Mohan Temple).\nBimaleshwardas not only built the temple but also endowed it with land as a guthi (trust) to fund regular worship and other rituals. Income generated from the land was intended to sustain daily worship and special festival rituals.\nWhen establishing the temple, Vimaleshwardas stipulated that on the day of Shivaratri, the Shivalinga should be worshipped with panchamrit, and lamps should be lit. Similarly, lamps were to be lit throughout the duration of Indra Jatra. On the temple's annual anniversary, after feeding Brahmins, Joshis, and Acharyas (Karmacharyas), lamps were to be lit in the evening.\nAny leftover funds from these rituals were to be used for the temple’s maintenance. However, these religious activities are no longer regularly conducted as originally inscribed on the stone slab. Daily worship has been suspended since the earthquake, though the special Shivaratri worship continues uninterrupted. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/Bimaleshwar.jpg"
        ],
        "latlng": [27.70391, 85.30618],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Trailokya Mohan Narayan Temple",
        "location": "Basantapur Durbar Square",
        "history": "The Trailokya Mohan Narayan Temple, also known as the Dasavatar Dekhaune Mandir, is a significant monument in Hanuman Dhoka Durbar Square, Kathmandu. This elegant three-tiered-style temple was constructed in 1680 AD (NS 801) by King Parthivendra Malla to honor his deceased brother, King Nripendra Malla. Located near the Gaddi Baithak and northwest of the Kumari Ghar, the temple is dedicated to Vishnu in the form of Trailokya Mohan, symbolizing Vishnu as the \"Lord of the Three Worlds.\" The structure features a central sanctum housing an eight-armed Vishnu (Trailokya Mohan Narayan) holding Lakshmi in his lap, with Garuda depicted beneath. (Asian Historical Architecture, n.d.)\nIn front of the temple, a rare Malla-period Garuda statue kneels in a prayerful posture facing the temple. Installed in 1689 AD by Queen Riddhi Lakshmi (Nripendra Malla's widow), the statue is noted for its remarkable craftsmanship and lifelike detail.\nThe temple is also known for the annual Dasavatar (Ten Incarnations of Vishnu) exhibition during the Indra Jatra festival, where the Manandhar community of Maru Tole showcases lively displays of Vishnu's avatars. Due to this tradition, the temple is colloquially called the \"Dasavatar Dekhaune Mandir.\" (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/TrailokyaMohanNarayanTemple.jpg"
        ],
        "latlng": [27.70391, 85.3063],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=H2DEL9m6Og4&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=9"]
      },
      {
        "name": "Sikhamu Bahal",
        "location": "Basantapur Durbar Square",
        "history": "Sikhomu Bahah or Shreekhanda Taramul Mahavihar, believed to have been established by Līlāvajra around 741 AD, is one of the oldest and most significant Buddhist monasteries in Kathmandu, though historical records confirm its existence from NS 492 (1372 AD). Located in the Layaku area (Hanuman Dhoka Royal Palace region), it is situated west of the Kumari Bahah in Basantapur. Inside the sanctum is a stone statue of Maitreya Buddha, which replaced an older wooden statue.\nThe monastery is home to five Licchavi-era chaityas and is also historically significant as the residence of the Royal Guru, who served at the Hanuman Dhoka Palace during the medieval period. The name \"Sikhomu\" is believed to derive from a pile of logs used for the construction of Kasthamandap. Some locals speculate that it was built from the roots of a sandalwood tree, based on its Sanskrit name, Shreekhanda Taramul Mahavihar.\nWhile the historical evidence of its construction is sparse, the earliest confirmed reference to Sikhomu Bahah appears in an inscription from NS 492 (1372 AD). The monastery’s Royal Guru, Gyanakīrti, played a role in overseeing rituals following the 1349 AD invasion by Sultan Shamsuddin of Bengal, which damaged the Swoyambhu Stupa. Over the centuries, scholars and priests from Sikhomu Bahah have contributed to religious texts and rituals.\nThe monastery's land once spanned from Kal Bhairav to Atko Narayan, but portions were appropriated during the reign of Jayaprakash Malla for the construction of the Kumari House. After the 1934 earthquake, further land was seized, with several Bahahs relocated, including to Ranamuktishwor.\nTraditionally, the Royal Guru from Sikhomu Bahah led rituals at the Hanuman Dhoka Palace, but this role was shifted to the Brahmin Pāṇḍes after Prithvi Narayan Shah’s conquest. The cultural significance of the Royal Guru continues, with the current Royal Guru, Manjushriratna Bajracharya, performing daily rituals at the Kumari House. Rituals such as Kīkālā Guthi and Pohēlā Guthi are also part of the monastery's traditions (NHDP, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/SikhamuBaha.jpg"
        ],
        "latlng": [27.70376, 85.30626],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/watch?v=S1UFA9Ipuf4&list=PLmTt9hYZOATAGV851NNUPO5rlKFnmgs_B&index=3"]
      },
      {
        "name": "Kumari Bahal",
        "location": "Basantapur Durbar Square",
        "history": "Kumari Bahah, also known as Kumari Chĕ or Kumari Ghar, is the residence of the living Kumari, a young girl revered as a goddess in both Hindu and Buddhist traditions. The term Kumari Chĕ highlights its role as the abode of the Kumari, who is considered the living embodiment of Taleju Bhawani. In addition to this, it is historically identified as Rājakīrti Manorama Vihara, possibly named after a king who built it to ensure his lasting fame. It is also known as Rājalakṣmī Vihara in Vajrayāna Buddhism, where the goddess Vasundharā, equated with both Kumari and Lakṣmī, is worshiped.\nThe origin of the Kumari tradition in Nepal is rooted in a tale from the Malla period. King Jaya Prakash Malla, who secretly played a game of dice with Goddess Taleju every night, was bound by a strict rule: he could not reveal this to anyone, not even a hint. However, his wife grew suspicious of his nightly absences and decided to follow him one evening. She discovered the king with the goddess in a secluded room, playing the game. The queen’s intrusion angered\nTaleju, and as a result, the goddess disappeared. Despite the king’s pleas and rituals to bring her back, Taleju declared that she would not return but would instead reside within a girl of the Shakya community. Thus, the tradition of the Kumari began, with a young girl chosen to embody the goddess Taleju, and the custom has continued to this day as an important spiritual and cultural practice in Nepal.\nArchitecturally, Kumari Bahah is a three-story Vihara featuring an open courtyard. The entrance is guarded by two stone lions, and intricate carvings of deities, such as Ganesh, Bhairava, and Mahiṣamardinī Dūrgā, symbolize Taleju Bhawani. The upper floors have beautifully carved lattice windows, including the central Kumari jhya, which is gilded. Inside, the sanctum houses the kvāpādyaḥ of Pañca Buddha along with statues of Buddhas and Bodhisattvas. The Vihara has dalānas (verandas) providing access to rooms and ritual spaces, including the Kumari's bedroom and the āgamakōṭhā for special pūjās.\nKumari Bahah is not only the Kumari's residence but also a vibrant center of cultural activities. Various pūjās and festivals, including Dashain and Indra Jatra, are conducted, and the Kumari plays an essential role in the chariot procession, paraded through Kathmandu accompanied by other deities and traditional dancers. Kumari Bahah thus remains a symbol of Kathmandu's rich cultural and spiritual heritage (KMC Ward 23 Office, n.d.).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KumariGhar.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KumariGhar02.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KumariGhar03.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/KumariGhar04.jpg"
        ],
        "latlng": [27.70372, 85.30647],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Gaddi Baithak",
        "location": "Basantapur Durbar Square",
        "history": "The Gaddi Baithak, a modern Neo-classical style building within Hanumandhoka Palace, stands in Nhuchen Chowk, where Prithvi Narayan Shah entered the palace after conquering Kathmandu. The name \"Nhuchen Chowk\" refers to \"the chowk with the new house,\" as mentioned in the records of King Jayaprakash Malla.\nIn BS 1904, Jung Bahadur Rana demolished a house in this chowk and constructed a new building blending Newari and modern styles, known as Nolsi Durbar. The upper floor housed a grand meeting room, LalBaithak, where formal ceremonies were held, including medal exchanges and meetings with foreign representatives.\nIn BS 1965, Chandra Shumsher demolished the LalBaithak and built the current Gaddi Baithak, where the Rajgaddi (royal throne) has been kept in the meeting room. The design was by Kishore Narsingh and Kumar Narsingh Rana, who also designed Singha Durbar. The European-style building features a grand staircase, though its initial placement near the Kumari house caused difficulties for worship, prompting a redesign.\nThe Gaddi Baithak suffered damage from earthquakes, including the 1990 earthquake, after which it was swiftly rebuilt. It was again damaged in the 2015 earthquake but retrofitted within a year (Hanumandhoka Durbar Museum Development Committee, 2024, August)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GaddiBaithak.jpg",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Basantapur/GaddiBaithak02.jpg"
        ],
        "latlng": [27.70394, 85.30666],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nasal Chowk",
        "location": "Basantapur Durbar Square",
        "history": "Nasal Chowk is the largest courtyard in the Hanuman Dhoka palace complex. It played a central role during the Malla period, serving as a space for various performances, including dances and theatrical acts. It was also a place where the king would meet with his subjects, and important matters concerning the palace were discussed. Additionally, during times of grief in the royal family, people would gather here to express their condolences. The chowk is named after the deity Nasal (Natyashwor), whose temple is located on the eastern side.",
        "images": [],
        "latlng": [27.70422, 85.30754],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Mul Chowk",
        "location": "Basantapur Durbar Square",
        "history": "Mul Chowk holds great religious and ceremonial significance, as it was the site of coronations for Malla kings and major religious celebrations. It is closely linked with the Taleju Temple, located in the courtyard towards its north. Access to Mul Chowk was historically limited to the priests and their helpers, and even today, it is only open to the public once a year during the Navami celebration of Dashain. During Mohni or Dasain, the deity Taleju is brought down from the Taleju temple and resided in the south wing of Mulchowk. This chowk was not just the center of political power but also a focal point for the sacred rites of the palace.",
        "images": [],
        "latlng": [27.70431, 85.30784],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Sundari Chowk",
        "location": "Basantapur Durbar Square",
        "history": "Sundari Chowk, located north of Mohan chowk was constructed by King Pratap Malla in 1651 AD, is known for its beautiful architecture and central golden water spout. This chowk also features the famous 7th century stone sculpture of Kaliyadaman, depicting Krishna subduing the serpent Kaliya. Apart from its aesthetic appeal, Sundari Chowk was used as a living quarter for the royal family, adding to its historical significance as a functional part of the palace.",
        "images": [],
        "latlng": [27.70472, 85.30758],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Mohan Chowk",
        "location": "Basantapur Durbar Square",
        "history": "Mohan Chowk was the main residential quarter for the Malla kings. In addition to being the royal living space, it also hosted important meetings, including those with foreign dignitaries. This chowk was historically significant as the place where royal family members were sometimes punished. A major attraction of Mohan Chowk is the Panchmukhi Hanuman Temple, noted for its circular tiered roofs. This temple, built in 1655 AD, is closed to the public and is accessible only to priests for rituals.",
        "images": [],
        "latlng": [27.70455, 85.30756],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Lohan Chowk",
        "location": "Basantapur Durbar Square",
        "history": "Lohan Chowk, built during the reign of King Prithvi Narayan Shah and his successors, is characterized by four corner towers. Each of these towers symbolizes a part of the Kathmandu Valley: Vidas Mandir (Lalitpur Tower), Lakshmi Vilas (Bhaktapur Tower), Bangla Mandir (Kritipur Tower), and Nautale Durbar (Basantapur Tower). These towers are a significant architectural feature, representing the unity of the valley under Shah rule.",
        "images": [],
        "latlng": [27.70391, 85.30779],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nhuchhen Chowk",
        "location": "Basantapur Durbar Square",
        "history": "Nhuchhen Chowk is historically notable as the place where King Prithvi Narayan Shah entered Hanuman Dhoka palace during Indra Jatra in 1768 AD, marking the end of Malla rule and the beginning of Shah dominance. The southern wing of this chowk was transformed into the Gaddi Baithak (Throne Room) by Prime Minister Chandra Shamsher in 1908 AD. This hall served as a ceremonial space where kings received foreign ambassadors, and its balcony is still used to view the annual Kumari chariot procession.",
        "images": [],
        "latlng": [27.70407, 85.30676],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Lamo Chowk (Vayu Chowk)",
        "location": "Basantapur Durbar Square",
        "history": "Lamo Chowk, also known as Vayu Chowk, is a long rectangular courtyard located to the west of Nasal Chowk. It adjoins the Gaddi Baithak and contains an important historical feature—a lavatory built by King Pratap Malla, the first of its kind in Nepalese history.",
        "images": [],
        "latlng": [27.704, 85.30711],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Dakh Chowk",
        "location": "Basantapur Durbar Square",
        "history": "Dakh Chowk, located on the west side of Nasal Chowk and adjoining Lamo Chowk, was built by Jung Bahadur Rana for Prince Trailokya. Its construction signifies the expansion and modernization of the palace complex during the Rana period, highlighting the shifting power dynamics within the royal family.",
        "images": [],
        "latlng": [27.7042, 85.30718],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Masan Chowk (Kanhel Chowk)",
        "location": "Basantapur Durbar Square",
        "history": "Masan Chowk, also known as Kanhel Chowk, is separated from Dakh Chowk by a wall and houses the Degu Tale and Bhagwati Temples. Historically, this area was a cremation ground known as Karnadeep when Indrachowk was the confluence of the Bagmati and Bishnumati rivers. Over time, with the expansion of Kathmandu, the cremation ground was moved. Masan Chowk was used for Navdurga Dance performances, which were believed to ward off evil spirits during the Malla reign.",
        "images": [],
        "latlng": [27.70425, 85.30691],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Trishul Chowk",
        "location": "Basantapur Durbar Square",
        "history": "Trishul Chowk, located to the north of Taleju Temple, is named after a large stone trident (Trishul) located in the courtyard. This chowk is also home to an Agnishala (fire shrine) and a Dabali (performance platform). A stable for Taleju’s horse is located in this area, and around the chowk are notable stone icons, including Jalasayan Narayan, Garuda, and Vamsa Gopal. These elements make Trishul Chowk an integral part of the religious and cultural heritage of the Hanuman Dhoka complex.",
        "images": [],
        "latlng": [],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nag Pokhari",
        "location": "Basantapur Durbar Square",
        "history": "Nag Pokhari is located east of Dashain Ghar and features a pond with a serpent hood (Naga) atop a wooden column. This feature was relocated from Tagwo Pukhu in Bhaktapur by King Pratap Malla in 1663 AD. Around the pond, there are stone sculptures of elephants, Parvati, Shiva, and a Chaturvyuha Vishnu icon, showcasing the courtyard’s religious significance.",
        "images": [],
        "latlng": [27.7041, 85.30818],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      }
    ],
    "droneView": null,
    "model": null,
    "virtualTour": "https://virtualtour.airliftventures.com/hanumandhoka-durbar-square/",
    "videos": []
  },
  {
    "name": "Pashupati",
    "location": "Kathmandu",
    "history": "The Pashupatinath Temple is one of the oldest and most revered Hindu shrines in the world. Located in the city of Kathmandu, Nepal, the temple complex is dedicated to Lord Shiva, one of the three primary deities of Hinduism. The temple's history spans thousands of years, and its evolution provides a fascinating glimpse into the development of Hinduism in the Indian subcontinent.Pashupatinath Temple is a UNESCO World Heritage Site and one of the most important pilgrimage sites for Hindus around the world. The temple complex covers an area of around 264 hectares and includes over 500 shrines and monuments, including the main Pashupatinath temple, the Boudhanath Stupa, and the Guhyeshwari Temple. The temple attracts millions of visitors each year, who come to offer prayers and seek blessings from Lord Shiva.\nThe Pashupati Area, also known as Maheshorpur, Swarnapuri, Nepal Puri, and Gola, is a revered divine heritage site in Nepal. Centered around Lord Pashupatinath, it features nine gates, platforms, squares, ponds, grounds, Shakti Peeths, and territorial protectors, symbolizing a unified divine structure.",
    "images": [
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/PashupatinathTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/PashupatinathTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Pingalamai.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/FourShivalaya.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Rajarajeshwari.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/JitajangaprakaseswarMandir.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/TaraKunda.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Vankali.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/VanavinayakaMandir.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Panchadevala.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/BhuvaneshwariTemple.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/ArunaDhara.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/NasatvaGanesh.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Nasahdya.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/DrisheshwarIshworeshwarSireshwar.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Bhasmeshwar.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/CremationGhat.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/MangalaGauri.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/VatsalaTemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Anantanarayan.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Lalitamukteswartemple.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Virupaksha.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Gangamaitemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/BrahmaNaal.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/FifteenShiuvalayas.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/EkadashRudreshwarTemple.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/VishnuTemple(RamchandraMandir).JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/GaneshMandir.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Kirateshwar.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/JayaRudreshwarTemple.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/GaurighatSatah.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/HanumanShrine.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Tamreshwar.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/ToleGanesh.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Mritunjaya.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/IndreshwarMahadev.jpeg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/TrishulSatah.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/JaladyaSatah.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Luhiti.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/SridharVishnudevala.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/SuryaTemple.jpeg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/JayaVagishwari.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/MatsyendraGanesh.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/LaliteshwarMandir.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/BalkumariTemple.JPG"
    ],
    "latlng": [27.710512179221098, 85.3488016875211],
    "monuments": [
      {
        "name": "Pashupati Temple",
        "location": "Pashupati",
        "history": "The origins of the Pashupatinath Temple date back to the ancient Kirat dynasty in Nepal. According to the Gopal Raj Vamshavali manuscript, a cowherd named Surya noticed that one of his cows, Kaili, produced no milk while grazing by the Bagmati River, unlike the others. Upon observing Kaili, he discovered that she would wander off alone, and milk would miraculously flow from her udder, soaking the ground. Surprised, Surya dug at the spot and uncovered a divine light, revealing a Shiva Linga, which is now enshrined at the temple.\nThe Bhasa Vamshavali traces the origin of Pashupati to the Dwapar Yuga, linking it to the Pandavas. Burdened by the curse of Gotra Hatya for killing their kin, the Pandavas sought Mahadev's blessing to absolve their sins, following Lord Krishna's advice. When Mahadev learned of their arrival, he transformed into a buffalo and hid among the herd. The Pandavas recognized him and attempted to gain his darshan, but Mahadev tried to disappear into the earth. As a result, his face appeared in Kathmandu, which became known as Pashupatinath.\nAccording to the Nepal Mahatmya and Himvatkhanda, Lord Shiva once wandered from Kailash and arrived in Kathmandu, where he became enchanted by its beauty and transformed into a deer, living in bliss. The gods, concerned by his disappearance, searched for him and found the mystical deer grazing by the Bagmati River. Suspecting it was Shiva, they caught its horn. In a tug-of-war, the horn broke, and Shiva vanished, returning to Kailash. The broken horn was later enshrined as a Shiva idol, according to another legend. (Shrestha, 2023)\nAccording to legend, Pashupatinath emerged during a conflict between Brahma and Vishnu, manifesting as a divine light that later took the form of Lord Pashupatinath with five faces: Tatpurush (East), Sadojat (West), Bamdev (North), Aghor (South), and Ishan (Above). Worshiped as a Shri Yantra, symbolizing cosmic energy, daily rituals also honor Tripurasundari and the divine union of Shiva and Parvati.\nThe site’s sacred layout includes nine Shakti Peeths arranged in a trident shape, with prominent temples like Vajreshwari, Vatsaleshwari, Guhyeshwari, Jaya Vagishwari, Mangaleswari, Vankali, Bhuvaneshwari, Rajarajeshwari and Nil Saraswati. Other significant temples include Jhamkeshwari, and Manmaneshwari. Together, these elements embody Nepal’s spiritual and cultural heritage, drawing devotees from across the world. (Bhandari K.M (2024, November 27). Insights on Pashupatinath Temple [Interview with the  priest of Pashupatinath].)\n\nThe origins of the Pashupatinath Temple date back to the ancient Kirat dynasty in Nepal. According to the Gopal Raj Vamshavali manuscript, a cowherd named Surya noticed that one of his cows, Kaili, produced no milk while grazing by the Bagmati River, unlike the others. Upon observing Kaili, he discovered that she would wander off alone, and milk would miraculously flow from her udder, soaking the ground. Surprised, Surya dug at the spot and uncovered a divine light, revealing a Shiva Linga, which is now enshrined at the temple.\nThe Bhasa Vamshavali traces the origin of Pashupati to the Dwapar Yuga, linking it to the Pandavas. Burdened by the curse of Gotra Hatya for killing their kin, the Pandavas sought Mahadev's blessing to absolve their sins, following Lord Krishna's advice. When Mahadev learned of their arrival, he transformed into a buffalo and hid among the herd. The Pandavas recognized him and attempted to gain his darshan, but Mahadev tried to disappear into the earth. As a result, his face appeared in Kathmandu, which became known as Pashupatinath.\nAccording to the Nepal Mahatmya and Himvatkhanda, Lord Shiva once wandered from Kailash and arrived in Kathmandu, where he became enchanted by its beauty and transformed into a deer, living in bliss. The gods, concerned by his disappearance, searched for him and found the mystical deer grazing by the Bagmati River. Suspecting it was Shiva, they caught its horn. In a tug-of-war, the horn broke, and Shiva vanished, returning to Kailash. The broken horn was later enshrined as a Shiva idol, according to another legend. (Shrestha, 2023)\nAccording to legend, Pashupatinath emerged during a conflict between Brahma and Vishnu, manifesting as a divine light that later took the form of Lord Pashupatinath with five faces: Tatpurush (East), Sadojat (West), Bamdev (North), Aghor (South), and Ishan (Above). Worshiped as a Shri Yantra, symbolizing cosmic energy, daily rituals also honor Tripurasundari and the divine union of Shiva and Parvati. \nThe site’s sacred layout includes nine Shakti Peeths arranged in a trident shape, with prominent temples like Vajreshwari, Vatsaleshwari, Guhyeshwari, Jaya Vagishwari, Mangaleswari, Vankali, Bhuvaneshwari, Rajarajeshwari and Nil Saraswati. Other significant temples include Jhamkeshwari, and Manmaneshwari. Together, these elements embody Nepal’s spiritual and cultural heritage, drawing devotees from across the world. (Bhandari K.M (2024, November 27). Insights on Pashupatinath Temple [Interview with the  priest of Pashupatinath].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/PashupatinathTemple.JPG"
        ],
        "latlng": [27.710222, 85.348753],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": [
          "https://www.youtube.com/watch?v=djsGO2VGaG4&list=PLmTt9hYZOATCDBNYEMfV9ZtajgAD5zIeT"
        ]
      },
      {
        "name": "Pingalamai Temple (Vajreshwari)",
        "location": "Pashupati",
        "history": "The shrine of Pingalamai, a protective goddess of Pashupati Area, is located beneath a bridge in Pode tola near Tilganga. Locally revered as Mahalaksmi, it features ancient statues, including Varahi, Kali, and Bhairava. An annual Desoddhara Puja (Annual worship honoring Pingalamai as a protective goddess. Rituals are conducted by representatives of Deopatan's four varṇas (brahman, Chhetri, Vaishya, and Shudra). Only residents of the specific Deopatan area can participate, and only once in their lifetime), preceded by the Duducyacya procession, involves tantric and Vedic rituals performed by Deopatan residents. Besides that Pingalamai Palanquin Procession is conducted which departs from Pingalamai shrine to the eastern gate of the Pashupatinath temple organized by two Dangol  from Bhakuna tole and Laganalachi tole in Deopatan. (Bhandari K.M (2024, November 27). Insights on Pashupatinath Temple [Interview with the  priest of Pashupatinath].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Pingalamai.JPG"
        ],
        "latlng": [27.70574, 85.34758],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Four Shivalaya",
        "location": "Pashupati",
        "history": "The four Shivalayas—Rana Mukteshwar, Bala Mukteshwar, Janga Mukteshwar, and Jagad Mukteshwar—constructed in 1888 AD by Prime Minister Bir Samsher in honor of janga Bahadur Rana, are located south of the Rajarajeshwari Temple. These dome roof temples, finished in white lime with ornate Chepu-adorned stone arches, house Shivalingas and statues of Vishnu, Surya, Ganesh, and Durga in their respective sanctums. Nearby, the Agnihotrashala, established in 1962 AD, hosts daily fire rituals and annual Shivaratri celebrations led by local Brahmin priests. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/FourShivalaya.png"
        ],
        "latlng": [27.70732, 85.34801],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Rajarajeshwari Temple",
        "location": "Pashupati",
        "history": "Rajarajeshwari Temple, located south of Pashupatinath by the Bagmati River, is one of the nine Shakti Pithas and a significant site of worship. Renovated in 1408 AD during the reign of Jaya Dharma and Jayajyoti Malla, it enshrines twelve clay deities, including Nava Durga, Bhairavas, and the five-faced Shiva lingam, Panchamukhi Mahadev. The eight-petalled stone mandala, symbolizing the Shri Yantra, represents its main deity, Rajarajeshwari.\nAccording to local belief, Rajarajeshwari has an interesting origin story associated with Bhaktapur. It is said that she expressed a desire to leave Bhaktapur and explore the world beyond. However, the priest of the temple agreed to her request on the condition that she must return before sunrise. If she failed to do so, she would be bound to stay wherever she was at that moment. Unfortunately, Rajarajeshwari  was unable to make it back to Bhaktapur before sunrise. As a result, she had to remain in the Pashupati area.\nThe temple features intricate gilded details added by Jitajanga Rana in the 19th century. Rituals, including daily worship by Karmacharya priests and annual NavaDurga mask dances, connect the site to Bhaktapur’s traditions. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Rajarajeshwari.JPG"
        ],
        "latlng": [27.7082, 85.34822],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Jitajangaprakaseswar Temple",
        "location": "Pashupati",
        "history": "The Jitajangaprakaseswar Temple, built in 1874 AD by Jit Janga Rana, is a unique, dome-shaped structure within the Rajarajeshwari Temple complex. Notable for its oval design, it houses three main shiva lingas, with the central one dedicated to Jitajangaprakaseswar. The temple is adorned with ancient statues, including Nandi, Bhairava, and a trident, and is surrounded by shrines to deities like Krishna and Lakshmi. After being damaged in the 2015 earthquake, the temple was reconstructed in 2020 AD. Daily rituals and special ceremonies, including the Shivaratri festival, are held here, making it a vibrant spiritual site connected to the rich cultural heritage of the area.(NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/JitajangaprakaseswarMandir.JPG"
        ],
        "latlng": [27.70838, 85.34823],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Tarakunda",
        "location": "Pashupati",
        "history": "Tarakunda, located south of the Rajarajeshwari Temple, is a rectangular pond with a cemented bottom and a stone water spout shaped like a tiger’s head, channeling underground water into the pond. While not a major sacred Pond , it is part of the pilgrimage route in the Pashupati area where visitors perform ablutions and worship. Though lacking historical inscriptions or significant myths, Tarakunda holds cultural importance for pilgrims, guided by the tirtha guru, Nemuni (Nemuni is the title given to a Bhatta Bhramhin from the Shankaracharya Aagamghar in the Pashupati area, who acts as the tirtha guru (pilgrimage guide)).(NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/TaraKunda.jpg"
        ],
        "latlng": [27.70793, 85.348],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Vankali",
        "location": "Pashupati",
        "history": "The Vanakali Temple, located southwest of Pashupati in a forested area, is dedicated to the goddess Vanakali, \"Kali of the forest.\" The eight-armed statue, believed to date from the 9th to 12th centuries, depicts the goddess standing on a corpse, holding a sacrificial sword, a severed head, and a drum. Legend ties her to King Shivadevavarman and her role in protecting the area. Renovated by King Mahendra in 1958 A.D, the temple hosts a palanquin procession each year on the 3rd day of the bright Baishak fortnight and is associated with annual sheep sacrifices. The temple also receives special worship from the Pashupatinath Guthi Goshwara. (Bhandari K.M (2024, November 27). Insights on Vankali [Interview with the  priest of Pashupatinath].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Vankali.jpg"
        ],
        "latlng": [27.70729, 85.34591],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Vanavinayak Temple",
        "location": "Pashupati",
        "history": "Vanavinayak Temple, located east of Vanakali Hiti in the Pashupati Area, is a revered shrine dedicated to Ganesh, known locally as \"Hyau Ganesh\" or \"Red Ganesh.\" Believed to have been established by Licchavi King Shivadeva Varmā, the temple features a south-facing brick structure with a metal-sheet roof and no doors at the sanctum entrance. Inside, a four-armed Ganesh statue is adorned with oil and vermillion. Though its exact construction date is unclear, the current statue dates back to the 15th-17th centuries. The temple, renovated in 2009, plays a central role in local religious ceremonies, with a special meal for children held annually on the 14th day of chaitra dark fortnight. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/VanavinayakaMandir.JPG"
        ],
        "latlng": [27.708, 85.34642],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Panchadevala Temple",
        "location": "Pashupati",
        "history": "The Panchadevala Temple ensemble, built in 1870 AD, by King Surendra Vikrama Shah and his family, consists of five dome-style temples on a raised platform south of the Pashupatinath temple. The central Surendresvara Temple, with its gilded finial and stone arch, stands out among the four corner temples. The ensemble was funded by five donors, including King Surendra Vikrama Shah and his family, each contributing a bell to the temples. Damaged in the 2015 earthquakes, the ensemble includes shrines dedicated to various deities like Ganesh, Durga, and Vishnu. Daily rituals and annual ceremonies, such as the anniversary worship on Ashar 8, continue to be observed. (Bhandari K.M (2024, November 27). Insights on Vankali [Interview with the  priest of Pashupatinath].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Panchadevala.JPG"
        ],
        "latlng": [27.70957, 85.3477],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Bhuvaneshwari Temple",
        "location": "Pashupati",
        "history": "The Bhuvaneshwari Temple, located in the southwest corner of the Pashupatinath temple, is dedicated to the goddess Bhuvaneshwari, one of the nine deities in the region. Built in the traditional Nepali mandapa style with a two-tiered roof, it features intricate woodwork and brick mortar. While the temple was originally thatched, a zinc roof was added to protect it from monkeys. The temple is not home to an anthropomorphic idol but a symbolic instrument, worshiped by Karmacharyas. It is part of the cultural fabric of the area, with connections to the Sikali Jatra of Harisiddhi and Trishul  Yatra. Restoration efforts include those by Narendra Malla and the Nepalese army in the 20th century. Visitors can view the temple from outside the sanctum, as entry is restricted. (Karmacharya R (2024, November 22). Insights on Bhuvaneshwari temple [Interview with the  priest of Bhuvaneshwari Temple].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/BhuvaneshwariTemple.png"
        ],
        "latlng": [27.71029, 85.34637],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Aruna Dhara",
        "location": "Pashupati",
        "history": "The Aruna Dhara, located east of the Bhuvaneshwari Temple, is a historic water spout dating back to the 12th-13th century, though it is currently non-functional. The site features a rare statue of Sūrya, the sun god, depicted riding a chariot driven by Aruṇa, accompanied by 12 deities and two attendants. The traditional spout, called a hiti, is set two feet below street level, with only its tip visible. While its connection to Licchavi King Narendradeva’s water spouts is uncertain, fragments of Licchavi chaityas found nearby add to the site's historical significance. The Aruna Dhara remains an important relic of ancient water management and art in the Pashupati Area. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/ArunaDhara.png"
        ],
        "latlng": [27.71026, 85.34657],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Daksinamurti Temple",
        "location": "Pashupati",
        "history": "The Daksinamurti Temple, located near the western entrance of the Pashupati Area, is dedicated to Pashupatinath's guru and features a two-tiered copper roof with intricate carvings of Bhairava and the astamatrika goddesses. Inside, the black stone statue of Daksinamurti, seated under a Kalpabrikshya tree, is surrounded by statues of  22 sages (Rishis). Though the temple's construction date is unclear, it is believed to have been established in 1317 AD by King Rudra Malla to end droughts, with later renovations under King Nripendra Malla in the 17th century. Rituals are performed daily by the Rajopadhyaya priest, with special worship on guru purnima. The temple has undergone repairs following 2015 earthquake damage and continues to be a center of spiritual activity. The temple is open all day for visitors.  (Bhandari K.M (2024, November 27). Insights on Vankali [Interview with the  priest of Pashupatinath].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Daksinamurti.jpg"
        ],
        "latlng": [27.71129, 85.34712],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Pacha Ganesh",
        "location": "Pashupati",
        "history": "The ancient Pacha Ganesh idol in Pachutol, dating back to the 5th–7th centuries, is an exceptional east-facing statue linked to Pashupatinath as his guardian son. Set in a shikhara-style temple with 21 finials, flanked by lions, it is surrounded by relics like Licchavi-era chaityas, a Panchamukhi (five-faced) Pashupatinath, and representations of Parvati (Guheshwori) and Mahadev. Integral to local rituals, devotees offer prayers here before weddings, bratabandha, or festivals like Vatsaleshwari Jatra, where deities are honored with parikrama (circumambulation).  (Bhandari K.M (2024, November 27). Insights on Vankali [Interview with the  priest of Pashupatinath].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/PachaGanesh.JPG"
        ],
        "latlng": [27.71109, 85.34621],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Varuna Dhara",
        "location": "Pashupati",
        "history": "The Varuna Dhara, located south of the Bhakuṃtvāḥ path in the Pashupati Area, is an ancient water spout with significant archaeological value, featuring an east-facing spout adorned with a statue of Varuna the water deity. The spout is set in a walled depression (hitigah) with carved yaksa figures and a stone tank collecting water. A stone statue of Umāmaheśvara is located in the northwestern corner. Built during the early Licchavi period, it has undergone renovations in 1914, 1989, and 2002, though it is no longer operational as of 2023. Locals believe that ritual baths in the nearby water holes, like Varuna Kunada, offer spiritual merit. The site is open to visitors and remains an important cultural and historical landmark in the area. (NHDP, n.d.)",
        "images": [],
        "latlng": [27.71006, 85.34671],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nasatva Ganesh",
        "location": "Pashupati",
        "history": "The Nasatva Ganesh shrine, located north of the stone-paved path leading to the Aryaghat cremation grounds, was once the central shrine for the Nasatva neighborhood. This south-facing temple features a four-armed Ganesh, holding a bead garland, axe, protective gesture, and a bowl of sweets. The shrine is adorned with a carved Ganesh figure above the archway, and fragments of Shiva statues are placed beside the deity. Although many houses in the area were demolished for development, some local families continue to honor this Ganesh as their patron deity. The temple remains a significant cultural and spiritual site, with daily offerings and domestic rites still observed by the community. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/NasatvaGanesh .JPG"
        ],
        "latlng": [27.71016, 85.34675],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Nasahdya",
        "location": "Pashupati",
        "history": "The Nasahdya shrine, located east of the Bhuvaneshwari temple, is dedicated to the deity of music, dance, and drama, traditionally represented by a triangular hole in the wall. This unique shrine not only features the triangular opening but also depicts Nasahdya in a dance pose with twelve arms, holding various tools. Alongside the central figure, sculptures of Vidyadhari, Ganesh, Umamaheshwar, Shiva, and Vishnu add to its significance. Once the hub of cultural activities, the area, known as Nasatva, was home to music and dance training. However, the demolition of nearby homes in 1998 displaced the community, leading to the cessation of these cultural practices. Dating back to the 9th-13th century, the shrine holds historical and artistic value, though its connection to the community has been weakened. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Nasahdya.JPG"
        ],
        "latlng": [27.71022, 85.34699],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Pode Pati",
        "location": "Pashupati",
        "history": "The Pode Pati, also known as Pode Phalcha, is a historically significant structure located on the northern side of the main road leading to the Arya Ghat cremation ground. Once surrounded by traditional homes in the 'Kolachi  Tole  neighborhood, it is the only building remaining after the area’s redevelopment. The Phalcha, with an inscription from 1866 AD, and renovations in 1997 and 2008 AD, is tied to the local Pode community, who were once considered \"untouchable.\" The Phalcha is historically significant for its role during the Pingamai chariot procession, where Pode community members would distribute samay baji and sing devotional songs. While these traditions have ended, the chariot procession still pauses in front of the Phalcha, preserving its cultural importance. (NHDP, n.d.)",
        "images": [27.71008, 85.34743],
        "latlng": [],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Drisheshwar, Ishworeshwar and Sireshwar",
        "location": "Pashupati",
        "history": "This temple was built in 1859 AD and located north of the Bhasmeshwar Shivalinga by the Bagmati River, features three Shivalayas within a single sanctum, each topped with a domed roof. The temple has three entrances dedicated to the deities Drihmeshwar, Ishworeshwar, and  Sireshwar, with stone arches depicting mythical water creatures and Bhairava masks. The site, once home to a Licchavi-era Shivalinga, also houses a 12th-13th century Umamaheshwar statue. Built by Dillishamsher Basnet, a high-ranking officer under Prime Minister Janga Bahadur Rana, the temple is associated with the Rana period and its social elite. Today, daily rituals are still performed by a Brahmin priest, with a trust established in 1868 AD for temple upkeep. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/DrisheshwarIshworeshwarSireshwar.png"
        ],
        "latlng": [27.70974, 85.34839],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Bhasmeshwar Shivalinga",
        "location": "Pashupati",
        "history": "The Bhasmeshwar Shivaliṅga, established in 533 AD (590 BS) by Dhruvasaṅgha, is located at the Bhasmeshwar Ghat by the Bagmati River, south of Pashupatinath temple. This sacred site features five main Shiva Lingas, with Bhasmeshwar at the center, surrounded by Natheshwar, Sthiteshwar, Ravishwar, and Subheshwar, along with four smaller Shivaliṅgas. It is believed that the ashes from cremations at the Ghat, in contact with Bhasmeshwar Shivalinga, absolve sins and grant liberation. Ritual baths at the Aakashbhairav Tirtha during Mārgaśīrṣa’s (month in the Hindu lunar calendar. It is typically the ninth month and corresponds roughly to Nov-Dec in the Gregorian calendar) in which the new moon is said to fulfill desires. Worship here is thought to resolve ancestral and family disputes. Daily rituals are performed by the Bhatta priest from the Pashupatinath Aagamaghar, with the site linked to beliefs of liberation and ancestral healing. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Bhasmeshwar.JPG"
        ],
        "latlng": [27.70969, 85.34837],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Cremation Ghats",
        "location": "Pashupati",
        "history": "Arya Ghat, located at the foot of Pashupatinath Temple along the Bagmati River, is one of the holiest cremation grounds in the Kathmandu Valley. Comprising a series of paved platforms leading to the river, it is home to significant shrines, including Gangamai and Virupaksha, near the eastern stairway. In Hinduism, the Bagmati River near Pashupatinath Temple is considered like the sacred Vaitarani River. Crossing it symbolizes the soul’s journey to liberation after death. The river represents purification and the transition from the physical world to spiritual freedom. Cremation by the Bagmati is believed to cleanse sins and help the soul reach moksha (liberation).Cremation rituals, performed 24/7, follow Hindu traditions where the deceased’s elements—fire, water, air, earth, and sky—are returned to their respective realms. The procession, known as Malami, features rhythmic music or conch blowing, signaling the passing. This sacred site symbolizes the cycle of life, death, and rebirth, with its deep spiritual significance attracting both locals and visitors. (Jenkins et al., 2006)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/CremationGhat.jpg"
        ],
        "latlng": [27.70962, 85.34855],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Mangala Gauri Temple",
        "location": "Pashupati",
        "history": "The Mangala Gauri Temple, near Vatsala Temple within the Pashupatinath complex, honors Mangala Gauri, a protective goddess of Pashupatinath. Its sanctum enshrines a 7th-century stone image of the goddess in a lalitāsana pose, adorned with eight arms holding various objects. The square brick structure features copper-sheeted roofs but lacks a finial and door leaves, with ancient sculptures of guardian deities and Yamuna complementing the sanctum. Rituals led by Karmacharya priests include the annual ja payagu rite (Rice Drying Ritual) and Trishul  Jatra blending tradition and community participation. Renovated in 2017 by the Chaudhary Foundation, this temple connects with nearby sacred sites like Vatsala Temple and remains a testament to Kathmandu's cultural and spiritual heritage.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/MangalaGauri.jpg"
        ],
        "latlng": [27.70983, 85.34862],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Vatsala Temple",
        "location": "Pashupati",
        "history": "The Vatsala Temple, located southeast of Pashupatinath Temple on the banks of the Bagmati River, is a historic shrine dedicated to Goddess Vatsaleshwari, one of the nine protective deities of Pashupatinath. The temple, known as the 'Aadi Mulapitha.The goddess is enshrined as a simple stone yantra. The Vatsala Temple  is steeped in legends. According to the Nepala-mahatmya , Goddess Vatsala was named by Lord Shiva, moved by Parbati  affection while he roamed as Pashupati in the Shleshmantaka jungle. The temple’s rituals include sacrifices, grand feasts, and the sacred bathing of the goddess with ‘Thwon’ (fermented beer), a tradition tied to local lore. It is managed by the Khadgi community, with rituals conducted by the Karmacharya priest of Jaya Vagishwari. The temple was renovated in 2017 by the Chaudhary Foundation and the Pashupati Area Development Trust. It is believed that Bathing in the Bagmati River and viewing Vatsala is believed to grant devotees a place in Kailash, Lord Shiva’s  divine abode.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/VatsalaTemple.jpg"
        ],
        "latlng": [27.70992, 85.34869],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Anantanarayan",
        "location": "Pashupati",
        "history": "The Anantanarayan statue, crafted in the 16th century during King Amara Malla's reign, is a masterpiece of 121 terracotta pieces, located north of the Vatsala Temple on the Bagmati River’s western bank. Depicting the deity with a discus, mace, lotus, and conch, sheltered by a seven-hooded serpent, it features intricate terracotta reliefs on its outer walls. According to legend, potters from Bhaktapur secretly installed the statue outside Pashupatinath Temple due to caste restrictions. The shrine plays a key role in the Bala Chaturdashi rituals, where families honor deceased relatives. Renovated by the Chaudhary Foundation in 2017, it is a significant cultural landmark linked to nearby sacred sites, such as Pashupatinath and Panca Ganesh, offering visitors a glimpse into Kathmandu’s spiritual and artistic heritage.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Anantanarayan.jpg"
        ],
        "latlng": [27.71001, 85.34873],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Lalitmukteswar temple",
        "location": "Pashupati",
        "history": "The Lalitamukteswar Temple, built in 1874 AD by Jitajanga Rana, stands south of Virupaksha Temple at Arya Ghat in Pashupati. This east-facing brick temple features a bell-shaped roof and a Chepu-adorned stone archway leading to a sanctum housing the Lalitamukteswar Shivalinga, surrounded by statues of Durga, Vishnu, Kamadev, and a Bhairav mask. Daily rituals are conducted by priests from the Agama Ghara and Gangamai Temple, with a Lamichhane Brahmin caretaker maintaining the site.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/LalitamukteswarTemple.jpg"
        ],
        "latlng": [27.71021, 85.34893],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Virupaksha Temple",
        "location": "Pashupati",
        "history": "Located near Arya ghat in Pashupati, this stone temple with a bell-shaped roof houses the partially buried 4th-century AD statue of Virupaksha, believed to predate Hindu influence in Nepal. The statue, Discovered by a member of the Kirat community in 1965 AD, it is thought that the statue once held a Shivalinga in one hand and a rosary in the other., is three-eyed, with cascading hair, and is thought to represent Shiva, Kali, or a Naga leader. Local lore claims offering libations prevents the statue from rising and ending the Kali Yuga. The temple, likely built in the 19th or 20th century, also enshrines deities like Mṛgeśvara, Durga, and Ganesh. Daily rituals are conducted by priests of  Pashupatinath, but the eastern boundary wall of the Pashupatinath complex restricts circumambulation. Community efforts and religious practices ensure its preservation.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Virupaksha.png"
        ],
        "latlng": [27.71026, 85.34895],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Gangamai temple",
        "location": "Pashupati",
        "history": "The Gangamai Temple, located near Virupaksha Temple at Arya Ghat within the Pashupati area, is a Rana-era stone temple featuring a domed roof adorned with a carved Sri Yantra and an entrance archway depicting Chepu, a mythical water creature. Inside, the marble statue of Goddess Ganga is flanked by Vedavyasa and Shiva-Parvati. Built before 1848 AD, the temple is associated with Prime Minister Janga Bahadur Rana’s wife, Gangadevi, though inscriptions suggest earlier origins. Daily worship is performed by a Paudela Brahmin, with the temple open for morning and evening rituals, including an Arati. The annual chariot procession on the 7th day of Ashar marks the start of monsoon, showcasing community devotion and the temple’s cultural significance.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Gangamaitemple.JPG"
        ],
        "latlng": [27.71028, 85.34897],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Brahma Naal",
        "location": "Pashupati",
        "history": "Brahma Nal, located at the feet of Pashupatinath Temple, is a sacred site where the holy waters of the Bagmati River flow, believed to purify the soul and help the deceased attain liberation (Mukti) and reach Shiva Loka. The site is associated with a unique Hindu funeral ritual where the deceased is immersed in water to facilitate the escape of life energy, symbolizing the transition from the physical to the divine. It is also believed that the convergence of waters from the Bagmati River, Pashupati Jhal, and Guhyeshwari creates a powerful spiritual current called Triveni. Marked by a stone structure added to compensate for declining water levels, Brahma Nal remains an important spiritual site, closely linked to Pashupatinath and the cycle of life and rebirth.  (Baidhya S (2024, November 19).Insights on Brahma Naal [Interview with Chairman of Shree Pashupatinath Aryaghat Service Center].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/BrahmaNaal.jpg"
        ],
        "latlng": [27.71022, 85.34902],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Fifteen Shivalayas",
        "location": "Pashupati",
        "history": "The Pandra Shivalaya, a group of 15 shrines dedicated to Shiva, is located east of the Bagmati River, opposite the Pashupati cremation grounds. These stone temples feature bell-shaped roofs with metal finials, square sanctums open on all sides, and intricately carved stone archways (to Ranas) adorned with the mythical Chepu. Community involvement ensures their upkeep, with rituals conducted by local priests. Visiting hours are flexible, making it accessible to devotees and tourists alike.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/FifteenShiuvalayas.png"
        ],
        "latlng": [27.71019, 85.34927],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Ekadash Rudreshwar Temple",
        "location": "Pashupati",
        "history": "The Ekadash Rudreshwar Temple, located on the route from Aryaghat to Mrigasthali in the Pashupati area, is unique for housing 11 Shiva lingas on a single jalhari, symbolizing Shiva's 11 forms as described in ancient texts. This temple is constructed in hybrid structure blends Newari, Rajput, and Mughal architectural styles, featuring wooden doors and intricate carvings. Despite its historical and cultural significance, the temple remains in a deteriorated state after the 2015 earthquake, with cracks and water damage evident. Daily worship continues by Bhatta priests, but public access is restricted, and major rituals, including those for Shivaratri, have ceased. Conservation efforts are urgently needed to restore this architectural gem and preserve its rich heritage. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/EkadashRudreshwarTemple.png"
        ],
        "latlng": [27.70962, 85.34918],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Vishnu Temple (Ramchandra Temple)",
        "location": "Pashupati",
        "history": "The Rāmacandra Temple, also known as the Rāmaparivāra Temple, is a stone temple located north of the Laxminarayan Temple near the Bhasmeshwar Ghat in the Pashupati area. Built in the early 20th century, it features a metal finial, stone arches adorned with Chepu figures, and an ambulatory path around the sanctum. Inside, a marble statue of Lord Rāma is accompanied by Sita, Laxman, Hanuman, and his sons Lava and Kusha. A bell gifted by Prime Minister Bhim Shamsher in 1931 AD hangs at the northern gate. Managed by Brahmin students from a nearby ashram, the temple hosts daily worship and a grand celebration for Ram Nawami. This serene monument, blending cultural and historical significance, invites visitors to explore its rich heritage. (NHDP, n.d.) ",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/VishnuTemple(RamchandraMandir).JPG"
        ],
        "latlng": [27.70958, 85.34902],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Gorakhnath Temple",
        "location": "Pashupati",
        "history": "The Gorakhnath Temple, an iconic shikhara-style temple in Mirgasthali within the Pashupati area, enshrines the silver-covered paduka (feet) of Gorakhnath, a revered Nath yogi. Established by King Jayasthiti Malla in 1394 AD, the temple features intricately carved stone columns, a golden finial, and guardian deity niches representing Indra, Yama, Varuṇa, and Kubera. Daily rituals are conducted by Nath ascetics in Vedic and Tantric traditions, with special offerings on Sundays and Tuesdays. The temple is a hub for festivals like Goraksa Jayanti and Bala Chaturdashi and plays a key role in the annual Gosainkunda pilgrimage. Surrounding it are 15 Shivalayas, each showcasing remarkable craftsmanship. Unaffected by the 1934 AD earthquake, the temple has seen renovations, including contributions from royal and local patrons, reflecting its enduring cultural and spiritual significance. (NHDP, n.d.) ",
        "images": [],
        "latlng": [27.71047, 85.35149],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Visvarupa Temple",
        "location": "Pashupati",
        "history": "The Visvarupa Temple, Nepal's largest dome-style temple, stands in Mirgasthali near Pashupati area, housing a grand metallic statue of Visvarupa symbolizing Vishnu's cosmic form. Originally commissioned by King Pratap Malla in 1657 AD and relocated by Janga Bahadur Rana in 1863 AD, the statue blends Hindu and Buddhist symbolism, revered as Heruka or Avalokiteshwar by different communities. The temple features Anglo-Indian and Newar architecture, with four corner shrines dedicated to deities like Radha-Krishna and Shiva-Parvati, a Shree Yantra, and a historic Bhairava stone nearby. Severely damaged in the 2015 earthquake, the temple is under reconstruction. Special worship occurs biweekly and during the Dipankha Yatra. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/VisvarupaTemple.png"
        ],
        "latlng": [27.709, 85.35269],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Ganesh Temple",
        "location": "Pashupati",
        "history": "This 19th-century Ganesha statue, located along the stone-paved path connecting Arya Ghat and Guhyeshwari Temple, is a sacred site for devotees seeking blessings. Standing three cubits tall within a marble shrine, the four-armed Ganesha is adorned with oil and vermillion powder, alongside a stone symbolizing his mount, the shrew. Likely installed during, potentially in the Rana era, the pathway was paved and renovated by Sardar Ramakrishna Kunwar in 1868 AD. Worshipped daily by the priest of the nearby Rana Mukteshwar Temple, the statue attracts growing devotion, with offerings made for fulfilled wishes. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/GaneshMandir.jpg"
        ],
        "latlng": [27.70951, 85.35137],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Mrigasthali",
        "location": "Pashupati",
        "history": "Cross the footbridge to the eastern bank of the Bagmati River and enter Mrigasthali, a serene forest where Lord Shiva is believed to have lived as a deer, enchanted by its beauty. Dotted with numerous votive lingams, including the Pandra Shivalaya (Fifteen Abodes of Shiva), this site is a key pilgrimage destination for followers of the Nath tradition. Guru Gorakhnath is said to have meditated here in samadhi for 12 years. The forest holds mythological significance, especially during Bala Chaturdashi (Marga Krishna), when spreading grains is believed to honor ancestors and bring spiritual blessings. This sacred ritual is equivalent to donating gold, deepening the site's cultural and spiritual allure. (Pashupatinath A Guide to Sacred Journey, 2023)",
        "images": [27.71045, 85.35041],
        "latlng": [],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Kailash Hill",
        "location": "Pashupati",
        "history": "Kailash Hill, once part of the Shleshmantaka jungle, is a sacred hill spanning over 100 ropanis near the Bagmati River, separated from the forest by a natural shift in the river's course. Known as Mini Mount Kailash or Shiva Dham, it houses 9 Shiva Lingas and a Jyotirlinga, including the prominent Parvateshwar Shiva Linga at its center. According to a legend, Lord Shiva rested here while visiting the Pashupati area from Mount Kailash. The site hosts the Bala Chaturdashi mela in Mangsir (Nov-Dec) and facilitates Hindu rituals like Bratabandha (a Hindu ceremony that marks a boy’s transition into manhood and Homa (fire ritual in Hinduism) throughout the year. A Radha Krishna Temple lies to the east, and the Bishwo Shanti Sangha, established in 2016 B.S (1959 A.D), adds to its cultural significance. Revered for its resemblance to Devpatan, Shiva Lingas are said to be found beneath its grounds. (Pashupatinath A Guide to Sacred Journey, 2023)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/KailashHill.jpeg"
        ],
        "latlng": [27.71173, 85.3484],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Guhyeshwari Temple",
        "location": "Pashupati",
        "history": "Guhyeshwari Temple, east of Pashupatinath by the Bagmati River, is a revered Shakti Peetha, According to legend, this place is believed to mark where Goddess Sati's body parts fell. Built in the 17th century by King Pratap Malla, it is dedicated to Goddess Guhyeshwari, a form of Taleju Bhawani and the Shah Kings' family deity. The temple features tiered architecture with golden serpents on the roof and enshrines a kalasha (water jar) symbolizing the goddess. Devotees often visit it before Pashupatinath, honoring Shakti before Shiva. Rich in Tantric significance, it draws pilgrims for its sacred Bhairav Kunda pool and connection to Hindu mythology. Rituals and festivals like Mahashira worship are integral, with conservation efforts ongoing to preserve its spiritual and cultural legacy. (Guhyeshwari Temple, Nepal - Info, Timings, Photos, History, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Guheshwari.JPG"
        ],
        "latlng": [27.71112, 85.35332],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Kirateshwar Mahadev Temple",
        "location": "Pashupati",
        "history": "Kirateshwar Mahadev Temple, located in Mirgasthali near Pashupatinath, enshrines a tilted Shivaliṅga linked to Lord Shiva's legendary guise as a Kirat (hunter) in the Shleshmantaka jungle. Recognized as one of Nepal's 64 major Shivalingas, it is revered for fulfilling wishes and absolving sins. The temple's courtyard houses smaller Shivalingas, a Nandi statue, and a Trishul. Religious texts and local legends connect it to Arjuna from the Mahabharat and the Kirat community.In the Mahabharat, Arjuna, seeking divine guidance to enhance his archery skills before the Kurukshetra War, meditated in the Shleshmantaka jungle. Lord Shiva, disguised as a Kirat (hunter), appeared to test him. They both shot arrows at a boar, and after a dispute over who shot first, Arjuna realized the Kirat was Shiva. Impressed by Arjuna's humility, Shiva granted him the Pāśupatāstra, a powerful weapon for the upcoming war. Rituals like Bala Chaturdashi and Shivaratri draw devotees, while conservation efforts by figures like Purnachandra Maharaja ensure its legacy. It remains a vital spiritual hub for worship and cultural events. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Kirateshwar.png"
        ],
        "latlng": [27.71243, 85.34985],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Jaya Rudreshwar Temple",
        "location": "Pashupati",
        "history": "Jayarudreshwar Temple, built in 1815 AD by state officer Jaiphala Adhikari, lies west of the Gaurighat bridge near Pashupatinath. Featuring a square sanctum with a bell-shaped roof, it enshrines a Shivaliṅga named Jayarudreśvara, surrounded by deities like Vishnu, Ganesh, Bhagavatī, and Sūrya, reflecting the Shivapāñcāyana tradition. A Nandi statue guards its western entrance, while a rest house and Kāmadeva statue enhance its cultural ambiance. Known for rituals on Bala Chaturdashi, Shivaratri, and Rishi Panchami, Adhikari's contributions include the Gaurighat bridge, pathways, and a 48-ropani land trust for rituals and upkeep. Annual Bala Chaturdashi, Shivaratri, and Rishi Panchami ceremonies are conducted by an Acharya priest, with descendants participating in worship. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/JayaRudreshwarTemple.JPG"
        ],
        "latlng": [27.71307, 85.34966],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Gaurighat Satah",
        "location": "Pashupati",
        "history": "Located northeast of the Pashupati Temple, Gaurighat is a historically significant area featuring temples, shrines, and rest-houses (satah), including the three-story Gaurighat Satah, linked to Vajraghara and known for hosting rituals. Named after the sacred Gaurishila stone by the Bagmati River, the site also includes the nearby Jayanta Kumeda Satah and a Hanuman Shrine. Its architecture reflects Rana-era influences, with a bell donated by Mukhyani (Chief Queen) Vishnubhakta Kumari in 1888 AD. Renovated in 2013 by the Pashupati Area Development Trust, it survived the 2015 earthquake and continues to serve as a hub for cultural and religious activities. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/GaurighatSatah.JPG"
        ],
        "latlng": [27.71298, 85.34964],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Hanuman Shrine",
        "location": "Pashupati",
        "history": "The ŚākSita Hanumān statue at Gaurighat, believed to have been established by King Ranajita Malla (1722–1769 AD), depicts Hanuman seated on his left knee, granting blessings and protection through Varada and Abhaya mudra. Covered with layers of oil and orange powder applied by devotees, it is sheltered by a tin roof installed in 2019 with local support. Nearby are Shivaliṅgas and statues of deities like Lakshminarashimha, Garuda Narayana, and Vasudeva Kamalaja reflecting intricate 18th–19th century craftsmanship. Managed by an Acharya priest supported by the Pashupati Area Development Trust, the shrine sees devotees on Tuesdays, Saturdays, and festivals like Shivaratri and Hanuman Jayanti. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/HanumanShrine.JPG"
        ],
        "latlng": [27.71309, 85.34961],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Jayanta Kumedana satah",
        "location": "Pashupati",
        "history": "The riverside rest house (sataḥ) at  Gaurighat, overlooking the Bagmati River, is a key site for Shraddha rituals honoring ancestors. This two-story structure, credited to army officer Jayanta Kumedāna, features a gable roof and intricately carved latticed windows, adorned with images of mother goddesses. Built alongside the cremation ground (ghat) established in 1826 AD by Shivananda Vaidya, it underwent renovations in 1967 AD and now partly serves as a residence for an ascetic. Once a hub for Rishi Panchami ritual baths, its cultural practices have evolved. Visitors can admire its heritage and connection to Bagmati’s spiritual traditions. (NHDP, n.d.)",
        "images": [],
        "latlng": [27.71311, 85.34954],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Pacima Dhoka",
        "location": "Pashupati",
        "history": "The Pacima Dhoka also called Seto Dhoka, or \"White Gate,\" near Siphala Tole, once served as a major western entrance to the Pashupati Area before the construction of the Ring Road. Originally featuring a traditional dhvākhā design with a decorative arch, it now consists of two large brick pillars topped by a metal arch added during renovations in 2018 AD. This gate holds cultural significance during the annual Vatsaleshwari procession, where the goddess pauses at the gate for a ritual involving a fly whisk from Pashupatinath, symbolizing reconciliation. Reconstructed by Kathmandu Municipality in 1996 AD, the gate connects to Pashupatinath and other nearby heritage sites, embodying both historical and ritualistic importance. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/PashimaDhoka.JPG"
        ],
        "latlng": [27.71172, 85.34152],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Tamreshwar Temple",
        "location": "Pashupati",
        "history": "The Tamreshwar Temple, built in 1677 AD by Madhyeju in Navali Tole, is a two-tiered copper-roofed temple dedicated to a unique four-faced copper Shivaliṅga, symbolizing Tāmreśvara Mahādeva. Adorned with carvings of Shiva, Bhairava, and other deities, the temple reflects the Shiva Pāñcāyana tradition, with murals and statues inside its sanctum. Restored in 1990, the temple survived the 2015 earthquake unscathed. It plays a vital role in local festivals like Shivaratri and Dashain, where key processions, including those of Vajreśvarī and Gangamai, circumambulate the shrine. Additionally, devotees following the Salinadi bhrata and major rituals at Pashupatinath, such as priest appointments, include visits to this temple. Managed by the Sangata family and supported by local trusts, the site remains a hub of cultural and religious activity.  (Sangat S.k (2024, September 7). Insights on Tamreshwar Mandir [Interview with local culture expert].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Tamreshwar.jpg"
        ],
        "latlng": [27.71171, 85.34217],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Tole Ganesh Temple",
        "location": "Pashupati",
        "history": "The two-tiered Ganesh Temple in Navali Tole, Deopatan, features a gilded finial, simple struts, and an ornamental arch with a standing Ganesh figure at the entrance. Inside, a four-armed Ganesh statue seated in a princely pose serves as the main deity, complemented by a Vishnu statue on the eastern wall. Expanded in 1827 AD during King Rajendra Vikrama Shah's reign and renovated in 2000 AD by the Pashupati Area Development Trust, the temple is central to local rituals, with a woman from the Maharjan caste maintaining daily worship. Known as the Sthan ganesh of Navali Tole, it is visited before life events and rituals, with its annual ceremony held in Chaitra. A nearby stone ball inside the temple, Bhimasenako Gucca, is believed to bless those who lift it with a son, adding to the temple’s cultural lore.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/ToleGanesh.jpg"
        ],
        "latlng": [27.71102, 85.34293],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Mrityunjaya Mahadev",
        "location": "Pashupati",
        "history": "The Mrityunjaya Temple in Deopatan, Jaya Bageshwari, is a small yet spiritually significant temple dedicated to Lord Mrityunjaya, a form of Shiva believed to protect devotees from untimely death and offer liberation from life’s fears. This east-facing brick temple features a bell-shaped roof, a metal finial, and a sanctum housing a raised Shivaliṅga, with niches of other deities and a sacred Nandi statue outside. Known as the only Mrityunjaya Temple in Nepal, it draws devotees, particularly during Shivaratri, Indra Jātrā, and Śrāvaṇa Mondays. Although its origin is undocumented, the temple was rebuilt post-2015 earthquakes with local support. Managed by the community without a priest, the temple serves as a prayer site for health and peaceful transitions in life, emphasizing its cultural and spiritual value.(Sangat S.k ( 2024, September 7). Insights on Mrityunjaya Mahadev [Interview with local culture expert].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Mritunjaya.jpg"
        ],
        "latlng": [27.711, 85.34379],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Indreshwar Mahadev",
        "location": "Pashupati",
        "history": "The Indreśhwar Mahādeva Temple, west of Jaya Vagishwari Temple in Deopatan, is centered around a worn four-faced (caturmukhī) Shivaliṅga on high brick plinths, accessed by narrow stone steps. Though the original structure is lost, the plinths and steps hint at a grander medieval temple, with statues of Vishnu, Lakṣmī, and Umāmaheśvara nearby. The Pashupati Area Development Trust plans to reconstruct the temple, which was last renovated in 1996 AD. Managed by a local Kapālī family, the site hosts rituals and community bonfires during Shivaratri and remains a sacred destination during Dasaĩ, Tihāra, and other festivals.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/IndreshwarMahadev.jpeg"
        ],
        "latlng": [27.71055, 85.34343],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Trishul Satah",
        "location": "Pashupati",
        "history": "The Trishul  Sataḥ, located in Jayavāgeśvarī Tole, plays a pivotal role in the annual Trishul Jatra (trident festival), celebrated on the 8th of the dark fortnight of Āṣāḍha. The structure, rebuilt by the Nepal Army in 1996 AD, houses chariots used during the festival. With simple lattice windows, an iron-sheet roof, and open sides, the building has four ground-floor bays and upper-floor living spaces. Local legends link the festival to a myth of a demon who kidnapped children, with tantric rituals and tridents used to deter such demons. The site is key to local traditions and an important stop during the festival. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/TrishulSatah.JPG"
        ],
        "latlng": [27.71044, 85.34366],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Jaladya Satah",
        "location": "Pashupati",
        "history": "Jaladyaḥ Sataḥ, located northwest of the Jaya Vagishwari Temple, is a unique arcaded rest house and performance venue for the NavaDurga dancers from Bhaktapur and the mask dancers from Harisiddhi. This two-story structure, with a corrugated metal roof and intricately carved wooden columns, serves as a resting place for these ritual groups during performances in the Pashupati Area. Though lacking a deity statue, it has become a hub for local cultural activities, managed by the Jayabāgeśvarī Yūvā Klaba since 2007 AD. The building was reconstructed by the Pashupati Area Development Trust in 2002 AD and continues to serve the community with social initiatives like blood donation drives and health camps. (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/JaladyaSatah.JPG"
        ],
        "latlng": [27.7106, 85.34368],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Lu Hiti",
        "location": "Pashupati",
        "history": "Lũ Hiti, or the \"golden spout,\" northwest of Jaya Vagishwari Temple in Deopatan, is a historic Licchavi-era water spout, renowned for its gilded cover and two flanking shikhara-style temples dedicated to Lakṣmīnārāyaṇa and Dhanvantarī. Restored in 1387 AD by King Jayasthiti Malla, it channels water for temple rituals and features artifacts like a 13th-century Sūrya statue. Local legend links the spout to Lake Manasarovar, fulfilling Goddess Jaya Vagishwari’s divine wish. Unique for housing Nepal's only Dhanvantarī idol, the site reflects deep cultural significance. Despite renovations, including one in 2020 CE, the water flow has ceased, with alternative sources now used. Accessible year-round, it remains a vital link to Nepal’s sacred heritage.(Baidhya  M.R (2024, October 7). Insights on Luhiti [Interview with a local culture expert].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/Luhiti.jpg"
        ],
        "latlng": [27.71057, 85.3439],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Sridhar Vishnudevala",
        "location": "Pashupati",
        "history": "The Śrīdhara Vishnu Shrine, a small brick dome-shaped structure north of Lu Hiti, houses a medieval statue of Sridhar Vishnu with his consort Laxmi and mount Garuda. A Shivalinga, installed by the Vaidya family in 2003 CE, stands in front of the shrine, and a nearby jvālāvalī chaitya dates back to 1831 AD. Originally a private family shrine, it remains under the care of the Vaidya family, who perform daily rituals, annual worship during the full moon of Vaiśākha, and regular maintenance. Though modest, this shrine reflects a rich legacy of family devotion and architectural harmony.(NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/SridharVishnudevala.jpg"
        ],
        "latlng": [27.7106, 85.344],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Surya Temple",
        "location": "Pashupati",
        "history": "The Surya Temple, west of Jaya Vagishwari Temple and south of Lu Hiti, is a unique stone temple designed as a chariot pulled by horses, dedicated to Suryanarayan, the sun deity. Built around 1604 AD, the shikhara-style temple features intricate carvings of goddesses, an ornate arch, lion statues, and five stone horses on its northern plinth. After the theft of the original statue, a new one was installed, with worship now conducted by the priest of Jaya Vagishwari Temple. Nearby shrines include a four-faced Shivaliṅga and an empty Caturvyuha Narayana shrine. This temple showcases historical artistry and remains integral to local rituals and cultural preservation.(NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/SuryaTemple.jpeg"
        ],
        "latlng": [27.71043, 85.34392],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Jaya Vagishwari Temple",
        "location": "Pashupati",
        "history": "The Jaya Vagishwari Temple, located in Deopatan near Pashupatinath, is a revered shrine dedicated to the goddess Jaya Vagishwari, one of nine deities protecting Pashupatinath. This three-tiered medieval temple features ornate struts and (arch) adorned with Mahakali, Mahalaxmi, and Mahasaraswati. Rich in legends, it is believed the goddess aided Devapattan during an invasion and traveled from Tibet’s Mansarovar to heal locals. Unique traditions, such as the Mahadev-Parvati dance and Nava Durga rituals, highlight its cultural vitality. Sacred ceremonies like the annual Baisakh Purnima Puja and drought-invoking rituals at the Homa Kunda further enrich its spiritual significance. Recent renovations post-2015 earthquake preserved ancient elements, ensuring its legacy endures. Nearby attractions include Lu Hiti and Pashupatinath Temple. Visitors are welcome during daylight hours. .(Vaidya  M.R (2024, October). Insights on Jaya Vagishwari Temple [Interview with a local culture expert].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/JayaVagishwari.JPG"
        ],
        "latlng": [27.71029, 85.34401],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": [
          "https://www.youtube.com/watch?v=0DwvfRHaPVc&list=PLmTt9hYZOATCDBNYEMfV9ZtajgAD5zIeT"
        ]
      },
      {
        "name": "Matsyendra Ganesh Temple",
        "location": "Pashupati",
        "history": "The Matsyendra Ganesh Temple, located east of Jaya Vagishwari Temple in Patan, is a historic two-tiered temple believed to predate the Bunga dyah chariot festival. Initially housed in a Phalcha (shelter), the deity MatsyendraGanesh was later enshrined in this west-facing temple with intricate struts depicting Ashta Matrika deities and an oblong banner hanging from its gilded finial. The four-armed Ganesh statue, seated in lalitāsana, holds a garland, radish, axe, and sweetmeats, flanked by Bala Ganesh and disciples. Local legend ties this Ganesh to rituals preceding the Bunga dyah festival, with holy water from the temple used for the deity’s ceremonial bathing. Reconstructed in 2011, the temple's daily rituals, including the Panch Bali sacrifice, are maintained by local residents and supported by the Guthi Sansthan. This serene site offers a glimpse into ancient traditions and its connection to nearby sacred sites like Jaya Vagishwari.(Baidhya  M.R (2024, September 7). Insights on Matsyendra ganesh temple [Interview with a local culture expert].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/MatsyendraGanesh.JPG"
        ],
        "latlng": [27.7104, 85.3444],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Vaidya Phalcha",
        "location": "Pashupati",
        "history": "The Dathu Tole Phalcha, located east of the Jaya Vagishwari temple in Jaya Bageshwori, holds historical significance as a central gathering spot for the settlement. Built by the Vaidya community and later reconstructed in 1992 AD by the Pashupatinath Development Trust, the south-facing Phalcha is flanked by the Matsyendra Ganesh Temple and Napit Phalcha, symbolizing diverse community contributions. Once larger in size, road widening reduced its dimensions. Today, it houses the Jaya Vagishwari Tole Sudhar Samiti office, ensuring its upkeep. While it no longer hosts social or cultural events, its connection to nearby sacred sites and past traditions makes it a noteworthy landmark. (NHDP, n.d.)",
        "images": [],
        "latlng": [27.71043, 85.34445],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Laliteshwar Temple",
        "location": "Pashupati",
        "history": "The Laliteshwar Temple, built in the 18th or 19th century, enshrines a unique four-faced Shivalinga as Laliteshwar, symbolizing Lord Shiva. Located east of Jaya Vagishwari Temple near the Ring Road, the west-facing temple features a bell-shaped roof, intricately carved statues of Uma Mahesvara, and a sacred Nandi pillar. Nearby, the historic Tri-Bhima Dhara water tap, installed in 1931 AD, and a Jahdhum tank enhance its cultural significance. Renovated by the Pashupati Area Development Trust in 2002, the temple fosters community involvement, with a local resident maintaining rituals and women offering prayers on Shrawan Mondays.  (NHDP, n.d.)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/LaliteshwarMandir.JPG"
        ],
        "latlng": [27.71034, 85.34449],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      },
      {
        "name": "Balkumari Temple",
        "location": "Pashupati",
        "history": "The Balkumari Temple, dating back to 1682 AD, is a charming west-facing temple in Deopatan, lending its name to Balkumari Tole. This small but sacred site houses Balkumari seated on a peacock, alongside statues of an 18-armed Durga and Ganesh, all adorned with intricate carvings and a stone to Rana. Local lore tells of Balkumari being bound to prevent her from leaving the temple, emphasizing her importance to the community. Maintained daily by residents, the temple features prominently in the annual Vatsaleshwari procession. Conveniently located near Jaya Vagishwari Temple, it offers a peek into the area’s vibrant religious history and local traditions.\nAt Balkumari Mandir, there has been a tradition from ancient times where beautiful children come out to perform dances. They also walk around (parikrama) the Pashupatinath temple, and this still happens today. Near the temple, there is a structure called \"Ittapakha,\" which is located above it. From there, one can see Pashupatinath, and it aligns perfectly with Ishankunth. (Bhandari K.M (2024, November 27). Insights on Balkumari Temple[Interview with the  priest of Pashupatinath].)",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Pashupati/BalkumariTemple .JPG"
        ],
        "latlng": [27.71041, 85.34467],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": []
      }
    ],
    "droneView": null,
    "model": null,
    "virtualTour": "https://virtualtour.airliftventures.com/pashupatinath-temple/",
    "videos": [
      "https://www.youtube.com/watch?v=VTLDCM6bMio&list=PLmTt9hYZOATBi87Ysj1Ak2-pcW9b0FV3I"
    ]
  },
  {
    "name": "Bouddha",
    "location": "Kathmandu",
    "history": "Boudha Stupa, a UNESCO World Heritage Site, stands as a blend of Newar, Tamang, Sherpa, and Tibetan cultures, making it a unique symbol of the rich cultural and spiritual diversity of the Kathmandu Valley. Located in the northeastern part of Kathmandu, this massive stupa is one of the largest in the world and serves as a major pilgrimage site for Buddhists from different traditions. The stupa's grand dome, adorned with the Buddha's all-seeing eyes, reflects the region's deep Buddhist heritage. Surrounding the stupa are numerous monasteries, shrines, and shops, creating a lively atmosphere where local traditions and rituals thrive. The area is especially significant during major Buddhist festivals like Buddha Jayanti and the Boudha Stupa Jatra, when devotees from diverse communities come together to celebrate and perform rituals. The cultural richness of Boudha makes it not only a religious hub but also a cultural crossroads, offering visitors a glimpse into the harmonious blending of various Buddhist traditions.\nHistory\nBoudha Stupa is one of the largest and most significant Buddhist sites in Nepal. Its origin remains unclear, with various historical sources offering different accounts. According to Nepalese records, the stupa was constructed during the Licchavi period. Gopal Raj Vansavali, a historical chronicle, credits King Shiva Dev with the construction of the stupa, while Mary Slusser suggests that King Mandeva may have been involved in its initial erection, with Shiva Dev later renovating it. Tibetan sources associate Boudha with King Songtsen Gampo, who is believed to have initiated the establishment of Buddhist temples, including the one at Boudha. After the Chinese occupation of Tibet in 1959, Boudha became a key center for Tibetan exiles, significantly contributing to its religious and cultural development.\n\nLegends of Boudha Stupa\n1. Kathmandu Legend: A prominent legend associated with the Boudha Stupa originates from Kathmandu during the Licchavi period. According to the story, King Dharmadev constructed a stone spout near his palace, but it mysteriously dried up, causing a severe drought in the kingdom. Distressed, the king consulted astrologers, who advised him to perform a human sacrifice to bring an end to the drought. They instructed the king to sacrifice someone who possessed all thirty-two virtues, a rare attribute. After an extensive search, it was discovered that only the king and his son, Manadeva, possessed these virtues.\nReluctant to sacrifice his son, the king decided to offer his own life and instructed Manadeva to decapitate a hooded stranger at the stone spout the next morning. However, when Manadeva returned to the palace, he realized, to his horror, that he had unwittingly killed his father. Filled with grief and guilt, Manadeva renounced the throne and chose to live a life of seclusion.\nAs time passed, the kingdom continued to suffer from the drought. In his despair, Manadeva had a vision in which Vajra Yogini appeared to him, instructing him to release a bird and build a stupa at the spot where the bird landed. Following this vision, Manadeva released a bird, and it landed at the site of what would become the Boudha Stupa. The construction of the stupa was difficult due to a lack of water to mix the clay. However, the laborers ingeniously collected dew using large sheets of cloth, which allowed them to complete the stupa. The use of dew, known as \"khasu ti\" in Nepal Bhasa, led to the stupa being named Khasu Ti Chaitya, a name that later evolved into Khasti Chaitya.\n2. Tibetan Legend: A different, yet equally significant, legend comes from Tibetan Buddhism. According to this account, Avalokitesvara, the Bodhisattva of Compassion, had vowed to release all sentient beings from suffering. After years of efforts, Avalokitesvara looked down from his palace, only to find that many beings continued to suffer, despite his best efforts. Overcome by despair, Avalokitesvara wept, and his tears fell to the ground. These teardrops were believed to have transformed into the daughters of Indra, the king of the gods.\nOne of these daughters, Apurna, was born as a human named Jadzima, into a humble family. As she grew up, Jadzima worked hard to support her children and eventually saved enough money to fulfill a noble aspiration—to build a grand stupa that would help alleviate suffering. Despite opposition from the local nobility, who were jealous of her plans, the king granted her permission to build the stupa. The stupa came to be known as \"Jharung Khasor,\" meaning \"permission to build,\" symbolizing the king’s approval despite the resistance from the powerful elites. This stupa, built with the intention to end suffering, continues to serve as a significant religious and cultural landmark.",
    "images": [
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/BoudhaStupa.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/BoudhaStupa1.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/AjimaTemple1.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/AjimaTemple.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/GhyoiLisangPond.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/JhamchenLakhangMonastery1.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/JhamchenLakhangMonastery.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/ThranguMonastery.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/GuruLakhangMonastery.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/ThranguMonastery.JPG"
    ],
    "latlng": [27.72139, 85.36201],
    "monuments": [
      {
        "name": "Ajima Temple",
        "location": "Bouddha",
        "history": "The Ajima Temple, located near Boudha Stupa, is a small, single-room structure with a copper roof and ceramic walls, featuring a steel lattice screen at its entrance. Inside, it holds a silver deity, often covered with cloth, depicted sitting with a human corpse on her lap. Above her, she is shown in a fierce pose, holding the same corpse. This deity, known by different names across communities, is seen as a protective goddess. In Tibetan Buddhism, she is referred to as Jadzima, while Newars call her Ajima, meaning \"Grandmother.\" Hindus may associate her with deities like Sitala or Chamunda, fierce figures often depicted consuming corpses. Though considered wrathful, Ajima is seen as a protector, granting power to her devotees. The temple's origins and interpretations vary, with some connecting her to Hariti, a demoness who later became a protector of Buddha's shrines.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/AjimaTemple1.png",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/AjimaTemple.png"
        ],
        "latlng": [27.72187, 85.36205],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": [
          "https://www.youtube.com/watch?v=NLzhmuTe2K4&list=PLmTt9hYZOATBi87Ysj1Ak2-pcW9b0FV3I"
        ]
      },
      {
        "name": "Ghyoi Lisang Pond (Peace Park)",
        "location": "Bouddha",
        "history": "Ghyoilisang Pond, now known as Peace Park, is located northwest of Boudha Stupa and covers an area of 15,289.80 sq. ft. Historically, it is believed that soil from the Boudha Stupa construction site was removed, gradually forming the pond. In recent years, the site has been transformed into Peace Park, a place of spiritual and cultural significance. In 2073 B.S., a statue of Guru Rinpochhe was placed at the center of the pond, and additional monuments, including chaityas and deity statues, have been added. The Peace Park now offers a tranquil space blending natural beauty with spiritual heritage.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/GhyoiLisangPond.png"
        ],
        "latlng": [27.72232, 85.36146],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Jamchen Monastery",
        "location": "Bouddha",
        "history": "Jamchen Monastery, located in the Boudha Stupa area, is the first monastery encountered when circling the stupa from the main gate. It belongs to the Sakyapa school of Himalayan Buddhism and is also known as Mustang Monastery, as it was funded by the Raja (King) of Mustang. The monastery was constructed starting in 1982 on land donated by the niece of the late Chini Lama. A three-story statue of Jampa (Maitreya or Future Buddha) is housed inside. The monastery's grand inauguration in 1986 was attended by former King Birendra of Nepal and unexpectedly honored by former U.S. President Jimmy Carter. According to some sources, it was founded by Venerable Chyopge Thichen Rinpoche and enshrines a statue of Trik Ma Buddha  (Gyalwa Jampa).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/JhamchenLakhangMonastery1.JPG",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/JhamchenLakhangMonastery.JPG"
        ],
        "latlng": [27.72143, 85.36112],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Guru Lhakhang Monastery",
        "location": "Bouddha",
        "history": "The Guru Lhakhang Monastery is a significant spiritual site of the Nyingma tradition. Located to the north of the stupa, this monastery, also referred to by locals as the \"Tamang Gumba\", is the oldest in the area adhering to the Nyingma and Jhyang Ter traditions. Within its sacred space are enshrined revered statues of Amitabha Buddha, Arya Avalokiteshvara, Guru Padmasambhava, and other prominent figures of Himalayan Buddhism. Visitors to the monastery can enjoy a breathtaking view of the majestic Boudha Stupa from its rooftop, adding to the monastery's spiritual and visual appeal.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Bouddha/GuruLakhangMonastery.png"
        ],
        "latlng": [27.72201, 85.36209],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Kyidong Tashi Samteling Monastery",
        "location": "Bouddha",
        "history": "Kyidong Tashi Samtenling Monastery, located near Boudha Stupa in Kathmandu, is the first Tibetan monastery established in the area after the Tibetan upheaval of 1960. It serves as a spiritual center, dedicated to preserving Tibetan traditions, rituals, and teachings. The monastery focuses on the tantric practices of the Geluk tradition, emphasizing rituals related to the three main tantric deities. It is known for its preservation of monastic arts, including ritual decoration, chanting, religious music, and tantric ceremonies. The monastery also provides modern education for its younger monks, offering courses in moral education and languages. It currently houses hundreds of monks, many from Tibet and Nepal’s remote regions like Rasuwa, Manang, and areas with Sherpa and Tamang communities.",
        "images": [],
        "latlng": [27.72165, 85.36299],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Dilyak Yevam (1000 Buddha's Monastery) (Palri Tashi Migyur Dorje Gyaltsen Ling)",
        "location": "Bouddha",
        "history": "Located to the north-east of the Boudha Stupa, on the way to Phulbari, Dilyak Yevam Monastery, also known as Dhapsang Monastery, was founded by Venerable Rinpoche Dazang Ngeden Chhoeki Ngima Palsangpo in 1966 A.D. It follows the Kagyu tradition of Himalayan Buddhism and is renowned for housing statues of a thousand Buddhas. Regular Dharma rituals are performed daily, ensuring the continuation of spiritual practices for the community.",
        "images": [],
        "latlng": [27.72189, 85.36249],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Thrangu monastery",
        "location": "Bouddha",
        "history": "Thrangu Tashi Choling Monastery, located near the Great Stupa of Boudha, was founded by Thrangu Rinpoche in 1979. Initially envisioned as a library and later a shedra (Buddhist educational institute), the monastery gradually expanded to accommodate the growing number of monks. Today, it is home to approximately 80 monks, including staff and young monks aged 7-18 who receive both secular education and training in Buddhist rituals and philosophies.\nThe monastery holds special prayers on auspicious dates according to the Tibetan lunar calendar and fulfills prayer requests within the monastery or at devotees’ homes. Its monks later advance to higher Buddhist studies at the Vajra Vidya Institute Shedra or engage in the intensive year-long \"Ngondro\" preliminary practice at Namo Buddha. Thrangu Tashi Choling serves as a vital center for spiritual training and community rituals, reflecting its deep connection to the Buddhist heritage of the region.",
        "images": [],
        "latlng": [27.72269, 85.36186],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      }
    ],
    "droneView": null,
    "model": null,
    "virtualTour": null,
    "videos": [
      "https://www.youtube.com/watch?v=VTLDCM6bMio&list=PLmTt9hYZOATBi87Ysj1Ak2-pcW9b0FV3I"
    ]
  },
  {
    "name": "Swoyambhu Mahachaitya",
    "location": "Kathmandu",
    "history": "The Swoyambhu Stupa is situated to the northwest of Kathmandu, atop a green hill known by various names: 'Gau Puche Parbat', 'Padmagiri' and 'Vajrakutta Parbat'. Nearby is Manjushree Hill, also referred to as 'Gau Singhe Parbat'. These hills are named 'Gau Singhe' and 'Gau Puche' because, from Nagarjun Hill, their shapes resemble a cow. Manjushree Hill appears as a cow's horn, while Swoyambhu Hill resembles the cow's tail.\nThe Swoyambhu Stupa, estimated to be over 1,500 years old, is a highly revered landmark in the Kathmandu Valley. The term 'Swoyambhu' in Nepal Bhasa translates to 'self-sprung' or 'self-manifested'. The most common route to the summit involves climbing 365 steps from the front entrance. Alternatively, the rear entrance, accessible by car or scooter, requires only a few steps to reach the top. The site’s integration of Hindu and Buddhist elements creates a distinctive and harmonious fusion of traditions that is seldom encountered elsewhere. (Buddhacharya, A. M. (2024, June 13). Insights on Swoyambhu Stupa [Interview with a local cultural expert].)\n● Mythology of Swoyambhu\nAccording to the Swoyambhu Purana, the Kathmandu Valley was once a vast and beautiful lake. When Vipaswi Buddha arrived, he planted a lotus seed at the site where the Swoyambhu Stupa now stands. The seed grew into a magnificent lotus with a thousand petals, its radiant light was visible from afar and drawing many pilgrims. Due to its luminous quality, the site came to be known as Jyoti Chaitya or Ratna Chaitya.\nImpressed by the divine light of the lotus, Manjushri believed that draining the lake would make the site more accessible to human pilgrims. Using his great sword, he carved a gorge in the surrounding mountains, allowing the water to drain and revealing the valley that is now Kathmandu. As the lake dried up, the lotus emerged on the hill, which eventually became the location of the Swoyambhu Stupa.\nMany years later, Shantikaracharya, who came to Nepal on pilgrimage, recognized the need to preserve this sacred light. To honor and protect the spot where the lotus had once bloomed, he is believed to have constructed the stupa. (Buddhacharya, A. M. (2024, June 13). Insights on Swoyambhu Stupa [Interview with a local cultural expert].)\n● History of Swoyambhu\nAccording to the Gopal Raj Vamsavali, a 14th-century manuscript from Nepal, the Swoyambhu Stupa was established by King Vrsadeva, the great-grandfather of King Manadeva (464–505 CE), during the Licchavi period in the early 5th century CE. This is supported by a damaged stone inscription at the site, which records that King Manadeva commissioned further work in 640 CE. Additionally, Emperor Ashoka is believed to have visited the site in the 3rd century BCE and constructed an early temple, which subsequently fell into disrepair for reasons that remain unknown. In 1349, during the first Muslim invasion of Kathmandu, the Swoyambhu Stupa was completely destroyed. It was subsequently repaired. Following the construction of the main stupa, additional monuments were added over time by various dynasties. The eastern stairway was built in the 17th century by King Pratap Malla, a prominent ruler of Kathmandu. (Vredeveld, n.d.)\nIn 1918 CE, with authorization from the Nepalese government, the 14th major renovation of Sri Swoyambhu Mahachaitya was undertaken. This restoration involved replacing the harmika and repairing the 13 bronze disks. The work was completed over a period of three years, finishing in 1921 CE. (Tuladhar, 2021)\nThe 15th renovation of Sri Swoyambhu MahaChaitya occurred between 2008 and 2010, resembling a massive jigsaw puzzle. Over 30,000 pieces were carefully removed, repaired, cleaned, and reassembled using more than 100,000 nails. Additionally, all the metal plates received a fresh layer of gold, utilizing 20 kg of the precious metal is one of the largest gold restoration projects ever undertaken. (Parashar, 2010)\n\n● Buddhacharya Family\nThe Buddhacharya family descends from four legendary brothers tasked with preserving the traditions, norms, and values of Swoyambhu, as designated by Shantikar Acharya. The community is divided into four lineages—referred to as \"KA: WA:\"—which trace their roots back to these brothers, who established the clan centuries ago. Together, these lineages encompass 30 families, each representing the legacy of one of the four brothers. Each group has its own leader, guiding their members in honoring their shared heritage. (Buddhacharya et al., 2019)",
    "images": [
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/swoyambhunath3.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/swoyambhunath1.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/swayambhunath2.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AmitabhaBuddha.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/RatnasambhavaBuddha.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AmoghashidhiBuddha.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AkshyobhaBuddha.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VairochanaBuddha.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VajradhatiTara.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/SaptalochaniTara.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/MaamakiTara.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PadhmaniTara.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AaryaTara.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DharmadhatuMandala.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Pratappur.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Anantapur.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/10thShamarpaBell.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PavanBhairav.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/HaratiMaa.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/vayupur.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Agnipur.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Nagpur.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Basundhara.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Shantipur.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/BahuMangaldwarChaitya.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DevAvatar.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/ChaturmukhiChaitya.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Sundial.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/RamyankuttaChaitya.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Sakhwaga.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AgamChhen.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Yogamvar.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DharmaGranthiBhairab.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Birupakshya.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/akshobhyaBuddha.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AkshyobhaBuddha.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/HariHariHariVahanaLokeshvara.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VasubhanduMemorialChaitya.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PulaunSyangu.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/BhagwanPau.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/WorldPeacePond.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/JanmaDwar.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/GyanmalaBhajanSattal.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/5SymbolicStatue.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/ManjushreePaduka.png",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/JyotiKritiMahabihar.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/SamhyanguMahabihar.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/KarmaRajaMahabihar.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DevaDharmaMahabihar.jpg",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/GroupofChaitya.JPG",
      "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AnandakutiMahabihar.jpg"
    ],
    "latlng": [27.714918, 85.29055599999998],
    "monuments": [
      {
        "name": "Amitabha Buddha",
        "location": "Swoyambhu Mahachaitya",
        "history": "Amitabha Buddha, one of the Five Dhyani Buddhas, represents the cosmic element of fire and is situated facing west within the stupa. Depicted in red, Amitabha embodies the purified form of desire and is commonly symbolized by a peacock. The peacock, which consumes poisonous plants yet reveals a vibrant and radiant tail, represents Amitabha Buddha’s power to alleviate suffering and transform negativity into enlightenment.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AmitabhaBuddha.png"
        ],
        "latlng": [27.714945, 85.29026199999998],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AmitabhaBuddha.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/igvQtV3on80"]
      },
      {
        "name": "Ratnasambhava Buddha",
        "location": "Swoyambhu Mahachaitya",
        "history": "Ratna Sambhava Buddha, one of the Five Dhyani Buddhas, represents the cosmic element of earth and is situated on the southern side of the stupa. Depicted in yellow, he performs the Varada Mudra with his right hand, symbolizing the granting of wishes, while holding a Cintamani jewel in his left hand, which rests on his lap. Seated on a horse throne, Ratna Sambhava Buddha embodies dynamic energy and the capacity to assist beings with great vigor, representing the purified form of pride.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/RatnasambhavaBuddha.png"
        ],
        "latlng": [27.714817, 85.290369],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/RatnasambhavaBuddha.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/5041bVnzqdg"]
      },
      {
        "name": "Amoghasiddhi Buddha",
        "location": "Swoyambhu Mahachaitya",
        "history": "Amoghasiddhi Buddha, one of the Five Dhyani Buddhas, represents the cosmic element of air and is depicted in green, facing north within the stupa. He is symbolized by the Garuda, which signifies his ability to perceive and transcend delusions from a distance. Performing the Abhaya Mudra, Amoghasiddhi Buddha embodies fearlessness. He is also depicted with a canopy of snakes above his head.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AmoghashidhiBuddha.png"
        ],
        "latlng": [27.715036, 85.290393],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AmoghashidhiBuddha.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/0HOKoOPh8Ew"]
      },
      {
        "name": "Aksobhya Buddha",
        "location": "Swoyambhu Mahachaitya",
        "history": "Akshobhya Buddha, one of the Five Buddhas, represents the cosmic element of water and is positioned on the eastern side of the stupa. Depicted in blue, he performs the Earth-touching gesture known as Bhu Sparsha Mudra. Seated on an elephant throne, Akshobhya Buddha symbolizes his unwavering commitment to his Bodhisattva vows. ",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AkshyobhaBuddha.png"
        ],
        "latlng": [27.714905, 85.29051800000002],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AkshobhyaBuddha.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/AKbus-h8Gf4"]
      },
      {
        "name": "Vairochana Buddha",
        "location": "Swoyambhu Mahachaitya",
        "history": "Vairochana Buddha, one of the Five Buddhas, represents the cosmic element of ether. While he is usually enshrined in the sanctum of a stupa, at Swoyambhu, Vairochana Buddha is situated between Akshobhya and Ratnasambhava. Depicted in white, he holds his hands in front of his chest, with the tips of his thumb and forefinger touching, in a gesture known as the Bodhyanga mudra or Dharma Chakra Parvartana Mudra. His symbol is a lion, embodying the powerful roar of wisdom that dispels ignorance. ",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VairochanaBuddha.png"
        ],
        "latlng": [27.714949, 85.29051800000002],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/VairochanaBuddha.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/oR4Gp4PRFEI"]
      },
      {
        "name": "Vajradhatesvari Tara",
        "location": "Swoyambhu Mahachaitya",
        "history": "The four Taras originate from Vajradhatesvari, who resides in the central east section of the chaitya in an unadorned stone shrine, symbolizing emptiness (Sunyata). She is also the female consort of Vairochana Buddha.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VajradhatiTara.png"
        ],
        "latlng": [27.714875, 85.29050799999999],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/VajradhatiTara.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/9c9xxTg4AvU"]
      },
      {
        "name": "Saptalochani Tara",
        "location": "Swoyambhu Mahachaitya",
        "history": "Saptalochani Tara is a vital guardian of Vajrayana teachings, especially the termas and inner tantras. She is located in the southeast corner of the stupa and is depicted in blue. Additionally, she is the female consort of Aksobhya Buddha.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/SaptalochaniTara.jpg"
        ],
        "latlng": [27.714995, 85.29049299999997],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/SaptalochaniTara.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/nnqFuDu9HdI"]
      },
      {
        "name": "Mamaki Tara",
        "location": "Swoyambhu Mahachaitya",
        "history": "Mamaki is the guardian of secret mantras and is esteemed as \"the mother of all living beings in the universe,\" with her own powerful mantra remaining concealed. Positioned in the stupa's northeast corner and depicted in yellow, she is the female consort of Ratna Sambhava.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/MaamakiTara.JPG"
        ],
        "latlng": [27.714833, 85.29047000000003],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/MaamakiTara.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/wA3EGj1YwsM"]
      },
      {
        "name": "Padmini Tara",
        "location": "Swoyambhu Mahachaitya",
        "history": "Padmini is revered for her ability to resolve love-related difficulties and  is believed to captivate both men and women. Reciting her mantra 10,000 times is said to fulfill desires. Positioned in the stupa's southwest corner and depicted in red, she is the female consort of Amitabha Buddha.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PadhmaniTara.jpg"
        ],
        "latlng": [27.714848, 85.290303],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/PadhmaniTara.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/RCMpOezttTE"]
      },
      {
        "name": "Arya Tara",
        "location": "Swoyambhu Mahachaitya",
        "history": "Arya Tara, depicted in green, is a compassionate figure often shown seated on a lotus throne, ready to offer comfort and protection. Positioned on the northwest side of the stupa, she holds closed blue lotuses, symbolizing purity and power. Arya Tara is also the female consort of Amoghsiddhi.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AaryaTara.png"
        ],
        "latlng": [27.715004, 85.2903],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AaryaTara.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/JR7a5HqyUwg"]
      },
      {
        "name": "Harmika",
        "location": "Swoyambhu Mahachaitya",
        "history": "It is the cubical structure above the dome. Where there are eyes on each side with a Buddhism symbol for infinite continuity in search of Nirvana. These eyes are symbolic of God’s all-seeing perspective. Between the eyes, there is no nose but a symbol of the Nepali number one, representing the singular path to enlightenment through Buddhism.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
        ],
        "latlng": [27.714921, 85.29039],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Halla Paau / Hallapati",
        "location": "Swoyambhu Mahachaitya",
        "history": "The Halla Paau is a pentagonal structure featuring figures of the Five Buddha Family, each in unique postures, arranged at the four cardinal directions.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/halla_paau.png"
        ],
        "latlng": [27.714921, 85.29039],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Pataka (Wooden Pillar)",
        "location": "Swoyambhu Mahachaitya",
        "history": "The hidden wooden pillars are made from a unique type of wood found near the Swoyambhu hills. This pillar is encased within the 13 Bhumi.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
        ],
        "latlng": [27.714921, 85.29039],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Triyodasha Bhuvana / Thirteen rings",
        "location": "Swoyambhu Mahachaitya",
        "history": "Above the Harmika, thirteen tiers of tapering circular rings represent the thirteen heavens or the Bodhisattvas' achievements. Made of wood and supported by wooden pillars, these rings are suspended without touching the central pillar, which is now gilded in gold.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
        ],
        "latlng": [27.714921, 85.29039],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Mani (Crystal jewel)",
        "location": "Swoyambhu Mahachaitya",
        "history": "Above the Triyodasha Bhuvana is a hidden crystal jewel, or mani, discovered by two Newar sisters from Patan on the eastern stairway to Swoyambhu, where it was initially covered in cow dung. After one sister suggested taking it home, the jewel fell, prompting them to return it to Swoyambhu.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
        ],
        "latlng": [27.714921, 85.29039],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Utnish Pinnacle",
        "location": "Swoyambhu Mahachaitya",
        "history": "The uppermost part of the stupa is the Utnish, a pinnacle crowned with an umbrella adorned with tassels, which gives the stupa its unique and distinctive feature.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/spart.jpg"
        ],
        "latlng": [27.714921, 85.29039],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Dharmadhatu Vajradhatu Mandala",
        "location": "Swoyambhu Mahachaitya",
        "history": "At the top of the eastern staircase stands an impressive golden vajra, positioned on the eastern side of the main stupa. Locally known as the VajraDhatu Mandala and also referred to as the DharmaDhatu Mandala, this mandala features twelve animals that symbolize the astrological cycle.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DharmadhatuMandala.JPG"
        ],
        "latlng": [27.7149, 85.29053699999997],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Pratappur",
        "location": "Swoyambhu Mahachaitya",
        "history": "Pratappur is situated on the north eastern side of the main Swoyambhu stupa, built in the name of King Pratap Malla himself in N.S 775. It was destroyed by fire in August 2003, struck by lightning in February 2011, and damaged in the 2015 earthquake. Rebuilt with government support, it was completed in 2019.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Pratappur.JPG"
        ],
        "latlng": [27.714978, 85.29057899999998],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/Ul5TRhOLbC4"]
      },
      {
        "name": "Anantapur",
        "location": "Swoyambhu Mahachaitya",
        "history": "Anantapur, located southeast of the main Swoyambhu stupa, was built in honor of Ananta Priya, the second queen of King Pratap Malla. Damaged in the 2015 earthquake, it was rebuilt and completed in 2019.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Anantapur.JPG"
        ],
        "latlng": [27.714743, 85.290482],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/lmqEjQByYoM"]
      },
      {
        "name": "10th Shamarpa Bell",
        "location": "Swoyambhu Mahachaitya",
        "history": "The bell was donated by the 10th Shamarpa, Mipam Chodrup Gyamtso, at Swayambhu in 1791. Located beside the main entrance to the Swayambhu Stupa, it expresses gratitude to the dharmakaya and is presented as a beautiful offering.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/10thShamarpaBell.JPG"
        ],
        "latlng": [27.714807, 85.29049099999997],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Pavan Bhairav",
        "location": "Swoyambhu Mahachaitya",
        "history": "A modest east-facing temple in front of the Karmaraja monastery to the east of Nagapura. The shrine contains a stone image of Pavan Bhairav in sukhasana with his consort. It was founded by King Pratapa Malla in N.S.773.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PavanBhairav.JPG"
        ],
        "latlng": [27.715008, 85.29053399999998],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/3vGfSLV5zQs"]
      },
      {
        "name": "Harati Maa Temple",
        "location": "Swoyambhu Mahachaitya",
        "history": "A traditional Nepali tiered temple dedicated to the goddess Hariti, also known as Ajima. Hariti is associated with smallpox and is worshipped for protection.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/HaratiMaa.png"
        ],
        "latlng": [27.715032, 85.29021699999998],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/jQYWqEAObOk"]
      },
      {
        "name": "Vayupur-Wind",
        "location": "Swoyambhu Mahachaitya",
        "history": "Located in the southwest corner of Swoyambhu Mahachaitya, this shrine is dedicated to the element of air. It prays for the removal of obstacles and disasters caused by wind.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/vayupur.png"
        ],
        "latlng": [27.714737, 85.290164],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/JDdexuCWl0M"]
      },
      {
        "name": "Agnipur",
        "location": "Swoyambhu Mahachaitya",
        "history": "Located in the northwest corner of Swoyambhu Mahachaitya, Agnipur features a dome with the red face of Agni Bhairava. It protects against fire-related disasters, with the shrine repainted annually on Kartik Purnima.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Agnipur.JPG"
        ],
        "latlng": [27.715266, 85.29000400000001],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Agnipur.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/LxIsKiW8dk0"]
      },
      {
        "name": "Nagpur",
        "location": "Swoyambhu Mahachaitya",
        "history": "Nagpur, also known as Basingaah, is a rectangular pit in front of the Amoghasidi Buddha niche. It symbolizes the water spirit and ensures good rainfall for harvests.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Nagpur.JPG"
        ],
        "latlng": [27.715055, 85.290506],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Nagpur.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/eecTBRLwHEU"]
      },
      {
        "name": "Basundhara Goddess (Vasupur)",
        "location": "Swoyambhu Mahachaitya",
        "history": "Located behind the Anantapur temple, Basundhara Mandir is consecrated by Guru Shantikaracharya. Worshiping here is believed to bring abundant crops.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Basundhara.JPG"
        ],
        "latlng": [27.714696, 85.290435],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Basundhara.glb",
        "virtualTour": null
      },
      {
        "name": "Shantipur",
        "location": "Swoyambhu Mahachaitya",
        "history": "Shantipur, located northwest of the main stupa, is also known as 'Akashpur' and 'Patalpur.' Originally a meditation cave, it holds significance in Swoyambhu's lore, symbolized by the 'Lotus flower' marking the stupa's origin. Hem Raj Shakya notes a tradition where people wrote letters to deceased loved ones, entrusted to Shantipur priests, who alone could enter the sacred space. This practice, held during 'Akadshi' and 'Dashami' in Krishna Paksha, was believed to bring peace to the departed. The exact date of Shantipur's establishment is uncertain, but it is believed to have been built by Shantikar Acharya, a revered Tantric master. According to legend, he has been meditating in an underground chamber since the 5th century.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Shantipur.JPG"
        ],
        "latlng": [27.715666, 85.29041899999999],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Bahu Mangal Dwar Chaitya",
        "location": "Swoyambhu Mahachaitya",
        "history": "Located in the southwest corner of the Swoyambhu stupa, between the main stupa and Vayupura shrine, the Bahu Mangal Dwara Chaitya features a dome base with four Tathagata Buddhas, totaling 124 Buddhas in all directions. Below the base are five tiers with six rows of thirty gods and symbolic doorways. Known as the 'Auspicious Chaitya with Many Doors' (Tashi Gormang Chorten) in Tibetan, it is named for its multiple doors and fortunate symbols.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/BahuMangaldwarChaitya.JPG"
        ],
        "latlng": [27.714775, 85.29023999999998],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Dev Avatar",
        "location": "Swoyambhu Mahachaitya",
        "history": "On the western side of Swoyambhu Mahachaitya stands a 10½-foot (3.2-meter) tall stone Buddha, the tallest in Swoyambhu. His right hand, in Varada mudra, is lowered in a gesture of charity, while his raised left hand holds the tip of a transparent monastic robe. This gesture, known in Nepal as the mudra of prediction, has earned him the nickname 'Buddha with the Gesture of Prediction.'",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DevAvatar.JPG"
        ],
        "latlng": [27.715151, 85.28995399999997],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Sundial",
        "location": "Swoyambhu Mahachaitya",
        "history": "An ancient sundial, located on the northwest side of Maha Chaitya with a group of chaityas, was used by locals to tell time. Its intricate carvings and inscriptions highlight the integration of traditional timekeeping methods into sacred spaces, reflecting its historical and cultural importance.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Sundial.JPG"
        ],
        "latlng": [27.715147, 85.29013800000001],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Chaturmukhi Chaitya",
        "location": "Swoyambhu Mahachaitya",
        "history": "The Chaturmukhi chaitya features four sides, each with distinct hand mudras. The Buddha depicted here is approaching full nirvana, marked by a three-tiered hairstyle, symbolizing full enlightenment.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/ChaturmukhiChaitya.JPG"
        ],
        "latlng": [27.715137, 85.29021899999998],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Ramyan Kutta Chaitya",
        "location": "Swoyambhu Mahachaitya",
        "history": "This rare chaitya, located on the north and northeast sides of the Swoyambhu Mahachaitya, features a cubical base with four Kubairs and an idol of Sukhavati Lokeshwor on the eastern side. Above, two additional cubical tiers hold 20 Lokeshwors and 20 more idols, including four in Charya dance postures. At the center, the four great Buddhas—Maha Amitabha, Maha Amoghasiddhi, Maha Akshobhya, and Maha Ratnasambhava—are depicted in unique forms. The top of the chaitya mirrors Swoyambhu, with four Buddhas, four Taras, and other significant elements like the Harmika and Triyodashbhuvan.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/RamyankuttaChaitya.JPG"
        ],
        "latlng": [27.715045, 85.29053899999997],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Sakhwaga",
        "location": "Swoyambhu Mahachaitya",
        "history": "Sakhwa, a lime powder, is mixed with water and spread over the dome of Maha Chaitya as part of a ritual. Traditionally, the Sakhwa Pyau Guthi applied the lime on the last day of Swasthani Barta during Magh. In the past 50-60 years, this practice has become more frequent, with individuals now able to pay to have the dome colored on their chosen day.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Sakhwaga.JPG"
        ],
        "latlng": [27.715212, 85.290208],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Aagam Chhen (Secret Ritual House)",
        "location": "Swoyambhu Mahachaitya",
        "history": "Aagam Chhen is a sacred space for the Buddhacharya priest family of Swoyambhu, dedicated to their tradition. 'Aagam' refers to secret rituals, and in this space, special pujas are held on certain days, with 2 to 3 distinct ceremonies performed.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AgamChhen.JPG"
        ],
        "latlng": [27.714718, 85.29030399999999],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AaganChhen.glb",
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/DiRu_gQUpe8"]
      },
      {
        "name": "Yogamvar",
        "location": "Swoyambhu Mahachaitya",
        "history": "The Yogamvar temple, located on the left side of the path from Agnipur to Santipura, symbolizes the union of sky and land. Its name comes from 'yog' (mixture) and 'amvar' (sky and land). The temple has no roof or enclosing wall, reflecting this union. Inside, a hole beneath a torana represents the deity Yogambara, with no images present.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Yogamvar.png"
        ],
        "latlng": [27.715549, 85.290188],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null,
        "videos": ["https://www.youtube.com/shorts/2IG7AhQBDqY"]
      },
      {
        "name": "Dharma Granthi Bhairav",
        "location": "Swoyambhu Mahachaitya",
        "history": "One of the unique and rare structures at Swoyambhu is the Dharma Granthi Bhairav, who holds a granthi (book) in his hands. This impressive statue is situated in the northwest, behind the Harati Temple and the Maha Chaitya, facing Biruparsha.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DharmaGranthiBhairab.JPG"
        ],
        "latlng": [27.715084, 85.290278],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/DharmaGanthiBhairav.glb",
        "virtualTour": null
      },
      {
        "name": "Birupakshya",
        "location": "Swoyambhu Mahachaitya",
        "history": "This site is situated in the northwest, behind the Harati Temple. The Birupakshya is a partially buried human figure. According to legend, if this figure ever erects in its full form, it will signal the end of the world or the beginning of a new 'Yuga.'",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/Birupakshya.JPG"
        ],
        "latlng": [27.715084, 85.290278],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Bhirupakshya.glb",
        "virtualTour": null
      },
      {
        "name": "Buddha Akshobhya",
        "location": "Swoyambhu Mahachaitya",
        "history": "The large Buddha statue in front of Shantipur, dating back to the 16th century, shows Buddha seated in vajrasana on a lotus throne with a lion seat, making the earth-touching gesture. While called Aksobhya, it actually represents Buddha Shakyamuni, as seen from the lion throne, which is associated with Shakyamuni, not Aksobhya.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/akshobhyaBuddha.png",
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AkshyobhaBuddha.png"
        ],
        "latlng": [27.715495, 85.29034899999999],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/AkshobhyaBuddha.glb",
        "virtualTour": null
      },
      {
        "name": "Hari Hari Hari Vahana Lokeshvara",
        "location": "Swoyambhu Mahachaitya",
        "history": "Across from Agnipur is the sacred Hari Hari Hari Vahana Lokeshvara, a replica of a monument from the Changu Narayan temple in Bhaktapur. This form of Avalokiteshvara, the bodhisattva of compassion, is shown sitting above Vishnu, Garuda (Vishnu's mount), a white lion (Lokeshvara's mount), and the serpent-king Takshaka. This symbolizes Avalokiteshvara as a supreme protector, respected even by Vishnu. The name 'Hari Hari Hari Vahana' refers to 'Lokeshvara's vehicle,' with 'Hari' symbolizing Vishnu and the animals, representing Avalokiteshvara's protection of all realms—sky, earth, and underworld.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/HariHariHariVahanaLokeshvara.JPG"
        ],
        "latlng": [27.715302, 85.290209],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Vasubhandu Memorial Chaitya",
        "location": "Swoyambhu Mahachaitya",
        "history": "The chaitya houses five Buddha statues, with a stone Vajra on the eastern side. It is believed to enshrine the relics of Guru Vasubandhu, a famous Buddhist scholar who visited Nepal. The four stone sculptures of the Buddha (Tathagatas) likely came from Swoyambhu Mahachaitya, where the original stone Buddhas were replaced by metal ones. The statue of Vairochana Buddha was added later by a donor.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/VasubhanduMemorialChaitya.JPG"
        ],
        "latlng": [27.715586, 85.289602],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Pulaun Syangu",
        "location": "Swoyambhu Mahachaitya",
        "history": "The chaitya, known locally as 'Pulan Syangu,' is often mistakenly believed to be older than the Swoyambhu Mahacaitya. However, it is historically significant as the site where Guru Manjusri taught and initiated his disciple, Bhiksu Gunakara. The name 'Pulan Syangu,' which translates to 'Old' or 'Worn Out Swoyambhu,' stems from a misunderstanding, as the chaitya is neither older nor in worse condition than Swoyambhu.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/PulaunSyangu.JPG"
        ],
        "latlng": [27.716425, 85.28850299999999],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/PuranaSyanguChaitya.glb",
        "virtualTour": null
      },
      {
        "name": "Bhagwan Pau",
        "location": "Swoyambhu Mahachaitya",
        "history": "This site marks the base of the stairs leading up to Swoyambhu Hill and the Swoyambhu Stupa. It holds special significance as a place of prayer and worship.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/BhagwanPau.png"
        ],
        "latlng": [27.714397, 85.29317100000003],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/BhagwanPau.glb",
        "virtualTour": null
      },
      {
        "name": "Janma Dwar",
        "location": "Swoyambhu Mahachaitya",
        "history": "Located at the base of the hill, this sacred site holds deep cultural and spiritual significance for the Newar community of the Kathmandu Valley. Here, they light butter lamps to honor departed family members, a tradition passed down through generations. The glowing light is believed to guide their loved ones toward peace in the afterlife.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/JanmaDwar.JPG"
        ],
        "latlng": [27.714742, 85.29159300000003],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/Janmadwar.glb",
        "virtualTour": null
      },
      {
        "name": "World Peace Pond",
        "location": "Swoyambhu Mahachaitya",
        "history": "It’s a new installation (year 1998) on the western side of Swoyambhu, there is a small pond called the World Peace Pond. In the center of the pond stands a brass statue of Buddha on a lotus flower. It is believed that if visitors successfully toss a coin into the ‘cauldron’ present in the pond's center, their wish will come true.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/WorldPeacePond.JPG"
        ],
        "latlng": [27.715842, 85.289467],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Gyanmala Bhajan Satal",
        "location": "Swoyambhu Mahachaitya",
        "history": "Gyanmala Bhajan Satal is a venue located within a rest house in Swoyambhu, where devotees primarily perform Buddhist devotional songs. Initially established as a satal, it later evolved into a space dedicated to these recitals. King Tribhuvan inaugurated this satal, which hosts performances each morning, on holidays, and daily throughout the Buddhist holy month of Gunla.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/GyanmalaBhajanSattal.JPG"
        ],
        "latlng": [27.714962, 85.29073399999999],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Five Symbolic Statues",
        "location": "Swoyambhu Mahachaitya",
        "history": "Near the top of the Swoyambhu staircase, five animal symbols representing the five Buddhas are displayed: a Peacock (alleviating suffering), Garuda (overcoming delusions), an Elephant Throne (commitment to Bodhisattva vows), a Lion (dispelling false views with wisdom), and a Horse Throne (assisting beings with great energy).",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/5SymbolicStatue.JPG"
        ],
        "latlng": [27.714867, 85.29087600000003],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Manjushree Paduka",
        "location": "Swoyambhu Mahachaitya",
        "history": "Manjushree's paduka is situated on Gau Singhe Hill. 'Paduka' refers to footwear or footprints. This particular paduka resembles Manjushree's footwear where his disciple Vishow Mitra's eyes fell on, as a consequence of a curse.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/ManjushreePaduka.png"
        ],
        "latlng": [27.715908, 85.287733],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Jyoti Kriti Mahavihar",
        "location": "Swoyambhu Mahachaitya",
        "history": "To the west of the Hariti temple is a square court surrounded by a unique two-story building facing east. This Baha, known as 'Jyoti Kirti Mahavihara,' was founded in 1393 A.D. by the donors of Kathmandu's Maru Tole. Later, Sakyabhiksu Sri Madhanju of Paravarta Vihara (Itum Baha) took responsibility for its care.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/JyotiKritiMahabihar.jpg"
        ],
        "latlng": [27.715109, 85.290055],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Samhyangu Mahavihar",
        "location": "Swoyambhu Mahachaitya",
        "history": "The building is located on the western front of the Swoyambhu Mahachaitya. Known by a different designation, Kvapa Chen, it is the primary monastery of Swoyambhu and the home of the principal deity of the Buddhacharya sangha. This monastery is thought to have been founded during the reign of the Licchavi king in the fifth century.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/SamhyanguMahabihar.JPG"
        ],
        "latlng": [27.715266, 85.28997800000002],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Karma Raja Mahavihar",
        "location": "Swoyambhu Mahachaitya",
        "history": "This monastery, founded in 1959 by Ven. Dagmar Tsamba Lobsang Yangphe and Ven. Nono Dechen Dorje, was built on property provided by Mr. Nati and Sanukaji Buddhacharyas. It was first offered to His Holiness the 16th Karmapa and then overseen by the 14th Shamarpa and the 17th Karmapa, Thaye Dorje. This location has historical and theological significance in Tibetan Buddhism.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/KarmaRajaMahabihar.jpg"
        ],
        "latlng": [27.715147, 85.290729],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Deva Dharma Mahavihar",
        "location": "Swoyambhu Mahachaitya",
        "history": "Deva Dharma Maha Vihar, known in Tibetan as Marmelhakang, is the oldest monastery established by a Bhutanese Lama. This is a branch of the ‘Kagyupa’ lineage known as ‘Drupa Kayyupa’. The ground floor level serves as a pati (shelter) for the pilgrims who come to perform rituals at Hariti temple and Swoyambhu stupa.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/DevaDharmaMahabihar.jpg"
        ],
        "latlng": [27.715051, 85.29008299999998],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Group of Chaityas",
        "location": "Swoyambhu Mahachaitya",
        "history": "On the north-west side of the main stupa, behind the Harati Maa temple, lies an area adorned with a collection of chaityas, created in various styles by different devotees over time. Chaityas in this place are as follows: 1. Asoka Chaitya (Licchavi Chaitya) 2. Sikharakutta Chaitya 3. Vajradhatu Chaitya 4. Bodhisattva Chaturvyuha Chaitya 5. Jalaharyopari Jinalankrta Chaitya 6. Dharmadhatu Jinalankrta Chaitya 7. Jvalavaliyukta Chaitya 8. Astakonakrti Padmachaitya 9. Chaturvyuha Buddha chaitya 10. Sumeru chaitya.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/GroupofChaitya.JPG"
        ],
        "latlng": [27.715196, 85.29015099999998],
        "monuments": [],
        "droneView": null,
        "model": "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/models/Swoyambhu/GroupofChaityas.glb",
        "virtualTour": null
      },
      {
        "name": "Amideva Buddha Park",
        "location": "Swoyambhu Mahachaitya",
        "history": "Amideva Buddha Park, located near Swoyambhu Hill and established in 2003, features a trio of towering statues. At the center is a 67-foot statue of Shakyamuni Buddha in his Amitābha form, symbolizing longevity and holding a bowl of immortality nectar. To his left stands a 64-foot statue of Chenrezig (Avalokitesvara), embodying supreme compassion, and to his right is a 64-foot statue of Guru Rinpoche (Padmasambhava), revered for spreading Vajrayana teachings and embodying primordial wisdom.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/amideva_buddha_park.png"
        ],
        "latlng": [27.716093, 85.28409199999999],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      },
      {
        "name": "Anandakuti Mahabihar",
        "location": "Swoyambhu Mahachaitya",
        "history": "Ananda Kuti Mahabihar, located along Swoyambhu's circumambulation path, began construction in 1996 B.S. and was completed in 1999. By 2001 B.S., the structure was finalized under Bhikshu Dharma Lok Mahasthavir's guidance. Three Buddha relics from Sri Lanka, symbolizing his birthplace in Nepal, were presented to King Tribhuvan. A stupa resembling Sri Lanka's Thuparama Chaitya was built to house these relics. Known for its Theravada Buddhism practice, the monastery offers free meditation to both locals and visitors, with a full day of meditation held on the fourth Saturday of every month.",
        "images": [
          "https://raw.githubusercontent.com/saugatshakya/assets/refs/heads/main/photos/Swoyambhu/AnandakutiMahabihar.jpg"
        ],
        "latlng": [27.717621, 85.28917000000001],
        "monuments": [],
        "droneView": null,
        "model": null,
        "virtualTour": null
      }
    ],
    "droneView": "https://github.com/saugatshakya/assets/blob/main/drone_view/swyambhu.png?raw=true",
    "model": null,
    "virtualTour": "https://virtualtour.airliftventures.com/swoyambu/",
    "videos": ["https://www.youtube.com/shorts/ty-bLn4lyb0"]
  }
]
